{
  "title": "Ayodhya Deepotsav: 15 temporary hospitals being set up",
  "content": "Ayodhya , The Uttar Pradesh health department on Tuesday said 15 temporary hospitals are being established for Deepotsav to ensure the health and well-being of devotees and tourists attending the festival.\n\n\"In addition, ambulances will be stationed round-the-clock at 10 key locations across the entire fair area,\" it said in a statement.\n\nAyodhya's Chief Medical Officer Dr. Sushil Kumar Baniyan, said that complete vigilance will be maintained regarding health services throughout Deepotsav.\n\n\"All hospitals will be equipped with essential medicines, paramedical staff, and specialist doctors,\" he said.\n\nAmbulances will be stationed at all times at the following locations: Control Room, Shri Ram Janmabhoomi Complex, Shri Hanumangarhi, Shri Kanak Bhavan Temple Complex, Pakka Ghat, Bandha Tiraha , Hanuman Gufa , Saket Petrol Pump, Ayodhya Dham Railway Station, and Shri Nageshwar Nath Temple, according to the statement.\n\nAdditionally, 50 beds have been reserved across three major hospitals to ensure emergency preparedness during the event, it said.\n\nThese include 20 beds at the Autonomous Rajarshi Dashrath Medical College in Ayodhya Nagar, 20 beds at the District Hospital Ayodhya, and 10 beds at Shri Ram Hospital, Ayodhya, it added.\n\nAdditional to these facilities, 15 temporary primary health-care centres are being set up at various key locations to provide immediate medical assistance to devotees and visitors throughout the celebration, according to the statement.\n\nTo further strengthen the health services during Deepotsav, teams of specialist doctors from the districts of Amethi, Ambedkarnagar, Barabanki, and Sultanpur will also arrive in Ayodhya.\n\n\"These teams will be stationed at various locations throughout the event to provide health services to the devotees,\" it added.\n\nNearly 28 lakh lamps will illuminate 56 ghats along the Saryu river in Ayodhya as part of the ninth edition of deepotsav in the city.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/ayodhya-deepotsav-15-temporary-hospitals-being-set-up-101760433856644.html",
  "scraped_timestamp": "2025-10-14T15:08:01.744388",
  "content_length": 2028,
  "word_count": 303,
  "source_domain": "www.hindustantimes.com",
  "publication_date": "2025-10-14"
}