{
  "title": "Bloopers to ‘forged’ will: Sunjay Kapur inheritance battle continues in Delhi HC | Top points",
  "content": "The mix of power and family struggle over late industrialist Sunjay Kapoor's will continued on Monday as his and actress Karisma Kapoor's children questioned the authenticity of the purported will before the Delhi High Court, claiming that it was riddled with \"bloopers\" and the mistakes were \"uncharacteristic\" of their father.\n\nSamaira, 20, and Kiaan Kapur, 15, have filed a suit against Sunjay Kapur's wife, Priya Sachdev Kapur, her son, as well as the late industrialist's mother, Rani Kapur, and Shradha Suri Marwah, who is a purported executor of the will. The children are seeking a share in their late father's assets.\n\nAppearing for the Kapur children, senior advocate Mahesh Jethmalani submitted before Justice Jyoti Singh the errors in Sunjay's purported will, which accounts for his assets reportedly worth₹30,000 crore.\n\nLast week, the counsel for Karisma Kapoor's children said that they were informed about the will until July 30, even though it had reportedly been executed on March 21.\n\nThe inheritance battle began just a month after Sona Comstar chairperson Sunjay Kapur's death in London. His mother, Rani Kapur, had in July cited a 2015 will and claimed to be the sole beneficiary of the estate of her late husband company founder Surinder Kapur\n\n⦁ 53-year-old industrialist Sunjay Kapur died on June 12 due to a heart attack in London. The power struggle over his company, Sona Comstar, and other personal assets began nearly a month after his passing, embroiling the Kapur family in a major legal battle.\n\n⦁ Days after his death, Sona Comstar unanimously appointed Jeffrey Mark Overly as the chairman and Sunjay's wife, Priya Sachdev Kapur, as a non-executive director.\n\n⦁ Sunjay Kapur's mother, Rani Kapur, had earlier cited a 2015 will and claimed to be the sole beneficiary of the estate. She claimed that she was being coerced into signing certain documents without revealing their content.\n\n⦁ Rani Kapur accused Soma Comstar of exploiting the moment to \"wrest control and usurp the family legacy\". She said that she still didn't know what happened to her son, adding that she needed closure.\n\n⦁ A legal battle is ongoing in the court, involving Sunjay Kapur and Karisma's kids, Samaira and Kiaan, and his wife Priya Kapur and her minor son, and his mother Rani Kapur.\n\n⦁ In this case, which has seen several ups and downs in the past three months, the Delhi High Court last month allowed Priya Kapur to file Sunjay Kapur's list of assets in a sealed cover. It told the counsels to ensure that the contents would not be leaked to the media. Priya Kapur was also directed to share a copy of the will with Rani Kapur.\n\n⦁ Additionally, Priya Kapur informed the court that Samaira and Kiaan have already received₹1,900 crore from the family trust. The children's counsel hit out at Priya Kapur, saying that by making such an information public, she has made the two children target of kidnapping.",
  "url": "https://www.hindustantimes.com/india-news/sunjay-kapur-will-errors-forged-sona-comstar-karisma-kapoor-children-delhi-hc-hearing-top-points-101760423354732.html",
  "scraped_timestamp": "2025-10-14T15:08:15.358293",
  "content_length": 2919,
  "word_count": 487,
  "source_domain": "www.hindustantimes.com",
  "publication_date": "2025-10-14"
}