{
  "title": "Coldrif among 3 Indian cough syrups flagged as ‘substandard’ by WHO | Which are they?",
  "content": "After the death of around 22 children due to the consumption of a an adulterated cough syrup, theWorld Health Organisation(WHO) has also raised an alarm regarding the sale and use of Coldrif and two other cough syrups.\n\nIn its latest advisory, the UN health body has also flagged Respifresh TR from Rednex Pharmaceuticals and ReLife from Shape Pharma as contaminated and ‘substandard’ products\n\nThese cough syrups were flagged after around 22 children died due to the alleged consumption ofColdrif cough syrup. As per Central Drugs Standard Control Organization, the medicine contained toxic diethylene glycol in quantities nearly 500 times the permissible limit.\n\nCDSCO also informed WHO of the deaths and stated that none of the contaminated medicines had been exported.\n\nAlso Read |WHO warns against 3 cough syrups in India after children's deaths in Madhya Pradesh\n\nColdrif is a cough syrup manufactured by Tamil Nadu-based Sresan Pharmaceuticals. In October 2025, health authorities in Madhya Pradesh reported deaths of multiple children, all of which pointed to a contaminated batch of the cough syrup, which was commonly prescribed for paediatric use.\n\nAfter samples were collected and sent, it was found that Coldrif contained 8.6 per cent Diethylene Glycol (DEG) in the cough syrup - far beyond permissible limit of 0.1 percent.\n\nFollowing this, a wave of states issued stop use orders and proceeded to ban the medicine. Advisories were also issued which stated that the syrup must not be given to children below the age of two years.\n\nFurthermore, Sresan Pharmaceuticals, had its manufacturing license revoked and its owner G Ranganathan was arrested.\n\nAlso Read |How a toxic cough syrup led to a pharma firm's shutdown | Coldrif timeline\n\nManufactured by Rednex Pharmaceuticals in Gujarat, Respifresh TR has not been linked to any of the children's deaths. However, it was found that the cough syrup contains 1.342% DEG, which is above the permissible level.\n\nThe syrup, manufactured in January 2025 and set to expire in December 2026, has been recalled since the findings were released and all production has been halted by the Indian government.\n\nThe third syrup under the scanner is ReLife by Shape Pharma. Regulators also found 0.616% DEG contamination in the cough syrup, prompting an immediate recall of the product and halt in production.\n\nFurthermore, Shape Pharma was also asked to halt its production of all medical products.\n\nIn Madhya Pradesh'sChhindwara district, a total of 22 children died due to the consumption of the contaminated cough syrup Coldrif.\n\nThe majority of the children succumbed to the kidney infections and failure caused by the oral medication.",
  "url": "https://www.hindustantimes.com/india-news/coldrif-among-3-indian-cough-syrups-flagged-as-substandard-by-who-which-are-they-101760422624456.html",
  "scraped_timestamp": "2025-10-14T15:08:07.876790",
  "content_length": 2687,
  "word_count": 426,
  "source_domain": "www.hindustantimes.com",
  "publication_date": "2025-10-14"
}