{
  "title": "Finance",
  "content": "An official explained that all income tax returns (ITRs) claiming refunds above a specific threshold are subjected to new additional checks. The threshold for these enhanced reviews varies depending on the category of taxpayers.\n\nIndia's net direct tax collections reached ₹11.89 lakh crore between April 1 and October 12, marking a 6.33% year-on-year increase. Despite a 15.98% drop in refunds issued, gross tax collections saw a 2.36% rise to ₹13.92 lakh crore. The government has set a net direct tax revenue target of ₹25.2 lakh crore for FY26.\n\nIndia's net direct tax revenue has risen by 6.33% to over ₹11.89 lakh crore by October 12th of the current fiscal year. This growth is attributed to robust corporate tax collections and a reduction in refund payouts. The government aims for a 12.7% increase in direct tax collection for the full fiscal year.\n\nIndia's chartered accountants' body, ICAI, is working on a report to boost homegrown multi-disciplinary firms. The goal is to help these firms secure finances for global expansion. This initiative supports India's ambition to become a developed economy by 2047. The move aims to build indigenous professional service giants capable of competing internationally.\n\nIndian tax authorities are targeting over 400 individuals for evading taxes on crypto trades conducted on Binance. These individuals allegedly hid their profits from digital assets parked in offshore wallets, failing to disclose them in their income tax returns. The Central Board of Direct Taxes has directed investigation wings to report actions by October 17.\n\nNITI Aayog proposes significant reforms to the Income Tax Act, 2025, including decriminalizing 12 minor offenses and reducing mandatory minimum sentences. The aim is to foster a more predictable and less coercive tax administration by shifting the burden of proof to tax authorities and emphasizing trust-based governance.\n\nRoad transport and railway ministries have achieved record capital expenditure utilization in the first half of the financial year, spending over ₹3.1 lakh crore. This combined spending represents more than half of the government's total capex outlay for the year, with the road transport ministry reporting its highest ever utilization.\n\nIndia's general government debt is projected to decline steadily over the next decade, falling from 81% of GDP to 71% by FY35, driven by sustained GDP growth and prudent fiscal management. While the Centre's consolidation efforts are positive, elevated state debt and interest payments remain key challenges for fiscal health.\n\nIndia's combined pension schemes, NPS and APY, have surpassed Rs 16 lakh crore in Assets Under Management, with a subscriber base exceeding 9 crore. PFRDA is introducing initiatives like the Multiple Scheme Framework and a NPS Platform Workers Model to enhance investment choices and expand coverage, particularly for informal sector participants.\n\nThe statistics ministry met with fintech firms to boost the national statistical system. Discussions focused on data accessibility and filling information gaps. Secretary Saurabh Garg spoke about data as a public good, proposing a three-tier access framework for open, registered, and restricted data. The government is also working to democratize AI resources for all citizens.\n\nRBI Governor Sanjay Malhotra announced the conceptualization of a Unified Lending Interface (ULI) at the Global Fintech Fest 2025. This initiative aims to leverage data for alternative credit models, alongside ongoing work on digital customer onboarding standards. The Governor also highlighted AI's potential to advance India's Digital Public Infrastructure.\n\nIndia's Unified Payments Interface (UPI) has officially launched in Qatar, expanding beyond select airport duty-free shops to all retail outlets. This move significantly benefits the 830,000 Indian expatriates in Qatar, facilitating faster remittances and reduced transaction costs. The new payment option aims to connect the diaspora more closely with India.\n\nThe Reserve Bank of India has linked its Bharat Connect bill payment system with the FX-Retail platform, allowing individual customers to purchase US dollars digitally. This initiative, initially available for customers of five major banks, enables transactions for currency notes, forex cards, and remittances through integrated banking and payment apps, aiming for competitive pricing and enhanced transparency.\n\nThe Supreme Court has sought a response from the Finance Ministry regarding a petition challenging the constitutional validity of the Securities Transaction Tax (STT). The petitioner argues that STT, levied on stock market transactions, constitutes double taxation and is punitive as it's paid regardless of profit, violating fundamental rights.\n\nIndian states are increasingly adopting Infrastructure Investment Trusts (InvITs) to monetise assets, inspired by the federal government's success. States like Maharashtra, Gujarat, and Tamil Nadu are preparing independent InvITs, while Rajasthan explores pooling assets with NHAI. This strategy aims to attract wider investment, diversify infrastructure sectors, and recycle capital for new projects.\n\nThe CBIC has mandated a 90% provisional refund for inverted duty structure (IDS) claims filed from October 1, 2025, to alleviate working capital issues for sectors like textiles. This interim measure, similar to zero-rated supplies, follows a GST Council announcement for exporters, though its full implementation may require legal changes.",
  "url": "https://economictimes.indiatimes.com/news/economy/finance",
  "scraped_timestamp": "2025-10-14T15:08:03.933990",
  "content_length": 5534,
  "word_count": 808,
  "source_domain": "economictimes.indiatimes.com",
  "publication_date": "2025-10-14"
}