{
  "title": "NewsNews",
  "content": "The announcement came during the first minister's keynote speech at the SNP conference in Aberdeen.\n\nThe SNP are not only hopeful of victory at next year's Scottish election, but are even talking of an outright majority.\n\nThe legislation would have given people diagnosed with addiction the right to treatment within three weeks.\n\nThe broadcaster is planning to axe its Aberdeen news programme as part of proposals to save £2.5m.\n\nThe saltire has long been embraced by supporters of Scottish independence – but now it is being unfurled for a different cause.\n\nThe SNP are not only hopeful of victory at next year's Scottish election, but are even talking of an outright majority.\n\nThe union says ministers have \"shamefully reneged\" on a previous pay agreement.\n\nParty leader John Swinney's strategy is to focus on winning a majority of MSPs at next year's election.\n\nThe legislation would have given people diagnosed with addiction the right to treatment within three weeks.\n\nA report recommends an independent review and also identifies potential savings of millions of pounds.\n\nMinisters plan to nationalise the port because new ferries for the Arran route are too big to fit existing facilities.\n\nThe first minister will declare a mandate for a second independence referendum, if the SNP wins a majority of seats in the 2026 Holyrood election.\n\nThe EIS said it had been years since the SNP pledged to reduce teachers' class contact time.\n\nA joint report has found confusion over care reform delivery and a lack of clarity around funding.\n\nThe reforms are designed to help prevent murders and suicides and modernise the justice system.\n\nThere is a renewed emphasis on independence as the party meets less than a year before the Scottish election.\n\nDeaths have outnumbered births in Scotland for a decade but record levels of immigration mean the population is still rising.\n\nThe US president did not leave the UK as the toast of Scotch whisky distillers after failing to cut tariffs.\n\nThe former first minister suggested the debate around immigration in Scotland had become 'toxic'.",
  "url": "https://www.bbc.com/news/scotland/scotland_politics",
  "scraped_timestamp": "2025-10-14T15:08:32.384219",
  "content_length": 2084,
  "word_count": 340,
  "source_domain": "www.bbc.com",
  "publication_date": "2025-10-14"
}