{
  "title": "SC asks Daman MP to approach Bombay HC with plea seeking SIT probe into irregularities",
  "content": "New Delhi, The Supreme Court on Tuesday refused to entertain a plea of Daman and Diu MP seeking a court-monitored SIT probe into alleged financial irregularities of about₹33 crore in the renovation, demolition, and restoration of the Union Territory secretariat building at Moti Daman.\n\nA bench comprising Chief Justice B R Gavai and Justice K Vinod Chandran asked Member of Parliament Umeshbhai Babubhai Patel to approach the Bombay High Court with his plea.\n\nDuring the hearing, the counsel for Patel submitted that the MP was facing 52 FIRs and was also challenging an order passed by the Lokpal.\n\nThe lawyer submitted that the multiple cases against the MP were a result of his raising his voice against corruption and financial mismanagement in the Union Territory administration.\n\n\"I am a Member of Parliament. There have been 52 FIRs against me. I am here also challenging the Lokpal order. All this has the same cause of action. All this is happening because I raised my voice,” the lawyer said.\n\n“Can the law be different for a Member of Parliament and for a common citizen,” the CJI asked.\n\nWhen the counsel argued that Patel was an elected representative acting on behalf of the people, CJI Gavai responded, “That is okay. You can approach the jurisdictional high court.”\n\nThe bench then directed Patel to move the Bombay High Court, observing that the matter would be taken up expeditiously possibly as early as a day after it is filed.\n\nThe plea had sought an independent probe into alleged irregularities in the secretariat project at Moti Daman, claiming that funds to the tune of₹33 crore were misused under the guise of renovation and restoration work.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/sc-asks-daman-mp-to-approach-bombay-hc-with-plea-seeking-sit-probe-into-irregularities-101760427731748.html",
  "scraped_timestamp": "2025-10-14T15:08:09.114007",
  "content_length": 1763,
  "word_count": 293,
  "source_domain": "www.hindustantimes.com",
  "publication_date": "2025-10-14"
}