{
  "title": "Top Maoist leader Sonu surrenders with 60 cadres in Maharashtra: Officials",
  "content": "Communist Party of India (Maoist) politburo member Mallojula Venugopal Rao alias Sonu surrendered before authorities in Maharashtra’s Gadchiroli district on Tuesday along with around 60 cadres, officials said.\n\nVenugopal Rao, one of the most influential figures in the CPI (Maoist) hierarchy, laid down arms in the presence of Maharashtra chief minister Devendra Fadnavis in Gadchiroli, officials confirmed.\n\n“This is a big blow to the CPI (Maoist) movement. Venugopal Rao’s decision to abandon armed struggle reflects the growing realisation among senior Maoist leaders that violence has no future,” an official said.\n\nChhattisgarh’s deputy chief minister Vijay Sharma said the development underscored a decisive shift in the region.\n\n“The people of Bastar are determined to end Naxalism,” he said, recalling that a female Polit Bureau member had surrendered a year ago.\n\nAlso Read:CPI (Maoist) spokesperson Sonu reiterates suspension of armed struggle\n\n“Her husband’s surrender today shows the changing ground realities. The administration will rehabilitate those who give up violence, but those who continue armed resistance will be dealt with firmly by security forces,” Sharma added.\n\nFollowing the death of his elder brother, top Maoist leader Kishenji, Venugopal was believed to have taken charge of the CPI (Maoist)’s armed resistance against Operation Green Hunt in West Bengal, particularly during the Lalgarh movement.\n\nOver the years, he continued to be regarded as a key strategist and ideologue within the Maoist hierarchy, operating mostly from deep forest zones across central India, including parts of Chhattisgarh, Maharashtra, Telangana, and Odisha.\n\nAccording to officials, Venugopal had signalled his willingness to surrender earlier this year.\n\nA press release dated August 15, which surfaced in September, had announced his intention to abandon armed struggle. According to people aware of the details, he later secured the backing of a sizable faction of Maoist cadres across several states who endorsed his decision.\n\nSecurity officials said the surrender opens a window to further consolidate peace inLeft Wing Extremism-affected areas and strengthen ongoing outreach and rehabilitation initiatives.\n\n“This is a moment to build trust and ensure that those who return to the mainstream are given a fair opportunity to rebuild their lives,” an official added.\n\nWith the surrender of Venugopal, the CPI (Maoist) has lost not just its ideological heft but also its communications network and people’s connect in South Bastar, officials said. His exit, they added, is likely to deepen internal divisions and accelerate the weakening of the organisation’s upper ranks.",
  "url": "https://www.hindustantimes.com/india-news/top-maoist-leader-sonu-surrenders-with-60-cadres-in-maharashtra-officials-101760426921907.html",
  "scraped_timestamp": "2025-10-14T15:08:11.571223",
  "content_length": 2688,
  "word_count": 399,
  "source_domain": "www.hindustantimes.com",
  "publication_date": "2025-10-14"
}