{
  "title": "What happened to Tata Motors share today, why is it down? Details here",
  "content": "Tata Motors shares slumped nearly 40 per cent on Tuesday as the stock began trading without the value of its commercial vehicles business, marking the final leg of the automaker’s much-anticipated split into two listed entities.\n\nIn a special one-hour pre-open session held between 9 aam and 10 am on the BSE and NSE, Tata Motors’ shares were discovered at₹400 apiece, down 39.5% (₹260.75) from Monday’s closing price of₹660.75. The sharp fall reflects the price adjustment post the demerger of the company’s trucks and buses business into a new entity.\n\nTracklatest updates on Tata Motors share price here\n\nThis special trading session, introduced by Indian exchanges in 2023 for companies undergoing demergers, was aimed at minimizing volatility during price discovery.\n\nTuesday’s trading marks the completion of Tata Motors’ demerger, announced in March 2024, aimed at unlocking the value of its passenger vehicles (PV), electric vehicles (EV), and Jaguar Land Rover (JLR) businesses separately from its commercial vehicle (CV) operations.\n\nThe company fixed October 14 as the record date to determine eligible shareholders. Shares of TMLCV are not yet listed and are expected to debut on the exchanges within 45–60 days, likely by mid-November.\n\nBrokerage Nuvama Wealth Management, in a note to clients on Monday, had valued Tata Motors’ commercial vehicle business at₹274 per share, or about₹1 trillion. The difference between Monday’s closing price and Tuesday’s discovered price is expected to roughly reflect this value.\n\nThe CV unit is India’s largest manufacturer of trucks and buses, and Tata Motors has been bolstering its global footprint - including a €3.8 billion ($4.4 billion) all-cash acquisition of Italy’s Iveco Group NV in July.\n\nThe demerger comes at a sensitive time for Tata Motors. Its luxury unit, JLR, has faced a series of setbacks this year - from US tariffs on UK-made vehicles to a crippling cyberattack that temporarily shut factories worldwide and required an emergency government bailout. Production has only partially resumed in recent weeks.\n\nTata Motors stock had already been under pressure ahead of the split. It closed 2.7% lower on Monday, marking seven consecutive sessions of decline, and is down nearly 29% over the past year, compared with a 1% rise in the Nifty 50 index.\n\nFollowing regulatory approval from the Ministry of Corporate Affairs on October 13, the company officially changed its name from Tata Motors Ltd. to Tata Motors Passenger Vehicles Ltd.\n\nThe CV unit will assume the Tata Motors Ltd. name once its listing process is complete. Typically, listing and trading approvals for spun-off entities take four to six weeks after the record date.\n\nTata Group Chairman N Chandrasekaran has positioned the demerger as a strategic move to simplify the group structure, sharpen business focus, and align capital allocation with growth priorities - especially in EVs and global luxury markets.",
  "url": "https://www.hindustantimes.com/india-news/what-happened-to-tata-motors-share-today-why-is-it-down-details-here-101760429746785.html",
  "scraped_timestamp": "2025-10-14T15:08:05.450504",
  "content_length": 2943,
  "word_count": 462,
  "source_domain": "www.hindustantimes.com",
  "publication_date": "2025-10-14"
}