{
  "title": "100K applications for new voters rejected by EC",
  "content": "New Delhi: Over 100,000 Form-6 applications for registration of new voters were rejected following the publication of the draft electoral roll in Bihar, official data from the state’s chief electoral officer (CEO) shows.\n\nAccording to the data, 106,304 Form-6 applications were rejected after the draft roll was released on August 1 as part of the ongoing special intensive revision (SIR) process in the poll-bound state. Around 2.26 million applications were submitted during the claims and objections period that remained open until September 1, of which 2.15 million were accepted.\n\nForm-6 is the standard application used by citizens to be included in the electoral roll for the first time. The sharp increase in applications — from around 1.2 million during the special summary revision in January this year to 2.26 million after the draft roll in August — indicates a surge in new registrations, many of them filed after deletions carried out during the verification drive.\n\nDistrict-wise data uploaded by the Bihar CEO shows the highest number of rejections were recorded in Purnia (8,946), Sitamarhi (6,451), Madhubani (5,218), and Kishanganj (5,009). These districts share borders with Nepal or West Bengal and have historically seen higher scrutiny during voter roll revisions due to cross-border movement and demographic sensitivities. In contrast, rejection figures were lower in central Bihar districts such as Patna (4,134) and Nalanda (2,127), the data shows.\n\nThe draft roll published on August 1 listed 72.4 million electors, down from 78.9 million registered voters earlier in the year. About 6.5 million names were deleted after booth level officers (BLOs) marked them as deceased, absent, permanently shifted, or enrolled elsewhere. Following the draft publication, the Election Commission (EC) opened a one-month window for new voters to apply (Form-6), for existing voters to update details (Form-8), or to raise objections to entries in the rolls.\n\nData on objections uploaded by the Bihar CEO shows only a few cases where individuals were challenged as “not Indian citizens.” The objections are listed assembly constituency–wise. A preliminary analysis of three border districts—Kishanganj, Supaul, and Purnia—shows very few such cases.\n\nIn Kishanganj, which shares borders with both Nepal and West Bengal, only two objections were filed on grounds of suspected non-citizenship. Both were later rejected by the Electoral Registration Officer (ERO) after hearings. Kishanganj, with a majority Muslim population and proximity to international borders, often sees political debate over alleged “illegal voters,” though official records show minimal objections this year.\n\nIn Purnia, five individuals were objected to as suspected foreign nationals, and the official website lists their status as either “hearing scheduled” or “forwarded to ERO.” In Supaul, 14 such objections were filed, with updates such as “forwarded to ERO” or “FVR submitted” (Field Verification Report).\n\nEarlier in July, EC officials had said that the SIR process would involve a detailed verification drive from August 1 to 30 to identify and remove ineligible names. Officials also said that BLOs had reported encountering individuals from Nepal, Bangladesh, and Myanmar during house-to-house verification who possessed Indian documents such as Aadhaar, ration cards, and domicile certificates.\n\nWhen announcing the SIR process in June, the Election Commission stated that the revision was necessary to address multiple concerns, including the inclusion of ineligible or foreign nationals in the electoral list and large-scale migration. The final electoral roll for Bihar was published on September 30.\n\nThe data indicates that while deletions and verifications were widespread across the state, actual objections citing foreign nationality remained negligible, even in sensitive border districts.",
  "url": "https://www.hindustantimes.com/india-news/100k-applications-for-new-voters-rejected-by-ec-101760420980362.html",
  "scraped_timestamp": "2025-10-14T14:55:00.331689",
  "content_length": 3894,
  "word_count": 577,
  "source_domain": "www.hindustantimes.com"
}