{
  "title": "2 deputy CMs in BJP’s first list of 71 for Bihar polls",
  "content": "The Bharatiya Janata Party (BJP) on Tuesday released the first list of 71 candidates for the upcoming Bihar assembly elections, naming two sitting deputy chief ministers, 10fresh faces and twoturncoats, and dropping the speaker and twoincumbent lawmakers.\n\nThe announcement came amid a churn in the National Democratic Alliance (NDA) which announced its seat-sharing arrangement over the weekend but has since been stuck in tense talks among allies driving hard bargains. There are threedays to go for the nomination to close for the first phase, when 122 seats go to the polls on November 6. In the second phase, 121 seats will go to the polls on November 11, and the votes will be counted on November 14.\n\nLater in the day, the Hindustani Awam Morcha (Secular) released a list of six candidates, repeating four of themand dropping one.\n\nThe BJP list included 35 people from general castes, six from scheduled caste and scheduled tribe communities, 11 from other backward classes and 19 from extremely backward classes. The list contained nine women including minister Renu Devi, Gayatri Devi, Devanti Yadav and Rama Nishad.\n\n“Under the leadership of Hon’ble Prime Minister Narendra Modi and Hon’ble chief minister Nitish Kumar, with the unity of our workers and the blessings of the people, development will triumph once again in Bihar.With your commitment, service, and dedication to the people, Bihar will once again move forward on the path of good governance, progress, and stability,” state BJP chief Dilip Jaiswal posted on X.\n\nThe party denied tickets to threesitting MLAs, including assembly speaker and seven-time MLA from Patna Sahib, Nand Kishore Yadav, and changed candidates on 19 seats. Nearly 50 candidates were retained. The second list of 30 candidates will be released soon, party office bearers said.\n\n“I stand with the decision taken by the BJP. I have no complaints. I welcome the new generation of leadership,” said Nand Kishore Yadav who was first elected in 1995.\n\nTwo ex-MPs, Ram Kripal Yadav (from Danapur) and Sunil Kumar Pintu (from Sitamarhi) were picked. The list also includes the names of three former MLCs, one former MLA, a Congress turncoat and the wife of an ex-MP. Ram Kripal Yadav defeated Misa Bharti of the Rashtriya Janata Dal (RJD) from Danapur twice in 2014 and 2019, but lost to her in 2024. Pintu, an ex-Janata Dal (United) MP from Sitamarhi, was denied a ticket and joined the BJP on Monday.\n\nDeputy CM Samrat Choudhary, who is a member of the legislative council, will contest from Tarapur and another deputy CM Vijay Kumar Sinha was retained from Lakhisarai. Sitting MLC and state cabinet member Mangal Pandey will contest from Siwan.\n\nChoudhary will be contesting elections after over a decade and last won an assembly election from Parbatta in 2010 on a Rashtriya Janata Dal (RJD) ticket.\n\nTwo other sitting MLAs — Arun Kumar Sinha (Kumhrar) and Amrendra Pratap Singh (Ara) — were denied tickets.\n\nSujit Kumar Singh, an IRS officer who joined the BJP on Monday after resigning from civil service, will replace his wife Swarna Singh from the Gaura Bauram seat. Some other prominent names on the list include Prem Kumar from Gaya, former deputy chief minister Tarkishore Prasad from Katihar and Alok Ranjan Jha from Saharsa.\n\nSeveral ministers also featured in the list, including Renu Devi (Bettiah), Nitin Nabin (Bankipur), Nitish Mishra (Jhanjharpur), Jibesh Mishra (Jale), Sanjay Saraogi (Darbhanga), Neeraj Kumar Singh Bablu (Chhatapur) and Kedar Prasad Gupta (Kurhani), all of whom were renominated. Art and culture minister Motilal Prasad however, was dropped, and his Riga seat went to Baidyanath Prasad.\n\nSiddharth Saurav, who won the Bikram seat on a Congress ticket in 2020, was named the BJP candidate from there, a day after his formal induction into the party.\n\nThe announcement came amid protracted negotiations within the NDA, which on Sunday had announced that the BJP and JD(U) will contest on 101 seats each, the LJP (Ram Vilas) will contest on 29, and the Hindustani Awam Morcha (Secular) and Rashtriya Lok Morcha will contest six seats each.\n\nBut tensions have erupted within NDA constituents since then, especially in the JD(U) and smaller parties.\n\nOn Tuesday, JD(U) legislator Gopal Mandal sat on a dharna near CM Nitish Kumar’s residence. Mandal, who is in his fourth consecutive term from the Gopalpur seat in Bhagalpur district, reached 1, Anney Marg, with a group of slogan-shouting supporters. Bhagalpur MP Ajay Kumar Mandal sought to resign over seat-sharing, stating that his opinions were not being heard on ticket distribution.\n\nIn his letter addressed to JD(U) chief Nitish Kumar, Bhagalpur MP Ajay Mandal argued that it was “extremely sad” that he wasn’t consulted over ticket distribution in his own constituency. “I’m not even being allowed to meet you, nor is my opinion being heard. I find it difficult to understand why I should continue as an MP, concerned about my self-respect and the party’s future, when the opinions of dedicated workers and local leadership in the organisation no longer matter,” he wrote.\n\nHAM chief Jitan Ram Manjhi also hinted at problems. “When the seat-sharing has already been decided, why are others fielding candidates on JD(U) seats? If that’s the case, I too will field my own candidates from Bodh Gaya and Makhdumpur,” he said in a veiled statement apparently meant for Union minister Chirag Paswan.\n\nBut the NDA denied any reports of a rift. “The Opposition knows that they are losing the election. They are planting stories, spreading rumours about what is going on in the NDA. Nitish Kumar is absolutely happy. He is ready for the elections. He will campaign for the NDA. He is keeping an eye on everything,” said senior JD(U) leader Sanjay Jha.",
  "url": "https://www.hindustantimes.com/india-news/2-deputy-cms-in-bjp-s-first-list-of-71-for-bihar-polls-101760467974438.html",
  "scraped_timestamp": "2025-10-15T09:48:25.812248",
  "content_length": 5772,
  "word_count": 944,
  "source_domain": "www.hindustantimes.com"
}