{
  "title": "40 lakh devotees visit flock to UP temples in first 4 days of Navratri",
  "content": "Lucknow, An estimated 40 lakh devotees visited hundreds of Durga temples across Uttar Pradesh in the first four days of Navratri, spanning from the Vindhyavasini temple in the east to the Shakambhari Devi Dham in the west, officials said on Friday.\n\nThe surge in attendance has been largely attributed to the state government's efforts in the past eight years to preserve ancient heritage, while also enhancing it with modern amenities to create a new pilgrimage experience, an official statement said.\n\nThe number is projected to cross 1 crore on the final three days of Navratri – Saptami, Ashtami and Navami.\n\nSince the beginning of the festival on September 22, the Maa Vindhyavasini Dham in Mirzapur has welcomed 12 lakh pilgrims, with 3.5 to 4 lakh devotees visiting daily, marking a massive increase from ordinary days, the statement said.\n\nThe construction of the Vindhyachal Corridor has improved pilgrim facilities, with the authorities anticipating a peak of 6-7 lakh devotees per day during the final three days of Navratri.\n\nIn Varanasi, the Maa Vishalakshi Devi temple, one of the 51 Shakti Peeths, witnessed a rise in daily footfall from 5,000-7,000 to 8,000-10,000 during Navratri, with the numbers expected to rise to 20,000-30,000 daily during the final three days.\n\nThe shrine draws a large number of devotees from south India.\n\nThe state government has proposed a Vishalakshi Corridor to further facilitate ‘darshan’ at the temple.\n\nThe other shrines in Varanasi, such as the Gayatri Shakti Peeth Choura Devi temple and the Maa Kushmanda temple, are also reporting large crowds, expecting 40,000-50,000 and 15,000-20,000 pilgrims on Navami, respectively, the statement said.\n\nIn western Uttar Pradesh, the Shakambhari Devi Shakti Peeth in Saharanpur has drawn 50,000 devotees daily, while the Tripur Bala Sundari temple has witnessed a daily footfall of 40,000, with both expecting up to 1 lakh devotees per day on the last three days of Navratri, the statement said.\n\nSimilarly, the Maa Pateshwari Devi temple in Balrampur is witnessing 50,000 daily visitors, and the figures are expected to rise to 1-1.5 lakh per day on Saptami, Ashtami and Navami, it added.\n\nThe Maa Alopi Shankari Shakti Peeth in Prayagraj is receiving more than 1.25 lakh devotees daily, and the numbers are expected to go up to 2-2.5 lakh per day during the final three days.\n\nSimilarly, the Maa Kalyani Devi temple and the Maa Lalita Devi temple in Prayagraj are drawing 70,000-80,000 pilgrims each on a daily basis, the statement said.\n\nThe state government's investment of more than₹6 crore in amenities – pilgrim shelters, drinking water, entrance gates, beautification, and facade lighting – has directly contributed to the increase in pilgrim numbers, it said.\n\nIn Gorakhpur, the tourism development’s investments totalling₹2.13 crore helped renovate the Tarkulha Devi temple in Chauri Chaura, transforming it into a major pilgrimage centre, with an average of 50,000 daily visitors and over 1 lakh expected on Navami.\n\nThe Budhiya Mai temple in Gorakhpur is also witnessing a surge in rush, expecting 1 lakh devotees daily on the final three days of Navratri, with the significant jump attributed to a₹1.6 crore development project, the statement said.\n\nThe other major sites, including the Chowkiya Mai Dham in Jaunpur, are reporting 70,000 daily visitors, and the numbers are expected to hit 1 lakh on the peak days.\n\nThe various temples in Agra district are collectively expecting more than 30 lakh pilgrims during Navratri, the statement said.\n\nEven the smaller temples in Auraiya and Hapur districts are witnessing increased pilgrim footfall, it said.\n\nThe Uttar Pradesh government has designated the Navratri as a celebration of women's safety and empowerment.\n\nUnder 'Mission Shakti 5.0', female police personnel organised Scooty rallies across the state, while girl students were symbolically placed in administrative roles for a day.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/40-lakh-devotees-visit-flock-to-up-temples-in-first-4-days-of-navratri-101758885944081.html",
  "scraped_timestamp": "2025-09-26T17:22:32.669486",
  "content_length": 4037,
  "word_count": 636,
  "source_domain": "www.hindustantimes.com"
}