{
  "title": "50% quota limit to face challenge as Telangana likely to move SC against HC stay on OBC reservation in local bodies",
  "content": "The Congress-led Telangana government is likely to move the Supreme Court against the high court's interim stay on a government order (GO) that provides 42 per cent reservation to the Backward Classes in local bodies.\n\nOn October 9, the HCissued an interim stayon providing the 42 per cent reservation to Backward Classes in local bodies. Hours later, the Telangana State Election Commission suspended the poll notification issued on September 29 for rural local body elections and other activities. The suspension will remain in place until further notice.\n\nThe Revanth Reddy government is firm on ensuring 42 per cent quota for BCs, and the administration will approach the apex court for implementing the GO, news agency PTI reported, citing Congress sources.\n\nThe Telangana government reportedly issued an order on September 26 to provide 42 per cent reservation to BCs in local bodies, a move that was made by the Congress administration to fulfil an election promise.\n\nBefore the 2023 assembly elections, the Congress had promised to provide 42 per cent reservation to the Backward Classes.\n\nA Telangana High Court's division bench of Chief Justice Aparesh Kumar Singh and Justice GM Mohiuddin stayed the government's order on 42 per cent reservation to Backward Classes, saying that it breached the 50 per cent upper ceiling set by the Supreme Court.\n\nThe HC said that any quota increase for OBCs should be within the framework of the \"triple test\". The Supreme Court's triple test is a framework for providing reservations for OBCs in local body elections and requires states to form a commission to collect data, specify the reservation proportion based on the commission's findings, and ensure that the total reservation for SCs, STs, and OBCs does not exceed 50 per cent of the total seats.\n\nWhile staying the Telangana government's order, the High Court said the state Election Commission would notify the proportionate seats as open category and proceed with the polls.\n\nThe court also allowed the state government four weeks' time to file a counter affidavit, after which the petitioners will be given two weeks to file a reply if so advised.\n\nFollowing the HC order, Chief Minister Revanth Reddy on Friday discussed the next steps in the process with his cabinet colleagues, AICC incharge of party affairs in Telangana, Meenakshi Natarajan, and Congress leader and senior advocate Abhishek Manu Singhvi.\n\nThe GO's basis is two Bills that were passed by the state legislature earlier this year. These Bills were aimed at enhancing BCs' reservation to 42 per cent in education, employment and local bodies.\n\nThe Bills were forwarded to the Government and are currently awaiting the President's assent.\n\nOn August 6,Revanth Reddyled a protest at New Delhi's Jantar Mantar, demanding the Presidential assent for the BC reservation Bills and alleging that the BJP-led Centre was delaying them as it was \"anti-OBC\".",
  "url": "https://www.hindustantimes.com/india-news/50-quota-limit-to-face-challenge-as-telangana-likely-to-move-sc-against-hc-stay-on-obc-reservation-in-local-bodies-101760177139789.html",
  "scraped_timestamp": "2025-10-11T23:53:54.061626",
  "content_length": 2924,
  "word_count": 470,
  "source_domain": "www.hindustantimes.com"
}