{
  "title": "8.5 lakh deaths among children under 5 linked to cyclones in 34 countries during 2000-20: Study",
  "content": "New Delhi, A new study has estimated around 8.5 lakh deaths between 2000 and 2020 among children aged under five linked with an exposure to tropical cyclones across 34 low- and middle-income countries.\n\nAs the planet continues to warm, extreme weather events such as cyclones are expected to intensify and become more common, with poorer, tropical countries projected to experience the worst effects.\n\nResearchers in China's Fudan University found significant links between deaths among under-fives and being exposed to a cyclone in the three months prior, with symptoms of diarrhoea contributing to mortality.\n\nThe analysis, published in the journal PLOS Medicine, revealed a \"significant positive association between cyclone exposure within the past three months before disease and diarrhoea symptoms in children under five years old in \".\n\n\"Specifically, the strongest effects were observed in the first month before death, diminishing in the second and third months before death,\" the team wrote.\n\n\"We observed increased under-five mortality risks associated with exposure to tropical cyclones in the month before death, estimating roughly 850,000 cyclone-related child deaths over two decades in the ,\" they said.\n\nThe researchers analysed 358 cyclones, including typhoons and hurricanes during 2000-2020, affecting 18 of the 34 countries, primarily in the coastal area of south Asia , in southeast Asia , east Africa and Latin America.\n\nData gathered via the Demographic and Health Surveys programme run by the US-based company ICF International was analysed.\n\nThe team looked at the survival of the child's siblings at the same age to see if a death at this age was unusual, and thus, more likely linked to the cyclone. Nearly 1,00,800 children under five who had died and 2,47,445 surviving siblings across 34 low- and middle-income countries were analysed.\n\nThe study \"demonstrates the substantial under-five mortality risk from cyclones, emphasising the importance of targeted strategies to enhance community resilience against the growing threat of on children.\"\n\nThe authors called for improving access to water sources and sanitation facilities.\n\nThe DHS programme conducts nationally representative surveys in low- and middle-income countries every five years, looking at maternal and child health, among other aspects.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/world-news/us-news/85-lakh-deaths-among-children-under-5-linked-to-cyclones-in-34-countries-during-2000-20-study-101758886496584.html",
  "scraped_timestamp": "2025-09-26T17:12:21.154547",
  "content_length": 2427,
  "word_count": 364,
  "source_domain": "www.hindustantimes.com"
}