{
  "title": "‘A disturbing pattern’: Medical student's rape in West Bengal's Durgapur sparks political slugfest",
  "content": "A medical student fromOdisha was allegedly rapedby unidentified men in West Bengal’s Paschim Bardhaman district, police reported on Saturday. The incident occurred outside a private medical college campus in Durgapur on Friday night, when the second-year student had gone out for dinner with a friend, according to her family.\n\nShe is currently receiving treatment at a nearby hospital.\n\nThis led to a political slugfest between the ruling TMC and the BJP on social media.\n\nAlso Read |Bengal horror: Out for dinner near college, medical student raped by group of men | What happened in Durgapur\n\nOdisha Chief Minister Mohan Charan Majhi of the BJP expressed deep concern over the incident and reached out to West Bengal CM Mamata Banerjee.\n\nMajhi posted on X: “The unfortunate incident of gang rape involving an Odia student in Durgapur, West Bengal, is highly condemnable and painful. I am deeply shocked upon hearing this news. In this sensitive matter, I strongly urge the Honorable Chief Minister of West Bengal, @MamataOfficial, to take exemplary action against the accused as per the law”.\n\nThe Odisha chief minister also wished for her speedy recovery.\n\n“Additionally, I have instructed senior officials to contact the West Bengal government and take necessary steps. All possible assistance will be provided to the victim's family on behalf of the Odisha government,” Majhi said.\n\nWest Bengal's chief opposition BJP launched an attack on the Mamata Banerjee-led government, calling it a repeated law and order failure in the state.\n\n\"It seems that every day Mamata’s regime sees the horrific rape of a female student,\" wrote BJP's West Bengal handle on X. It shared a name too, but the police have not yet confirmed the identity of the accused, who remain at large.\n\nBJP IT cell chief Amit Malviya also took to X on the issue.\n\n\"This repeated failure of law and order exposes a disturbing pattern under Mamata Banerjee’s administration. The West Bengal Police must ensure a transparent and impartial investigation, unlike the RG Kar MCH case, which the Kolkata Police mishandled under instructions, so that the guilty face the harshest punishment under the law,\" Malviya wrote on X. He also used a name for the accused, though there's no confirmation from the police yet.\n\n\"West Bengal is not safe for women. Until the TMC government is held accountable, women across the state will continue to live in fear. Mamata Banerjee must go in 2026,\" he added.\n\nWest Bengal Minister and Trinamool leader Shashi Panja spoke out on the matter and said that the BJP should not politicize the sensitive matter.\n\n“Is there any place for politics here? And if anyone makes political statements, ask them what they have to say about the crimes committed against the girls in Odisha,” Panja said.\n\n\"Those who remain silent when something happens in Manipur, what were they doing with the gold medal-winning girls when they protested at Jantar Mantar? Tell the BJP to shut down its shop in Bengal. The police have started an investigation into the matter,\" Panja added.\n\nSamajwadi Party MP Dimple Yadav also commented on the crime.\n\n“An unfortunate incident has occurred. What happened in West Bengal isn't just in West Bengal; such incidents against women are constantly increasing. If you look at the statistics for Uttar Pradesh, heinous crimes against women have more than doubled in the last 10 years,” Yadav told ANI.\n\n“The government is responsible for this, as it doesn't take any steps to guide society. The Uttar Pradesh government should work to ensure women's safety. While the Samajwadi Party launched the 1090 helpline, where women were constantly being helped and assistance was being provided, the government has consistently tried to weaken such facilities, and in some cases, has acted in a way that has made these services less effective,” she added.",
  "url": "https://www.hindustantimes.com/india-news/a-disturbing-pattern-medical-students-rape-in-bengal-sparks-political-slugfest-101760187898151.html",
  "scraped_timestamp": "2025-10-11T23:45:49.518610",
  "content_length": 3860,
  "word_count": 630,
  "source_domain": "www.hindustantimes.com"
}