{
  "title": "‘A horrific scene’: Married couple and friend killed in tragic plane crash just after takeoff at Shellharbour Airport",
  "content": "At least three people were killed on Saturday, October 11, in an airaccidentwhen a smallplanecrashed and burst into flames just after take off from Shellharbour Airport inNew South Wales, according to a police news release. An investigation has been launched into the crash.\n\nAccording to People magazine, the crash happened around 10 AM (local time) on October 11 at Albion Park Rail, south ofSydney. Emergency services rushed to the scene after receiving reports of the accident, police said.\n\nThe victims have been identified as Andrew Connors, 55, his wife Julianne Connors, 54, and their friend Colin McLaughlin, 73, as reported by News.com.au. Andrew and Julianne, who ran a local construction company called Connors Building, are survived by their two children.\n\nThe group arrived at Shellharbour Airport around 9:30 AM (local time). The single-engine Piper Cherokee aircraft took off for Bathurst on what was expected to be a 40-minute flight. But shortly after takeoff, the plane climbed only about 30 meters before suddenly losing altitude.\n\n“The plane had taken off on the tarmac and gone about 30 meters into the air. At that point, witnesses said the aircraft dipped with its left wing coming down and it contacted the tarmac,” said Lake Illawarra Police District Inspector Wunderlich. “Unfortunately, the plane was engulfed (by fire).”\n\nFire crews from the Rural Fire Service quickly put out the blaze, but all three people on board died at the scene. “There was nothing anybody could have done for the occupants of the airplane,” said Inspector Andrew Barber of Fire and Rescue NSW, per 9 News.\n\nAlso Read:Woman causes chaos on flight, blocks aisle for daughter to deboard first: 'I’m not getting off without her'\n\nHe added that the plane “disintegrated upon impact with the ground,” and one wing came off completely.\n\nInspector Wunderlich described the aftermath as “a horrific scene,” and thanked emergency responders for their work.\n\nA crime scene was established, and the Australian Transport Safety Bureau (ATSB) has begun an investigation.\n\nInvestigators will examine the wreckage, collect flight tracking data, review pilot and aircraft records, and interview witnesses to determine what went wrong.\n\nAlso Read:Plane passengers can't occupy vacant seats for free in US? Here's the truth\n\nThree people, including married couple Andrew and Julianne Connors and their friend Colin McLaughlin, died in the crash.\n\nThe crash occurred on October 11, 2025, shortly after takeoff at Shellharbour Airport, New South Wales, Australia.\n\nThe investigation is ongoing. Authorities are reviewing wreckage, flight tracking data, and aircraft records to determine the cause.",
  "url": "https://www.hindustantimes.com/world-news/a-horrific-scene-married-couple-and-friend-killed-in-tragic-plane-crash-just-after-takeoff-at-shellharbour-airport-101760194625430.html",
  "scraped_timestamp": "2025-10-11T23:46:07.429007",
  "content_length": 2680,
  "word_count": 417,
  "source_domain": "www.hindustantimes.com"
}