{
  "title": "A melody interrupted: Death of the phenomenon, Zubeen Garg",
  "content": "Since September 19, 2025, the people of Assam, cutting across divisions of age, caste, class, gender, ethnicity, and religion, have taken to the streets in an extraordinary expression of collective grief. What the state is witnessing is not merely mourning, but a historic moment of social unity: a sea of humanity holding hands, shedding tears, and confronting a loss that transcends political, cultural, and communal boundaries.\n\nOn this occasion, Assamese media headlines are strikingly different. They are not about BJPor Congress, not about Hindus or Muslims, not about Upper or Lower Assam, not about Ahoms, Morans, Chutiyas, Boros, or Koch-Rajbongshis, not about General, ST, SC, or OBC divisions, not about rich and poor, nor even about the recurring Axomiya versus Ona-Axomiya debate. Instead, Assam speaks in one voice: it has lost its own rockstar, its heartbeat Zubeen Garg, to a tragic accidental death.Zubeen had been invited to the 4th Northeast Festival in Singapore, an event commemorating the 60th anniversary of India-Singapore diplomatic relations and the India-ASEAN Year of Tourism. From that journey, he never returned to his homeland, to the people of Northeast India for whom he had become both a voice and a symbol.In the wake of his passing, social media platforms have transformed into archives of grief flooded with photographs, videos, concert recordings, and personal tributes. Each post forms part of a larger, shared act of remembrance.\n\nOn this occasion, Assamese media headlines are strikingly different. They are not about BJPor Congress, not about Hindus or Muslims, not about Upper or Lower Assam, not about Ahoms, Morans, Chutiyas, Boros, or Koch-Rajbongshis, not about General, ST, SC, or OBC divisions, not about rich and poor, nor even about the recurring Axomiya versus Ona-Axomiya debate. Instead, Assam speaks in one voice: it has lost its own rockstar, its heartbeat Zubeen Garg, to a tragic accidental death.\n\nZubeen had been invited to the 4th Northeast Festival in Singapore, an event commemorating the 60th anniversary of India-Singapore diplomatic relations and the India-ASEAN Year of Tourism. From that journey, he never returned to his homeland, to the people of Northeast India for whom he had become both a voice and a symbol.\n\nIn the wake of his passing, social media platforms have transformed into archives of grief flooded with photographs, videos, concert recordings, and personal tributes. Each post forms part of a larger, shared act of remembrance.\n\nAn artist surpasses the limits of their craft when their creation becomes inseparable from the collective life of a people. Such was the case with Zubeen Garg, whose entry into Assam’s public sphere coincided with one of the most turbulent phases in the region’s history.\n\nBy the late 1980s, everyday life in Assam had been destabilised by insurgency and the pervasive fear of secret killings. The ethos of survival itself appeared fragile, and generations counted their days under the weight of anxiety and uncertainty. It was in this climate that a new voice emerged, circulating through radios and cassette players across villages and towns. This voice softened the atmosphere of terror, instilling sweetness in bleak nights and weary days, renewing faith in life and in resilience. That voice belonged to Zubeen.\n\nZubeen’s artistic persona extended far beyond the roles of singer, lyricist, composer, producer, director, and reciter. He became the people’s artist—an artist of the masses. His sonic repertoire drew upon the enchantment of Blues and the vibrancy of Rock, generating a new musical environment in Assam from the last decade of the twentieth century onward. His reimagining of Assamese music through the idioms of blues distinguished him, crafting an innovative aesthetic in which Western musical grammar merged with Assamese words and melodies. This synthesis produced a distinct style—a genre within Assamese music itself.\n\nThrough continuous innovation, Zubeen’s voice shaped the cadence of modern Assamese song. His body of work encompassed folk and modern songs, political anthems and devotional hymns, lullabies and protest ballads. Each generation found resonance in his music: songs that accompanied life in moments of joy and sorrow, love and separation, triumph and defeat. They echoed across spaces as diverse as highways, paddy fields, kitchens, prayer halls, Bihu stages, and Ligang festivals.\n\nA defining characteristic of his performance practice was the improvisational humming that he often inserted into songs, particularly in live performances, an unmistakable feature of his musical identity.\n\nOver the course of his lifetime, Zubeen is reported to have recorded nearly 38,000 songs. On September 17, this monumental archive of 38,000 songs was inaugurated in Guwahati, compiled by his long-time admirer Vishal Kalita. He sang in English, Hindi, Bengali, Nagpuri, Sambalpuri, and nearly forty other regional and tribal languages. His ability to master the difficult phonetics of Tibeto-Burman and Dravidian languages exemplifies his efforts to embrace and represent the cultural diversity of India. Moreover, his proficiency in more than a dozen musical instruments reinforced his reputation as a versatile artist.\n\nZubeen’s musical journey began with the album Anamika, and over time, his work became the axis around which generations constructed collective memory. A major factor in this dissemination was the circulation of VCD short films featuring his songs in rural Assam—an early form of mass cultural distribution that can be compared to the spread of today’s OTT platforms. In Assamese cinema, the combination of Diganta Bharati’s lyrics and music composition with Zubeen’s voice offered film music a new dimension, shaping the aesthetic trajectory of the industry.\n\nThe Bihu stage became emblematic of Zubeen’s politics of performance. Far from being limited to entertainment, it operated as a space of rebellion and resistance. On these stages, he invoked socialism, engaged with questions of world politics and economics, and openly critiqued both the state and the central governments of India. On occasions, he even raised slogans of militant defiance. Few artists in India’s cultural landscape have so openly challenged structures of power through their art.\n\nA time came when Zubeen became a thorn in the eye and a thorn in the flesh of the so-called Assamese upper-caste middle class. His long, unkempt hair, flamboyant, multicoloured attire, mismatched shoes, earrings, hairbands, long chains (popularly known as xikoli Zubeen), and the smell of alcohol on his breath—none of this aligned with the middle-class conception of “culture.” Instead, Zubeen was recast as a “degraded,” a dishonourable and even threatening figure.\n\nThis puritanical anxiety (Brahma Prakash, 2019) within the Assamese middle class was not unprecedented. Whenever culture assumes a new form, puritanical tension emerges within the middle class as a defensive response. In Zubeen’s case, such anxiety sharpened around his interventions on the Bihu stage, where many found his questions disruptive. When taunted for being a Brahmin who refused to wear the logun (sacred thread), he retorted: “I have no caste, I have no religion, I have no god. I am free, I am Kanchenjunga.”\n\nAlso Read:Assam bids adieu to singer Zubeen Garg, thousands throng cremation site\n\nIn 2014, at the Bihu stage in Majuli—considered the epicentre of Sattriya culture—Zubeen went further, stating that it was inappropriate for ordinary people to address the sattradhikar (authority figure of Sattra) God, because the sattradhikar was not divine. “Krishna too is not a god,” he declared, “but a human being.” Zubeen, knowingly or not, aligned himself with subaltern constituencies: labourers on the streets, shopkeepers, farmers, flood-affected villagers, orphans, college youth, and the uncles and aunts of rural households.\n\nFor these groups, Zubeen was not a distant celebrity but an ordinary man with a familiar face—an embodiment of everydayness. He was someone they could touch, stand beside and talk with, sing together with, and even tease. This capacity to collapse the distance between the stage and the street constituted Zubeen’s real strength and his deepest conviction: the belief that the people were always with him.\n\nI belong to that generation that grew up with different shades of Zubeen. My childhood, teenage days, adolescence, those quiet afternoon naps- all wrapped in the magic of his voice on the radio. He takes me back to those feelings that carry the smells of innocence, of my teenage love, of my village and husori. For people like us who are staying outside of Assam, the voice of Zubeen is like home to us, which brings comfort after spending hectic days in unknown cities.\n\nAlso read:Zubeen Garg death: Shyamkanu Mahanta defends himself and the organisation, SIT raids his residence\n\nThe sudden news of Zubeen’s death in Singapore has cast a shadow over Assam, a grief that is both personal and collective. Suspicions of political motives have begun to circulate, sharpening the sorrow into vigilance. As conflicting accounts of the accident emerge, the coordinator of the Northeast Festival, Shyamkanu Mahanta, is likely to face the scrutiny and confrontation of an entire people whose faith in Zubeen transcended the stage.\n\nYet, Zubeen can never die. till Assam celebrates Bihu, Ligang, Bwisagu, Eid; till masses come to the road to protest against power; till new sun rises on each day in the Northeast. His voice, his spirit, has become inseparable from the soul of Assam forever echoing, forever alive. He took his final rest on the lap of his evergreen song “Mayabini raatir bukut”, echoed in his funeral ceremony, instead of religious chants.\n\n(Sumpee Borah: PhD, Theatre and Performance Studies, JNU)\n\nGet 360° coverage—from daily headlinesto 100 year archives.",
  "url": "https://www.hindustantimes.com/india-news/a-melody-interrupted-death-of-the-phenomenon-zubeen-garg-101758874749999.html",
  "scraped_timestamp": "2025-09-26T16:34:37.336809",
  "content_length": 9918,
  "word_count": 1539,
  "source_domain": "www.hindustantimes.com"
}