{
  "title": "After Israeli Withdrawal, Hamas Launches Violent Crackdown on Rivals in Gaza",
  "content": "As Israeli troops pulled back last week to facilitate a deal that freed the living hostages still held in Gaza, Hamas surged security forces in behind them—a public assertion of authority intended to make clear the group remains the enclave’s governing power.\n\nThose forces immediately began cracking down on rival militias controlled by prominent Palestinian families, engaging in firefights and conducting public executions that have spread fear and raised concerns that a spiral of internecine violence could bring new painto a long-suffering population.Clashes around a hospital in Gaza City on Sunday left dozens dead, according to the Hamas unit that conducted the raid and members of the family it was fighting. Videos that emerged Monday—verified by Storyful, which like The Wall Street Journal is owned by News Corp—show Hamas fighters dragging a number of men from the family into a public square in broad daylight, forcing them to kneel and executing them in front of a crowd of onlookers.An image from a video released by the Hamas-run al-Aqsa TV's Telegram channel shows Hamas fighters in the moments before a public execution on Monday on a street in Gaza City.The violence points to the challenges ahead as talks around President Trump’s peace plan move beyond the hostage deal to the more complex task of disarming Hamas and replacing it with new administrative and security functions. The U.S.-designated terrorist group’s assertion of authority, if it persists, will be at odds with the requirements of Trump’s plan.Israel, which has provided arms to some anti-Hamas groups, is closely monitoring the fighting to see how it develops, an Israeli official said.“Hamas is re-establishing control,” said Hasan Abu Hanieh, an independent analyst based in Amman specializing in Islamist groups. “Hamas will be even more aggressive now to prove to the outside world that no one can remove them, that no force can challenge them.”Trump was asked Monday about Hamas’s deployment of security forces and ongoing crackdown while traveling on Air Force One to tout his peace plan in Israel and Egypt. He said the group had understandably asked to be allowed to secure the devastated enclave. “They’ve been open about it, and we gave them approval for a period of time,” he said.On Tuesday, Trump told reporters: “They’re going to disarm…and if they don’t disarm, we will disarm them.”Hamas’s authority had been badly eroded by the devastation brought upon Gaza after the group attacked Israel on Oct. 7, 2023. Palestinians desperate for an end to the war have beenincreasingly bold in expressing their angerwith the group, which many believe hadneedlessly prolonged the fightingto protect its own interests and avoid surrendering.Palestinians protested against Hamas in northern Gaza in March.Israel’s crackdown on aid flows and expanded military control of the enclave had cut off a key source of revenue and broken down the group’s cohesion, turning it into a collection of isolated cells that hadtrouble paying its own fighters.Prominent families and other armed groups took advantage, challenging Hamas publicly and moving to establish control in their own areas. Some of those groups, such as Abu Shabab in the Rafah area of the southern Gaza Strip, were armed by Israel in an effort to further weaken Hamas’s grip.Now Hamas is fighting back. The militant group is taking advantage of the pause in the war to shift its focus from military operations against Israel to internal security deployments aimed at re-establishing its hold on the enclave.Khaled Qaddoumi, Hamas’s envoy in Tehran, said the group has beefed up its forces under Gaza’s Interior Ministry and is deploying them to restore order, crack down on criminals and looters, and punish people it believes have collaborated with Israel.“Hamas is realizing the patriotic and national responsibilities after the war to spread the sense of peace and stability,” Qaddoumi said.Old rivalriesOne early target was the Doghmosh family in Gaza City. The two foes have a long history of friction, having clashed when Hamas took control in Gaza in 2007 from the rival Palestinian Fatah faction, which the Doghmosh family favored.In 2007, members of a Hamas police force displayed weapons allegedly seized from the Doghmosh family.On Sunday, masked Hamas fighters armed with Kalashnikovs and pistols showed up outside the Jordanian hospital in Gaza City. A number of Doghmosh family members had taken shelter there during an Israeli offensive in the area, and the Hamas fighters ordered them to leave, Doghmosh family members said.Earlier, Hamas had demanded the Doghmoshes hand over 10 family members it alleged had cooperated with Israel, said Ahmad Doghmosh, reached by the Journal while besieged in the area. The family said it couldn’t turn over its sons.At the hospital gates, an armed Hamas fighter threatened to clear the hospital by force unless the family members left immediately. When they refused, some of the gunmen raised their weapons. One pointed a weapon at a family member and threatened to bring the hospital down on top of him if he didn’t leave. Another family member shot the Hamas fighter dead.That killing sharply escalated the fighting, the Doghmosh family members said. Hamas closed off access around the hospital and besieged the neighborhood with forces that greatly outnumbered the family’s fighters. Doghmosh and other family members said Hamas torched houses and cars and fired machine guns and rocket-propelled grenades.Members of a Hamas internal security force in the Nuseirat refugee camp in central Gaza on Sunday.Doghmosh said he saw around two dozen bodies in the street, with many wounded and homes on fire.“I could hear gunfire all around, heavy clashes,” said Sobheia Doghmosh, another family member reached by the Journal during the fighting. “The area is now completely surrounded by masked gunmen carrying weapons.”On Monday, the family’s “central council” released a statement saying it had been targeted by a campaign of intimidation and violence, which it called a heinous crime and contrary to the interests of Palestinians. It tried to de-escalate the situation by acknowledging and disavowing deeds it said didn’t represent the family, including the killing of the Hamas fighter.Gaza’s Hamas-controlled Ministry of Interior said it had begun taking necessary measures to restore order following implementation of the cease-fire. It said it was cracking down on criminal gangs that exploited the chaos to loot aid and attack other Palestinians. It said it was offering an amnesty period this week for rival fighters who hadn’t committed murder to turn themselves in.Palestinian gunmen secure aid trucks after a cease-fire between Israel and Hamas in JanuaryHamas’s self-styled paramilitary Rada’a, or Deterrent, unit said it had neutralized a number of wanted people and taken control of militia positions in Gaza City. It also said it had rounded up rival militia members in the central and southern areas of the Gaza Strip.“The Rada’a force is determined to enforce order and uproot gangs and militias, and will strike with an iron fist anyone who tampers with the security of the home front,” the group said.Prepping for a crackdownHamas has long been planning for the opportunity to reassert itself. Husam Badran, a member of the Hamas political bureau, told the Journal last year that the group had begun working to create a new police force to crack down on what it said was looting and price gouging.More recently, in negotiations with Israel, Hamas argued that it was willing to give up what it called offensive weapons like rocket systems, but should be allowed to keep “defensive weapons” like assault rifles, according to Arab mediators. One of Hamas’s concerns was the need to fend off rival armed groups.Hamas has been gathering intelligence on other Palestinian armed groups and their members. A July 2025 report by the Ministry of Interior documented a number of the purported groups and their areas of operation. It concluded, for example, that a dozen small armed clans had regrouped in an area under Israeli control to work withmilitia leader Yasser Abu Shabab. The report also described a rival fighter allegedly wanted for two murders who always traveled in a white Kia Sorento and had a personality that was “very spiteful.”Some Palestinians worry Hamas will go too far, and that Gaza could face the same fate as other places where efforts by outside powers to impose new political arrangements led to insurgencies or worse.Mohammad Hadieh, a Palestinian lawyer and mediator who works to resolve intra-Palestinian conflicts, said there is growing concern about the turmoil. “They are afraid of civil war,” Hadieh said of Gazans. “This is very dangerous. It has already started.”Gaza lacks the deep ethnic and sectarian divisions that characterize much of the Middle East. The important divisions break along family lines, each with thousands of members and many involved in smuggling or other crimes. Established families make up about 30% of Gaza’s population, with the balance being people who have fled or left other areas during the fighting around the founding of Israel, said Abu Hanieh, the independent analyst. That could keep the fighting more contained.Hamas security forces have been in the streets as refugees stream back into Gaza City.Israel has deepened some of the divisions by trying during the war to recruit families as a counterweight to Hamas. Nizar Doghmosh, 56, who heads his family’s council and a former official in the Palestinian Authority, which ran Gaza until being ejected by Hamas, said he got a call last month from someone who said in Arabic he represented Israel’s military and asked him to help stabilize the family’s neighborhoods. Doghmosh said he declined.Israel’s military declined to comment. Prime Minister Benjamin Netanyahu has said Israel has supported the Abu Shabab group in southern Gaza.“It was an Israeli fantasy,” said Michael Milshtein, a former head of Palestinian affairs for Israeli military intelligence, referring to the efforts to encourage an alternative to Hamas. “Although Hamas is much weaker than two years ago, they are not going to give up and will break these groups.”No alternativeAnalysts and even Israel’s military have long argued the Palestinian Authority needs to be brought back into Gaza as the only viable alternative to Hamas. But Netanyahu has refused, calling it corrupt and inept, and he is wary of advancing the possibility of a Palestinian state, which he opposes.Ephraim Sneh, a retired Israeli brigadier general, said Hamas’s assertive behavior shows the consequences of that vacuum. “Hamas’s strategic role is to take over Palestinian society and representation,” he said. “Netanyahu doesn’t want the alternative, which is the Palestinian Authority.”Gazans say Hamas’s presence in the streets is noticeable during this cease-fire. Its police officers deter crimes such as theft and thuggery while keeping the traffic flowing. Even to the many who oppose Hamas, that is a welcome alternative to lawlessness.Displaced people returning to Gaza City passed through a checkpoint on Sunday.Many Gazans blame Israel for destroying the social fabric and political order that had underpinned stability in the enclave before the war, including killing many Hamas police officers. They also believe some of the families had been looting and hoarding scarce food supplies to profit on sales.The masked Hamas forces fighting the battles with the families spread more fear. Following its fight with the Doghmoshes, Hamas went after the Abu Samra family, sparking intense battles in the central Gaza town of Deir al-Balah.In early October, before the cease-fire, Hamas fought gunbattles with the Al Majaydeh family. Mohammad Majaydeh, 50, a spokesperson for the family and deputy mukhtar, or leader, said a half-dozen family members were killed in the fight, before a surprise Israeli airstrike left more dead.Israel has confirmed the airstrike but wouldn’t comment on whether it was intervening in the dispute.Fighters affiliated with the armed wing of Hamas in central Gaza in October.“A few days ago there was a problem, and the mukhtars and other men stepped in seriously to find a solution,” Majaydeh said of the clashes. He said he believes the roots of the conflict with Hamas are political: His family is overwhelmingly affiliated with Fatah and the Palestinian Authority.The family decided to declare its loyalty to the Hamas government and hand in its weapons. Hamas said it has met with leaders of other families to mend divisions. The steps could help de-escalate the fighting, but point to the bigger issue of Hamas’s growing dominance of Gaza.“The main problem we face and are suffering from is this: Many people can’t wait to get rid of Hamas’s rule, but on the ground they are widely spread throughout the Gaza Strip,” said Falah Masri, 64, who lives in a tent in Deir al-Balah. “Whether it will continue or be temporary until order is restored is unclear.”Write to Benoit Faucon atbenoit.faucon@wsj.com\n\nThose forces immediately began cracking down on rival militias controlled by prominent Palestinian families, engaging in firefights and conducting public executions that have spread fear and raised concerns that a spiral of internecine violence could bring new painto a long-suffering population.\n\nClashes around a hospital in Gaza City on Sunday left dozens dead, according to the Hamas unit that conducted the raid and members of the family it was fighting. Videos that emerged Monday—verified by Storyful, which like The Wall Street Journal is owned by News Corp—show Hamas fighters dragging a number of men from the family into a public square in broad daylight, forcing them to kneel and executing them in front of a crowd of onlookers.\n\nAn image from a video released by the Hamas-run al-Aqsa TV's Telegram channel shows Hamas fighters in the moments before a public execution on Monday on a street in Gaza City.\n\nThe violence points to the challenges ahead as talks around President Trump’s peace plan move beyond the hostage deal to the more complex task of disarming Hamas and replacing it with new administrative and security functions. The U.S.-designated terrorist group’s assertion of authority, if it persists, will be at odds with the requirements of Trump’s plan.\n\nIsrael, which has provided arms to some anti-Hamas groups, is closely monitoring the fighting to see how it develops, an Israeli official said.\n\n“Hamas is re-establishing control,” said Hasan Abu Hanieh, an independent analyst based in Amman specializing in Islamist groups. “Hamas will be even more aggressive now to prove to the outside world that no one can remove them, that no force can challenge them.”\n\nTrump was asked Monday about Hamas’s deployment of security forces and ongoing crackdown while traveling on Air Force One to tout his peace plan in Israel and Egypt. He said the group had understandably asked to be allowed to secure the devastated enclave. “They’ve been open about it, and we gave them approval for a period of time,” he said.\n\nOn Tuesday, Trump told reporters: “They’re going to disarm…and if they don’t disarm, we will disarm them.”\n\nHamas’s authority had been badly eroded by the devastation brought upon Gaza after the group attacked Israel on Oct. 7, 2023. Palestinians desperate for an end to the war have beenincreasingly bold in expressing their angerwith the group, which many believe hadneedlessly prolonged the fightingto protect its own interests and avoid surrendering.\n\nPalestinians protested against Hamas in northern Gaza in March.\n\nIsrael’s crackdown on aid flows and expanded military control of the enclave had cut off a key source of revenue and broken down the group’s cohesion, turning it into a collection of isolated cells that hadtrouble paying its own fighters.\n\nProminent families and other armed groups took advantage, challenging Hamas publicly and moving to establish control in their own areas. Some of those groups, such as Abu Shabab in the Rafah area of the southern Gaza Strip, were armed by Israel in an effort to further weaken Hamas’s grip.\n\nNow Hamas is fighting back. The militant group is taking advantage of the pause in the war to shift its focus from military operations against Israel to internal security deployments aimed at re-establishing its hold on the enclave.\n\nKhaled Qaddoumi, Hamas’s envoy in Tehran, said the group has beefed up its forces under Gaza’s Interior Ministry and is deploying them to restore order, crack down on criminals and looters, and punish people it believes have collaborated with Israel.\n\n“Hamas is realizing the patriotic and national responsibilities after the war to spread the sense of peace and stability,” Qaddoumi said.\n\nOne early target was the Doghmosh family in Gaza City. The two foes have a long history of friction, having clashed when Hamas took control in Gaza in 2007 from the rival Palestinian Fatah faction, which the Doghmosh family favored.\n\nIn 2007, members of a Hamas police force displayed weapons allegedly seized from the Doghmosh family.\n\nOn Sunday, masked Hamas fighters armed with Kalashnikovs and pistols showed up outside the Jordanian hospital in Gaza City. A number of Doghmosh family members had taken shelter there during an Israeli offensive in the area, and the Hamas fighters ordered them to leave, Doghmosh family members said.\n\nEarlier, Hamas had demanded the Doghmoshes hand over 10 family members it alleged had cooperated with Israel, said Ahmad Doghmosh, reached by the Journal while besieged in the area. The family said it couldn’t turn over its sons.\n\nAt the hospital gates, an armed Hamas fighter threatened to clear the hospital by force unless the family members left immediately. When they refused, some of the gunmen raised their weapons. One pointed a weapon at a family member and threatened to bring the hospital down on top of him if he didn’t leave. Another family member shot the Hamas fighter dead.\n\nThat killing sharply escalated the fighting, the Doghmosh family members said. Hamas closed off access around the hospital and besieged the neighborhood with forces that greatly outnumbered the family’s fighters. Doghmosh and other family members said Hamas torched houses and cars and fired machine guns and rocket-propelled grenades.\n\nMembers of a Hamas internal security force in the Nuseirat refugee camp in central Gaza on Sunday.\n\nDoghmosh said he saw around two dozen bodies in the street, with many wounded and homes on fire.\n\n“I could hear gunfire all around, heavy clashes,” said Sobheia Doghmosh, another family member reached by the Journal during the fighting. “The area is now completely surrounded by masked gunmen carrying weapons.”\n\nOn Monday, the family’s “central council” released a statement saying it had been targeted by a campaign of intimidation and violence, which it called a heinous crime and contrary to the interests of Palestinians. It tried to de-escalate the situation by acknowledging and disavowing deeds it said didn’t represent the family, including the killing of the Hamas fighter.\n\nGaza’s Hamas-controlled Ministry of Interior said it had begun taking necessary measures to restore order following implementation of the cease-fire. It said it was cracking down on criminal gangs that exploited the chaos to loot aid and attack other Palestinians. It said it was offering an amnesty period this week for rival fighters who hadn’t committed murder to turn themselves in.\n\nPalestinian gunmen secure aid trucks after a cease-fire between Israel and Hamas in January\n\nHamas’s self-styled paramilitary Rada’a, or Deterrent, unit said it had neutralized a number of wanted people and taken control of militia positions in Gaza City. It also said it had rounded up rival militia members in the central and southern areas of the Gaza Strip.\n\n“The Rada’a force is determined to enforce order and uproot gangs and militias, and will strike with an iron fist anyone who tampers with the security of the home front,” the group said.\n\nHamas has long been planning for the opportunity to reassert itself. Husam Badran, a member of the Hamas political bureau, told the Journal last year that the group had begun working to create a new police force to crack down on what it said was looting and price gouging.\n\nMore recently, in negotiations with Israel, Hamas argued that it was willing to give up what it called offensive weapons like rocket systems, but should be allowed to keep “defensive weapons” like assault rifles, according to Arab mediators. One of Hamas’s concerns was the need to fend off rival armed groups.\n\nHamas has been gathering intelligence on other Palestinian armed groups and their members. A July 2025 report by the Ministry of Interior documented a number of the purported groups and their areas of operation. It concluded, for example, that a dozen small armed clans had regrouped in an area under Israeli control to work withmilitia leader Yasser Abu Shabab. The report also described a rival fighter allegedly wanted for two murders who always traveled in a white Kia Sorento and had a personality that was “very spiteful.”\n\nSome Palestinians worry Hamas will go too far, and that Gaza could face the same fate as other places where efforts by outside powers to impose new political arrangements led to insurgencies or worse.\n\nMohammad Hadieh, a Palestinian lawyer and mediator who works to resolve intra-Palestinian conflicts, said there is growing concern about the turmoil. “They are afraid of civil war,” Hadieh said of Gazans. “This is very dangerous. It has already started.”\n\nGaza lacks the deep ethnic and sectarian divisions that characterize much of the Middle East. The important divisions break along family lines, each with thousands of members and many involved in smuggling or other crimes. Established families make up about 30% of Gaza’s population, with the balance being people who have fled or left other areas during the fighting around the founding of Israel, said Abu Hanieh, the independent analyst. That could keep the fighting more contained.\n\nHamas security forces have been in the streets as refugees stream back into Gaza City.\n\nIsrael has deepened some of the divisions by trying during the war to recruit families as a counterweight to Hamas. Nizar Doghmosh, 56, who heads his family’s council and a former official in the Palestinian Authority, which ran Gaza until being ejected by Hamas, said he got a call last month from someone who said in Arabic he represented Israel’s military and asked him to help stabilize the family’s neighborhoods. Doghmosh said he declined.\n\nIsrael’s military declined to comment. Prime Minister Benjamin Netanyahu has said Israel has supported the Abu Shabab group in southern Gaza.\n\n“It was an Israeli fantasy,” said Michael Milshtein, a former head of Palestinian affairs for Israeli military intelligence, referring to the efforts to encourage an alternative to Hamas. “Although Hamas is much weaker than two years ago, they are not going to give up and will break these groups.”\n\nAnalysts and even Israel’s military have long argued the Palestinian Authority needs to be brought back into Gaza as the only viable alternative to Hamas. But Netanyahu has refused, calling it corrupt and inept, and he is wary of advancing the possibility of a Palestinian state, which he opposes.\n\nEphraim Sneh, a retired Israeli brigadier general, said Hamas’s assertive behavior shows the consequences of that vacuum. “Hamas’s strategic role is to take over Palestinian society and representation,” he said. “Netanyahu doesn’t want the alternative, which is the Palestinian Authority.”\n\nGazans say Hamas’s presence in the streets is noticeable during this cease-fire. Its police officers deter crimes such as theft and thuggery while keeping the traffic flowing. Even to the many who oppose Hamas, that is a welcome alternative to lawlessness.\n\nDisplaced people returning to Gaza City passed through a checkpoint on Sunday.\n\nMany Gazans blame Israel for destroying the social fabric and political order that had underpinned stability in the enclave before the war, including killing many Hamas police officers. They also believe some of the families had been looting and hoarding scarce food supplies to profit on sales.\n\nThe masked Hamas forces fighting the battles with the families spread more fear. Following its fight with the Doghmoshes, Hamas went after the Abu Samra family, sparking intense battles in the central Gaza town of Deir al-Balah.\n\nIn early October, before the cease-fire, Hamas fought gunbattles with the Al Majaydeh family. Mohammad Majaydeh, 50, a spokesperson for the family and deputy mukhtar, or leader, said a half-dozen family members were killed in the fight, before a surprise Israeli airstrike left more dead.\n\nIsrael has confirmed the airstrike but wouldn’t comment on whether it was intervening in the dispute.\n\nFighters affiliated with the armed wing of Hamas in central Gaza in October.\n\n“A few days ago there was a problem, and the mukhtars and other men stepped in seriously to find a solution,” Majaydeh said of the clashes. He said he believes the roots of the conflict with Hamas are political: His family is overwhelmingly affiliated with Fatah and the Palestinian Authority.\n\nThe family decided to declare its loyalty to the Hamas government and hand in its weapons. Hamas said it has met with leaders of other families to mend divisions. The steps could help de-escalate the fighting, but point to the bigger issue of Hamas’s growing dominance of Gaza.\n\n“The main problem we face and are suffering from is this: Many people can’t wait to get rid of Hamas’s rule, but on the ground they are widely spread throughout the Gaza Strip,” said Falah Masri, 64, who lives in a tent in Deir al-Balah. “Whether it will continue or be temporary until order is restored is unclear.”\n\nGet 360° coverage—from daily headlinesto 100 year archives.",
  "url": "https://www.hindustantimes.com/world-news/after-israeli-withdrawal-hamas-launches-violent-crackdown-on-rivals-in-gaza-101760504548186.html",
  "scraped_timestamp": "2025-10-15T10:54:40.354235",
  "content_length": 26039,
  "word_count": 4167,
  "source_domain": "www.hindustantimes.com"
}