{
  "title": "Agriculture",
  "content": "India is reconsidering its long-standing ban on genetically modified food crops. This shift could open doors for agricultural trade with the United States. A Supreme Court ruling on GM rapeseed is anticipated. Proponents believe this technology can boost farm productivity and reduce import reliance. Opposition from farmer groups remains a significant factor.\n\nIndia's sugar exports reached an estimated 7.75 lakh tonnes in the marketing season ending September. Trade body AISTA urged the government to announce an early export quota for the new season, having requested permission for the 2025-26 marketing year by November 2025.\n\nPrime Minister Narendra Modi has launched two major welfare schemes for farmers. These initiatives, worth over ₹35,000 crore, aim to boost agriculture in 100 districts and increase India's self-reliance in pulse production. The schemes focus on empowering farmers, promoting innovation, and ensuring food security. They integrate 36 government programs to achieve these goals.\n\nIndia aims to boost mariculture production to 25 lakh tonnes by 2047 to meet rising seafood demand, as current marine capture fisheries face climate change and resource depletion. CMFRI Director Grinson George highlighted the potential of technologies like cage culture and seaweed farming to enhance productivity and livelihoods, urging for a national policy to foster growth and investment.\n\nThe Indian Tea Association is calling for government intervention to stabilize tea prices. They propose production controls and export support. The association also wants regulated tea imports with minimum prices. This comes as the tea sector faces significant financial strain. Over 80% of organized tea estates reported cash losses last year.\n\nIndia aims for self-sufficiency in pulses by 2030-31. A new six-year mission will boost production by 40 percent. The government plans to increase cultivation area and crop productivity. Focus will be on key pulses like tur, urad, and masur. Assured procurement will support farmers. High-yielding seeds will be promoted to meet domestic demand.\n\nHeavy rainfall and floods in September destroyed crops across 68.69 lakh hectares in Maharashtra, severely impacting Marathwada and adjoining regions. The government is preparing a proposal to seek financial assistance from the Centre for affected farmers, with Chief Minister Devendra Fadnavis reviewing the plan.\n\nAn Indian feed industry delegation explored US maize, sorghum, and dairy practices in Iowa and Texas. Aiming to assess import feasibility amid trade talks, they met with officials and industry leaders. Discussions highlighted potential collaborations and the quality of US feed ingredients, noting negligible aflatoxins in DDGS and tannin-free sorghum.\n\nIndia's poultry industry is prioritising domestic consumption over exports, citing high production costs and a vast untapped local market. Officials question exporting when local demand offers better value, given expensive feed and low per capita consumption. Significant infrastructure improvements are crucial for India to compete internationally.\n\nUnion Home and Cooperation Minister Amit Shah announced that 15 cooperative sugar mills will receive NCDC funding to establish compressed biogas and potash production plants. Speaking at the inauguration of a pioneering unit, he emphasized these projects mark a new chapter for India's cooperative sector, promoting self-reliance and a circular economy.\n\nUnion Minister Amit Shah stated that India's sugar cooperatives significantly benefited under PM Modi, crediting ethanol blending for improved balance sheets. Addressing a farmers' rally, he urged cooperatives to produce multi-feed ethanol and assured Central assistance for rain-affected Maharashtra farmers, praising state leaders for their efforts.\n\nUnion Agriculture Minister Shivraj Singh Chouhan visited Bihar for the Makhana Festival, advocating for increased production and reduced costs. He also expressed confidence in the NDA forming the next government in Bihar. This follows Prime Minister Modi's recent launch of the National Makhana Board, aimed at boosting Bihar's significant makhana production and global presence.\n\nThe Centre raised wheat MSP by 6.6% to ₹2,585/quintal for 2026-27, ahead of rabi sowing, and set a production target of 119 mt. It also approved a ₹11,400 crore six-year mission to boost pulses output by expanding cultivation, distributing seed kits, and promoting high-yield, climate-resilient varieties.\n\nThe government announced a 6.59 per cent increase in the Minimum Support Price (MSP) for wheat to Rs 2,585 per quintal for the 2026-27 marketing year. MSPs for five other rabi crops were also hiked, aiming to ensure remunerative prices for farmers and incentivise crop diversification, aligning with the 1.5 times cost of production policy.\n\nIndia has increased its new-season wheat purchase price by 6.6% to 2,585 rupees per 100 kg for 2026. This move aims to encourage farmers to expand acreage and boost supplies, as growers were shifting to more profitable rapeseed. The hike ensures continued interest in wheat cultivation for the world's second-biggest producer.\n\nThe Union Cabinet, chaired by Prime Minister Narendra Modi on Wednesday, approved a six-year, Rs 11,000 crore plan to boost domestic pulse production. The initiative aims to increase output, reduce import dependence, and strengthen food security. In a related move, the Cabinet also approved a proposal to raise the Minimum Support Price (MSP) for Rabi crops.",
  "url": "https://economictimes.indiatimes.com/news/economy/agriculture",
  "scraped_timestamp": "2025-10-14T15:36:10.436787",
  "content_length": 5545,
  "word_count": 808,
  "source_domain": "economictimes.indiatimes.com"
}