{
  "title": "Agriculture",
  "content": "Prices of essential commodities like onions and pulses have plummeted to multi-year lows due to increased imports and reduced exports. A surge in pulse imports, coupled with bumper crops in countries like Australia and Brazil, has suppressed domestic prices. Government intervention through buffer stock releases and excess rainfall impacting crop quality are further contributing to the price decline.\n\nDmitry Patrushev leads a large Russian delegation to India for the World Food India expo. The focus is on agriculture joint ventures, including fertilizers. This partnership aims to strengthen ties beyond buyer-seller relations. Discussions include boosting Indian shrimp exports to Russia, especially with US tariffs impacting exports. Increased fertilizer exports from Russia to India have already been observed.\n\nThe Supreme Court has asked the Central government for a response. This concerns a Public Interest Litigation about restricting yellow pea imports. The plea argues these imports harm pulse farmers' livelihoods. Kisan Mahapanchayat filed the PIL. Advocate Prashant Bhushan represents the farmers. The court wants to ensure consumers don't suffer from potential shortages.\n\nNitin Gadkari highlighted the need to support farmers facing unfair prices due to global market influences, emphasizing that a significant portion of India's population relies on agriculture with a disproportionately low GDP contribution.\n\nThe government on Wednesday mandated that exports of non-basmati rice will be allowed only after registration with the Agricultural and Processed Food Products Export Development Authority (APEDA). The Directorate General of Foreign Trade (DGFT) said the export policy has been amended to include this condition. India’s rice exports rose 6.4% to USD 4.7 billion in April-August FY26.\n\nNitin Gadkari emphasized increasing agriculture's GDP contribution to 26% for India's self-reliance, addressing the Crop Care Federation. He urged reducing production costs through electric tractors and affordable bio-pesticides, advocating for domestic raw material production to ensure agro-chemical quality. Gadkari highlighted agriculture's importance, aiming to boost farmers' income and curb rural migration by making the sector economically viable.\n\nIndia's food supply chain is quietly transforming as frozen produce emerges to combat farm waste and price volatility, driven by urban demand for year-round availability. Despite being a small share of the retail market, frozen food sales are rapidly growing, accelerated by the pandemic.\n\nUnion Minister Nitin Gadkari emphasized the necessity of government support for farmers, who struggle with globally determined prices for their produce, leading to poverty and unemployment in rural India. He highlighted the potential of bio-ethanol production from corn, which has significantly increased farmers' income.\n\nA recent US tariff hike on Indian goods has significantly impacted Odisha's seafood industry, affecting 62 processing entrepreneurs and 25,000 prawn farmers. The additional tariffs, including penalties for purchasing Russian crude oil, have disrupted exports, with 24.5% of Odisha's marine products destined for the US.\n\nThe Food Ministry and FCI have signed an agreement for fiscal year 2025-26, focusing on improving foodgrain management and subsidy optimization. This involves minimizing storage losses, enhancing quality control, and adopting IT innovations. The MoU includes measurable targets and capacity-building for FCI employees, supporting the distribution of foodgrains to over 80 crore people under the National Food Security Act.\n\nAgriculture Minister Shivraj Singh Chouhan has approved the procurement of Kharif pulses and oilseeds from Uttar Pradesh and Gujarat. The central government will procure urad, tur, moong, sesame, and groundnut in Uttar Pradesh. In Gujarat, urad, moong, soyabean, and groundnut will be procured. The approved quantities may be revised later. Farmers will receive timely payments through a digital system.\n\nIndia's kharif foodgrain production is set to exceed the government's goal. This is due to increased cultivation and favorable monsoon rains. Agriculture Commissioner P K Singh shared this optimistic outlook. While oilseed and pulse coverage is down, productivity is expected to rise. Crop damage from floods was minimal. The government will launch \"Vikhist Krishi Abhiyan\" to support farmers soon.\n\nThe International Maize and Wheat Improvement Center (CIMMYT) is focusing on gene editing to develop wheat varieties resistant to drought, floods, and diseases. Director General Bram Govaerts called it a “future” technology, noting traditional GM wheat has had limited commercial success. Gene editing accelerates breeding without introducing foreign genes.\n\nThe Parliamentary Standing Committee on Commerce is concerned about the surge in cheap tea imports from Kenya and Nepal. They've urged the Tea Board to enforce mandatory labeling and source declaration to protect India-origin tea's reputation. The committee also suggests reviewing the Indo-Nepal trade agreement and implementing strict measures to safeguard Darjeeling tea's GI tag from adulteration.\n\nWith US funding declining, CIMMYT urges India and Mexico to lead in securing global food supplies. Director General Bram Govaerts emphasizes CIMMYT's role in India's Green Revolution, warning that critical crop disease surveillance could collapse without increased investment. He calls for new financing models and collaborative efforts, urging India to transition from beneficiary to leader in regional food security.\n\nIndia's rice reserves have surged to a record high, exceeding targets significantly, while wheat inventories also reached a four-year peak due to increased procurement. The abundant rice stocks are poised to bolster exports, and the government can now manage wheat prices effectively through open market sales, especially during the upcoming festival season.",
  "url": "https://economictimes.indiatimes.com/news/economy/agriculture",
  "scraped_timestamp": "2025-09-26T15:49:00.825955",
  "content_length": 5978,
  "word_count": 843,
  "source_domain": "economictimes.indiatimes.com"
}