{
  "title": "Akhilesh Yadav’s Facebook account briefly suspended, govt denies role",
  "content": "Samajwadi Party (SP) president Akhilesh Yadav’s official Facebook account, which was suspended Friday evening, was restored on Saturday morning. The government swiftly denied any role in the suspension, but according to a person familiar with matter, the post that led to the action was allegedly a “violent sexual” post in nature.\n\nYadav has around 8.5 million followers on the platform owned by Mark Zuckerberg-led Meta. The incident sparked a political back and forth between the SP and the ruling Bharatiya Janata Party (BJP) even as Meta maintained that the account was restored after the issue was reviewed.\n\n“We restored the page once the issue was brought to our notice,” said Meta Spokesperson.\n\nUnion IT minister Ashwini Vaishnaw while interacting with the press at an event said, “Action has been taken by Facebook. The government has nothing to do with this. His account had an abusive post due to which Facebook took down his profile as per their policies.”\n\nAs the government distanced itself from suspension, SP leaders and representatives claimed that Yadav’s account was suspended as part of an undeclared emergency imposed by the BJP, calling it an attack on democracy.\n\n“The suspension of the Facebook account of the respected national president of the country’s third largest party, Shri Akhilesh Yadav ji, is an attack on democracy. The BJP government has imposed an undeclared emergency in the country, where it wants to suppress every voice raised in opposition. However, the Samajwadi Party will continue to oppose the anti-people policies of the BJP,” SP spokesperson Fakhrul Hasan Chaand wrote on X.\n\nMeanwhile, SP Lok Sabha MP from Ghosi, Rajeev Rai wrote on X that blocking Yadav’s account “is not only condemnable but also a blow to India’s democratic system. If this has been done at the behest of the ruling party, it is a sign of cowardice. Trying to suppress the voice of socialists is a mistake.”\n\nWith the account now restored, questions remain over the nature of the flagged post and the reasons behind Facebook’s temporary suspension.",
  "url": "https://www.hindustantimes.com/india-news/akhilesh-yadav-s-facebook-account-briefly-suspended-govt-denies-role-101760189615966.html",
  "scraped_timestamp": "2025-10-11T23:53:44.545992",
  "content_length": 2071,
  "word_count": 337,
  "source_domain": "www.hindustantimes.com"
}