{
  "title": "Alaska floods: Several airlifted as officials race against time after Typhoon Halong wreaks havoc",
  "content": "Officials inAlaskarushed on Tuesday to evacuate and find housing for people from tiny coastal villages devastated by the remnants of TyphoonHalong. But the remote location and severe damage are limiting their options as they race against other impending storms and the onset of winter.\n\nHigh winds and surging waters battered low-lying, isolated Alaska Native communities along the Yukon-Kuskokwim Delta in southwest Alaska, nearly 500 miles (800 km) from Anchorage, over the weekend. The Coast Guard plucked two dozen people from their homes after the structures floated out to sea in high water, three people were missing or dead, and hundreds of people were staying in school shelters — including one with no working toilets, officials said.\n\nThe system followed a storm that struck parts of western Alaska days earlier.\n\nAcross the region, more than 1,500 people were displaced. Dozens had been flown to a shelter set up in the National Guard armory in the regional hub city of Bethel, a community of 6,000 people, and officials are considering flying evacuees to longer-term shelter or emergency housing in Fairbanks and Anchorage as they run out of room there.\n\nFuel storage depots intended to support communities in the region had apparently been damaged, threatening pollution that could harm the fish and game the Alaska Native residents rely on for subsistence. Some people in the area may have lost freezers full of food such as salmon and moose intended to get them through the winter.\n\nThe hardest-hit communities included Kipnuk, population 715, and Kwigillingok, population 380. They are off the state's main road system and reachable this time of year only by water or by air.\n\n“It’s catastrophic in Kipnuk. Let’s not paint any other picture,” Mark Roberts, incident commander with the state emergency management division, told a news conference Tuesday. “We are doing everything we can to continue to support that community, but it is as bad as you can think.”\n\nAmong those awaiting evacuation to Bethel on Tuesday was Brea Paul, of Kipnuk, who said in a text message that she had seen about 20 homes floating away through the moonlight on Saturday night.\n\n\"Some houses would blink their phone lights at us like they were asking for help but we couldn’t even do anything,” she wrote.\n\nThe following morning, she recorded video of a house submerged nearly to its roofline as it floated past her home.\n\nPaul and her neighbors had a long meeting in the local schoolhouse gym on Monday night, singing songs of praises as they tried to figure out what to do next, she said. Neither she nor most everyone else knows where they will end up.\n\n“It’s so heartbreaking saying goodbye to our community members not knowing when we’d get to see each other,” she said.\n\nOne woman was found dead in Kwigillingok, and authorities on Monday night called off the search for two men after their home floated away.\n\nIn Kwigillingok, the school was the only facility with full power, but it had no working toilet, and 400 people stayed there Monday night. Workers were trying to fix the bathrooms; a situation report from the state emergency operations center on Tuesday noted that “honey buckets are being used.”\n\nA preliminary assessment showed every home in the village was damaged by the storm, with about three dozen having drifted from their foundations, the emergency management office said.\n\nPower systems flooded in Napakiak, and severe erosion was reported in Toksook Bay. In Nightmute, officials said, fuel drums were reported floating in the community, and there was a scent of fuel in the air and a sheen on the water.\n\nOfficials activated members of the National Guard to help with the emergency response, and crews were trying to take advantage of any breaks in the weather to fly in food, water, generators and communication equipment.\n\nOfficials warned of a long road to recovery and a need for continued support for the hardest-hit communities. Most rebuilding supplies would have to be transported in, and there is little time left with winter just around the corner.\n\n“Indigenous communities in Alaska are resilient,\" said Rick Thoman, an Alaska climate specialist at the University of Alaska Fairbanks. “But, you know, when you have an entire community where effectively every house is damaged and many of them will be uninhabitable with winter knocking at the door now, there’s only there’s only so much that any individual or any small community can do.”\n\nThoman said the storm was likely fueled by the warm surface waters of the Pacific Ocean, which has been heating up because of human-caused climate change and making storms more intense.\n\nThe remnants of another storm, Typhoon Merbok, caused damage across a massive swath of western Alaska three years ago.",
  "url": "https://www.hindustantimes.com/world-news/us-news/alaska-floods-several-airlifted-as-officials-race-against-time-after-typhoon-halong-wreaks-havoc-101760503469768.html",
  "scraped_timestamp": "2025-10-15T11:12:55.662461",
  "content_length": 4779,
  "word_count": 789,
  "source_domain": "www.hindustantimes.com"
}