{
  "title": "Allegations of rape on pretext of marriage against Himachal administrative officer: HC seeks status report",
  "content": "Shimla/Una , The Himachal Pradesh High Court on Thursday sought a status report from the police in a case of rape on the pretext of marriage registered against a Himachal Pradesh Administrative Services officer posted in Una.\n\nAn FIR was filed against the officer after the woman lodged a complaint alleging that he forced her into having physical relations with him after proposing marriage, police had said on Wednesday.\n\nOn the woman's complaint, a case of sexual intercourse on a false promise to marry and criminal intimidation under sections 69 and 351 of BNS was registered.\n\nThe court has sought a status report from the police as they could only produce a copy of the FIR before the court when the matter of anticipatory bail filed by the advocate of the officer posted as sub-divisional magistrate Una came up.\n\nThe officer had moved the high court seeking anticipatory bail which was listed on Thursday and the advocate of the accused informed that the officer is ready to join the investigation and fully cooperate.\n\nMeanwhile, taking cognizance of the case, the state women's commission directed the Superintendent of Police of Una to conduct an impartial investigation in the case.\n\nThe SP has assured that the officer would not be spared, the commission's chairperson Vidya Devi said.\n\nIn her complaint to the police, the woman alleged that she interacted with the officer on social media and he invited her to his office several times.\n\nA month and a half ago, when the woman arrived at his office, he allegedly took her to his personal room and proposed marriage to her. When she resisted his physical overtures, he forcibly had physical relations with her, she alleged.\n\nTen days later, the officer booked a room in a rest house in someone else's name, where he again tried to get intimate with her, she alleged.\n\nWhen the woman threatened to complain, the officer began blackmailing her with a video he made in the office and gradually reduced his communication with her, the complainant alleged.\n\nThe forensic and police teams also visited the rest house. The accused officer is untraceable, police said.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/allegations-of-rape-on-pretext-of-marriage-against-himachal-administrative-officer-hc-seeks-status-report-101758813472557.html",
  "scraped_timestamp": "2025-09-26T00:56:16.149780",
  "content_length": 2218,
  "word_count": 370,
  "source_domain": "www.hindustantimes.com"
}