{
  "title": "Alwar man arrested for allegedly spying for Pakistan, passed sensitive information",
  "content": "Police have arrested a man from Alwar district of Rajasthan on charges of spying for Pakistan's intelligence agency ISI.\n\nThe accused, Mangat Singh, was produced before a special court in Jaipur on Saturday and remanded in police custody for three days, officials said. He was arrested on Friday.\n\nSingh, a resident of Govindgarh in Alwar, had been in contact with a female Pakistani \"handler\" for the past two years and was allegedly passing sensitive information related to Indian military movements through social media, according to officials.\n\nAlso read:‘Honeytrapped’ Thane man arrested for sharing sensitive information with Pakistan: Report\n\n\"He was in contact with the handler. He had saved the handler's numbers under the names such as 'Isha Sharma' and 'Isha Boss'. He shared several photos and videos linked to Army and BSF movements, particularly from Alwar Cantonment and Ambala Cantonment areas,\" a public prosecutor said.\n\nAccording to the investigation findings, Singh allegedly received over₹10,000 in multiple transactions fromPakistan in exchange for the information. His mobile phone contained records of sensitive exchanges, including coded messages hinting at troop movements before Operation Sindoor.\n\nSingh, who worked in a factory inAlwar, was known locally as a 'Siddh Purush' and often participated in religious events. This allowed him to build rapport with defence personnel and civilians alike, the officials said.\n\nAlso read:YouTuber Wasim Akram arrested for ‘spying’ for ISI, Pak high commission in Haryana\n\n\"He used religious gatherings to gain people's trust. During this time, he came in contact with several Army and BSF personnel,\" the public prosecutor said, adding that agencies are now preparing to question individuals who may have interacted with the accused.\n\nHe was detained by the intelligence unit of the Rajasthan Police and after interrogation by intelligence agencies, he was placed under arrest on Friday under the Official Secrets Act.",
  "url": "https://www.hindustantimes.com/india-news/alwar-man-arrested-for-allegedly-spying-for-pakistan-passed-sensitive-information-101760177083841.html",
  "scraped_timestamp": "2025-10-11T23:53:28.248232",
  "content_length": 1987,
  "word_count": 300,
  "source_domain": "www.hindustantimes.com"
}