{
  "title": "Alwar man held for spying for Pakistan’s ISI; sixth espionage arrest in Rajasthan",
  "content": "Jaipur:The Rajasthan Police’s intelligence unit on Saturday night arrested a man from Alwar for allegedly spying for Pakistan’s Inter-Services Intelligence (ISI) for two years, marking the sixth such arrest linked to espionage in the state.\n\n“The accused, Mangat Singh, has been arrested under the Official Secrets Act, 1923. He was also produced before the court on Sunday morning and was taken into custody on a three-day remand. The action was taken after we traced his suspicious movements at the Alwar Army cantonment area,” a statement issued by the intelligence unit said.\n\nSingh, a resident of Alwar’s Govindgarh, was allegedly in touch with Pakistani handlers through social media platforms. “Since Operation Sindoor, he was also honey-trapped by a woman Pak handler who had been working under a pseudonym Isha Sharma. This woman also lured him with money in exchange for sharing sensitive information about the crucial cantonment area of Alwar city and other strategic locations in the country through social media,” an intelligence officer said.\n\nBased on some internal tip-offs, Singh came under the radar of the Rajasthan police. “We are also examining his mobile phones to check what information he has passed to the Pak handlers,” the officer added.\n\nAccording to the officers, the Alwar cantonment area is one of the most highly strategic and sensitive areas after Operation Sindoor and is therefore always under the special monitoring of the intelligence unit.\n\nMeanwhile, five others were arrested since March for alleged espionage activities in the bordering Jaisalmer district.\n\nOn September 25, the intelligence unit arrested Hanif Khan from Jaisalmer’s Mohangarh. During interrogation, he admitted to having knowledge of key military establishments and troop movements. It is informed that even during Operation Sindoor, Khan remained in touch with his Pakistani handlers and passed on details of Army mobilisation.\n\nOn August 20, the agency arrested Jeevan Khan (25), who worked at a restaurant in Jaisalmer and was found in contact with multiple Pakistani phone numbers saved on his device.\n\nOn August 4, Mahendra Prasad, manager of a DRDO guest house in Jaisalmer, was caught passing sensitive defence information to Pakistani handlers.\n\nOn May 28, Shakur Khan, a government employee and former aide to ex-Congress minister Saleh Mohammad, was detained for spying for Pakistan and formally arrested on June 3.\n\nOn May 23, Delhi Police Special Cell detained Mohammad Kasim (32) of Gangoura village in Deeg’s Pahadi area. He had reportedly travelled to Pakistan on a tourist visa in August 2024.\n\nOn March 26, days ahead of the Pahalgam terror attack, Rajasthan Intelligence arrested Pathan Khan from Karamon ki Dhani near Chandhan Field Firing Range under the Official Secrets Act..",
  "url": "https://www.hindustantimes.com/india-news/alwar-man-held-for-spying-for-pakistan-s-isi-sixth-espionage-arrest-in-rajasthan-101760189316829.html",
  "scraped_timestamp": "2025-10-11T23:53:45.860349",
  "content_length": 2806,
  "word_count": 437,
  "source_domain": "www.hindustantimes.com"
}