{
  "title": "American journalist says she faced ‘extreme brutality’ and rape threats by Israeli guards",
  "content": "Journalist Noa Avishag Schnall accused Israeli guards of “extreme brutality” to her and other prisoners on Monday. It included beatings and “threats of rape,” after they were taken by Israeli forces from international waters while aboard the Conscience Freedom Flotilla.\n\nSchnall is a Los Angeles-born photojournalist covering the flotilla for Drop Site News, recounting the “extreme brutality” she said she endured during her captivity.\n\nShe was part of the Global Sumud Flotilla, a mission aiming to deliver aid to war-ravaged Gaza.\n\nOther activists had also statedthat they had been handcuffed, beaten, denied water and medicine, and held in prison under brutal conditions.\n\n“Our boat, the Conscience, was attacked in international waters around 5 a.m. Wednesday morning,” Schnall said, as she appeared with a black eye and bruises.\n\n“We were taken through multiple levels of administration and the first of many strip searches. At least one woman has reported being physically penetrated by guards who laughed at her pain. Many flotilla members reported watching their valuables being looted by guards during bag searches,” she said.\n\n“All of us had our hands violently shoved towards the ground and arms held in stress positions behind us, many with zip-ties, and were led through processing and sorted into groups of men and women, then blindfolded. Several of the 150 total flotilla members, including me, were targeted for extreme brutality throughout imprisonment,” added the journalist.\n\nSchnall accused Israeli prison guards of beating her and other members of the flotilla and of blocking her airways.\n\n“Any flotilla member who upset the Israeli guards was subjected to twisted and tightened handcuffs and some received beatings,” she said. “I was hung from the metal shackles on my wrists and ankles and beaten in the stomach, back, face, ear, and skull by a group of men and women guards, one of whom sat on my neck and face, blocking my airways.”\n\nShe continued, “Many comrades, understandably, do not want their identity made public when recounting this treatment. During the evening, the men were tormented by guards with attack dogs and guns. The women were threatened with pepper spray. Our cell was awoken with threats of rape.”\n\nThis report comes aftermany activists deported from Israelafter their arrest say they were treated 'like monkeys'.",
  "url": "https://www.hindustantimes.com/world-news/american-journalist-says-she-faced-extreme-brutality-and-rape-threats-by-israeli-guards-101760432835538.html",
  "scraped_timestamp": "2025-10-14T15:36:32.351620",
  "content_length": 2364,
  "word_count": 373,
  "source_domain": "www.hindustantimes.com"
}