{
  "title": "Amid tariffs, Trump says 'BRICS was attack on US dollar'; India among bloc members",
  "content": "President Donald Trump on Tuesday said that BRICS was an \"attack\" on the US dollar and said that nations are dropping out of the bloc after he threatened to impose tariffs if it continues its attempts to replace the American currency.\n\nSpeaking to reporters during a bilateral lunch with Argentine President Javier Milei, Trump was asked a question about the US dollar. The President said that anybody who wants to deal in the dollar is at a greater advantage than those who do not.\n\nTrumpsaid that there wouldn't be a world domination by the dollar if he hadn't won the 2024 presidential election.\n\nIn reference to the domination, he mentionedBRICS, that India is also part of.\"And the domination by BRICS. I told anybody who wants to be in BRICS, that's fine, but we're going to put tariffs on your nation. Everybody dropped out. They're all dropping out of BRICS,\" Trump told reporters.\n\nThe US President further said, \"BRICS was an attack on the dollar, and I said, you want to play that game, I'm going to put tariffs on all of your products coming into the US. They said, like I said, we're dropping out of BRICS...They don't even talk about it anymore.\"\n\nBRIC, with Brazil, Russia, India and China as the founding members, was established as an informal club in 2009. It became BRICS with South Africa joining the bloc in 2010.\n\nEgypt, Ethiopia, the United Arab Emirates and Iran joined the BRICS in 2023, and Indonesia became a part of the group earlier this year.\n\nThe bloc has discussed reducing its dependence on the dollar as the preferred currency for international trade, and instead creating a 'common currency' or 'BRICS currency' for trade and investment between its members.\n\nThis de-dollarisation attempt has not sat right with Trump since before he won the race to the White House last year. From the beginning, the US President was warning of imposing 100 per cent tariffs on BRICS member countries if they considered replacing the dollar as a reserve currency.\n\nBrazilian President Luiz Inacio Lula da Silva floated the idea of a BRICS currency as a means of reducing the group's vulnerability to dollar exchange rate fluctuations back in 2023, during the bloc's summit in Johannesburg.\n\nHe did not believe that nations that don't use the dollar should be forced to trade in the currency. He had told the bloc that a BRICS currency \"increases our payment options and reduces our vulnerabilities\".\n\nThis initiative, termed 'de-dollarisation', came as the dollar strengthened sharply in 2022 due to the Federal Reserve's move to increase interest rates, and Russia launched its full-scale invasion of Ukraine, making dollar debts and other imports more expensive.\n\nExperts had said that building a BRICS currency would be a \"political project\", Reuters reported.\n\nDays after his presidential inauguration in January this year, Trump repeated his threat to impose 100 per cent tariff. He demanded a commitment from BRICS that they would neither create a new BRICS currency nor back any other currency to replace the US dollar.\n\nA 2024 study by the Atlantic Council's GeoEconomics Center showed that the US dollar remained the world's primary reserve currency, and neither the euro nor the so-called BRICS countries have been able to reduce global reliance on the dollar.\n\nAmid his ongoing spree of tariff impositions, in July, Trump threatened to slap an additional 10 per cent levy on countries aligning themselves with what he termed as \"Anti-American policies of BRICS\". He said that there \"will be no exceptions\" to this policy.\n\nWhile he did not explain what he meant by 'Anti-American policies', his reference seemed quite obvious, considering the threat he made to BRICS earlier in January.\n\nIndia, which is a founding member of BRICS, said in December 2024 that NewDelhi 'has no interest'in weakening the US dollar.\n\nThis was a time when Trump had yet to be formally inaugurated as the President of the United States.\n\nExternal Affairs Minister S Jaishankar, while speaking at the Doha Forum, had spoken positively about India's relationship with the first Trump administration.\n\nJaishankar had clarified that while BRICS discusses financial transactions, India has no interest in weakening the US dollar, given that Washington remains India's largest trade partner.\n\n\"...We have also said that India has never been for de-dollarisation. Right now, there is no proposal to have a BRICS currency… BRICS do discuss financial transactions.. The United States is our largest trade partner, and we have no interest in weakening the dollar at all,” he had said.\n\nIn March this year, Jaishankar said that the US's foreign policy shift under Trump was \"expected\", adding that it \"suits India in many ways\" as the Republican administration's actions are moving the world order towards multipolarity.\n\nHe again reiterated that India has no policy to replace the US dollar as the international reserve currency. “As I said, at the end of the day, the dollar as the reserve currency is the source of international economic stability, and right now, what we want in the world is more economic stability, not less,” he said.\n\nThe EAM said that the BRICS member countries lack a unified position on replacing the US dollar globally.\n\n“We do believe today that working with the United States and strengthening the international financial system and economic system is actually what should be the priority... I think that both the strategic assessment and our sense of what is required today by the international economy will really guide our thinking on this matter,” Jaishankar said.",
  "url": "https://www.hindustantimes.com/world-news/amid-tariffs-trump-says-brics-was-attack-on-us-dollar-india-among-bloc-members-101760496426428.html",
  "scraped_timestamp": "2025-10-15T09:43:05.174796",
  "content_length": 5595,
  "word_count": 919,
  "source_domain": "www.hindustantimes.com"
}