{
  "title": "Amit Shah announces NSG hub in Ayodhya: What is the ‘Black Cat’ commando-led force?",
  "content": "Union home ministerAmit Shahon Tuesday announced that the government will set up another hub of the anti-terror ‘Black Cat’ commado-led force National Security Guard (NSG) in Uttar Pradesh’sAyodhya. Amit Shah was addressing a gathering at the 41st Raising Day of the National Security Guard in Haryana’s Manesar.\n\nThe NSG hub in Ayodhya would be the seventh such centre in the country after Mumbai, Chennai, Kolkata, Hyderabad, Ahmedabad, and the Jammu task force, the union minister said.\n\nHe said, “We are going to make big changes in the role of NSG. NSG' new hub is being stationed in Ayodhya. With this, all six such hubs of NSG will help in mitigating any terror attack”.\n\nThe NSG is a federal contingency force that works under the Union home ministry. The idea to set up the NSG was announced in 1984. A bill to form this organisation was presented in parliament in August 1986, and it got the president’s approval on September 22, 1986. The National Security Guard officially came into existence from that day.\n\nIts 'Black Cat' commandos handle counter-terror and counter-hijack missions, along with the protection of high-risk VIPs.\n\nCommandos are mainly taken on deputation from the Indian Army and other Central Armed Police Forces. Those selected go through tough training and are given specialised gear to serve as NSG Commandos.\n\nThe union minister also said at the event that India’sOperation Sindoorled to the “destruction of Pakistani terror headquarters, their training centres and launchpads”.\n\nUnder Operation Sindoor, the Indian defence forces struck terror bases and defence sites in Pakistan and Pakistan-occupied Kashmir (PoK) in May in response to the Pahalgam terror attack on April 22 that claimed 26 lives.\n\n“NSG commandos will be deployed 24 hours a day, 365 days a year. A zone will be designated for them around that centre, and the Special Composite Group will be available to respond to any sudden terrorist attack on that zone,” Shah said on Tuesday.\n\nAt the event, Shah also praised the 'Black Cat' commandos, saying that the NSG has fought a formidable fight against organised crime and terrorism in the country for four decades. He also said that the Special Operation Training Centre (SOTC), which was inaugurated on Tuesday, was not only for the NSG but also to train state police forces.",
  "url": "https://www.hindustantimes.com/india-news/amit-shah-announces-national-security-guard-hub-in-ayodhya-what-is-the-black-cat-commando-led-anti-terror-force-101760431629316.html",
  "scraped_timestamp": "2025-10-14T15:50:46.803712",
  "content_length": 2328,
  "word_count": 381,
  "source_domain": "www.hindustantimes.com"
}