{
  "title": "Andhra braces for heavy rain, winds; minister orders preparedness",
  "content": "Amaravati, Andhra Pradesh Home Minister V Anitha on Friday directed officials to remain \"fully prepared\" as a deep depression over the Bay of Bengal approached the state.\n\nShe ordered the immediate setting up of control rooms, installation of warning boards, and deployment readiness of the National Disaster Response Force , State Disaster Response Force , police and fire services.\n\n“Field-level officials must be prepared to face any situation,” Anitha said in a press release, urging preventive measures in vulnerable districts prone to heavy rain and flooding.\n\nAccording to the Andhra Pradesh State Disaster Management Authority , the depression is likely to cross the south Odisha–north Andhra coasts on Saturday morning, bringing extremely heavy rainfall at isolated places.\n\n\"Moderate to heavy rain\" is forecast in Eluru, Krishna, NTR, Guntur, Bapatla, Palnadu, Prakasam, Nellore, Godavari districts, Kurnool and Nandyal, with squally coastal winds reaching up to 50 kmph.\n\nFishermen have been warned against venturing into the sea till Monday, while the public has been advised to avoid crossing overflowing canals or taking shelter under trees and unsafe structures.\n\nMeanwhile, the India Meteorological Department has forecast \"heavy rain and thunderstorms with lightning\" in parts of Andhra Pradesh until October 2.\n\nThe IMD said \"heavy to very heavy rain is likely at isolated places\" over North Coastal Andhra Pradesh and Yanam, and \"heavy rain at isolated places\" over Rayalaseema on September 26.\n\nThunderstorms with lightning are also expected over NC, SC and Rayalaseema, with winds of 40–50 kmph at isolated locations.\n\nSimilar weather conditions are likely on September 27, with winds of 30–40 kmph over Rayalaseema, continuing until September 29.\n\nFrom September 30 to October 2, isolated thunderstorms, \"lightning and heavy rain\" are expected over NC and Yanam, with strong winds persisting over coastal districts and Rayalaseema.\n\nThe IMD further said a well-marked low-pressure area over the northwest and adjoining central Bay of Bengal is likely to intensify into a depression and cross the south Odisha–north Andhra coasts around September 27 morning.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/andhra-braces-for-heavy-rain-winds-minister-orders-preparedness-101758875961056.html",
  "scraped_timestamp": "2025-09-26T16:15:10.767585",
  "content_length": 2273,
  "word_count": 342,
  "source_domain": "www.hindustantimes.com"
}