{
  "title": "Another Haryana cop found dead in Rohtak days after IPS alleged suicide",
  "content": "A Haryana policeman was found dead on Tuesday, days after another cop also took his own life and accused in his “final note” several senior officers of harassment as well as caste-based discrimination.\n\nAssistant sub-inspector (ASI) Sandeep Kumar's body was found in a room built near an agricultural field in Rohtak's Ladhot village on Tuesday.\n\nThe ASI was reportedly posted in the cyber cell and earlier was at the at SP office as well.\n\nSpeaking on the matter, SP Rohtak Surendra Singh Bhoria said, “This was a hardworking ASI of our Police Department, Sandeep. He was very honest and hardworking. His body has been found. A Forensic team has been called here and an investigation is being carried out...He was posted in Cyber Cell.”\n\nThis comes amid ongoing probe over Y Puran Kumar, a 2001-batch IPS officer, who allegedly died by suicide on October 7. In his “final note”, Kumar accused several senior officers, including Kapur and Bijarniya, of harassment and caste-based discrimination, which he claimed contributed to his emotional distress.\n\nThe Haryana government had on Saturday shunted out Rohtak SP Bijarniya, one of the cops against whom IPS officer Y Puran Kumar’s wife, IAS officer Amneet P Kumar, was seeking action for allegedly abetting his suicide.\n\nThe Chandigarh Police’s FIR was based on a ‘final note’ by the deceased police officer. Police have added charges under the SC/ST Act based on an appeal from the officer’s wife.\n\nIf you need support or know someone who does, please reach out to your nearest mental health specialist. Helplines: Aasra: 022 2754 6669; Sneha India Foundation: +914424640050 and Sanjivini: 011-24311918, Roshni Foundation (Secunderabad) Contact Nos: 040-66202001, 040-66202000, ONE LIFE: Contact No: 78930 78930, SEVA: Contact No: 09441778290",
  "url": "https://www.hindustantimes.com/india-news/another-haryana-cop-asi-sandeep-kumar-found-dead-rohtak-ips-y-puran-kumar-alleged-suicide-101760435254692.html",
  "scraped_timestamp": "2025-10-14T15:58:45.347817",
  "content_length": 1794,
  "word_count": 285,
  "source_domain": "www.hindustantimes.com"
}