{
  "title": "Army porter missing for 20 days rescued from Arunachal's Upper Siang",
  "content": "Itanagar, An army porter who went missing for 20 days in Upper Siang district of Arunachal Pradesh was rescued after an extensive multi-agency search and rescue operation, police said.\n\nThe rescued porter, Unnot Taye, a resident of Akshipur village in Dhemaji district of Assam, went missing in the Midak area, about 25 km from Panggo village in the district, on September 20, while returning from duty, the police said on Monday.\n\nTaye, along with 11 other porters from Assam, had been engaged on September 17 by a contractor for work along the Panggo–Jorging foot track in the Tengo-1 and Tengo-2 border areas. When Taye failed to return, a missing report was lodged at Tuting Police Station on September 23.\n\nFollowing the report, a rigorous search and rescue operation was launched under Tuting police station officer-in-charge Jumken Rina, with active participation from NGOs, army porters, and villagers from Panggo and Migging, guided by head gaon burahs and gram panchayat chairpersons .\n\nThe joint team combed through the dense forests, steep hills, and riverbanks of the Shirapate river from September 21 to October 9, often under harsh conditions.\n\nOn October 10, another army porter from Kugging village spotted Taye in an unconscious condition near Midak Camp.\n\nUpon receiving the information, a rescue team comprising police personnel, a medical team, and villagers, including members of the Arunachal Pradesh Women Welfare Society , immediately reached the location.\n\nTuting medical officer Dr Maktel Yompang provided on-site medical aid, stabilising the victim before he was carried on foot for nearly 25 km through rugged terrain to the nearest road point on October 11.\n\nFrom there, Taye was evacuated to District Hospital at Yingkiong, on October 12, and later shifted to Bakin Pertin General Hospital at Pasighat, in East Siang district on October 13 for further treatment.\n\nAfter medical evaluation and stabilisation, he was reunited with his family the same day.\n\nExpressing relief and gratitude, Upper Siang deputy commissioner Talo Jerang commended the dedication and teamwork of all those involved in the operation.\n\n\"The successful rescue of Unnot Taye is a result of tireless efforts, unity, and commitment shown by all teams and local volunteers,\" the deputy commissioner said.\n\nJerang extended appreciation to Upper Siang SP Token Saring, Tuting ADC Pandov Perme, SI Jumken Rina, Dr Yompang, and others for their coordinated action and humanitarian spirit.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/army-porter-missing-for-20-days-rescued-from-arunachal-s-upper-siang-101760429375376.html",
  "scraped_timestamp": "2025-10-14T15:27:54.126930",
  "content_length": 2579,
  "word_count": 403,
  "source_domain": "www.hindustantimes.com"
}