{
  "title": "Army kills 2 terrorists in J&K's Kupwara after suspicious movement; search ops on",
  "content": "Two terrorists were killed in Jammu and Kashmir's Kupwara on Monday evening, said the Indian Army. As per the official statement, Indian Army troops opened fire after noticing suspicious movement.\n\nFollowing the incident, the Indian Army added that search operations were underway acrossJammu and Kashmir.\n\n“Based on specific intelligence input by JKP & corroborated by sources and agencies, regarding likely infiltration attempt, a joint operation was launched by Indian Army and Jammu and Kashmir police in Machhal Sector,Kupwaraon 13 Oct 2025, ” read the statement issued by Indian Army officials.\n\nAlert troops spotted suspicious activity and challenged, which resulted in terrorists opening indiscriminate fire. Troops responded with effective fire, neutralising two terrorists. Large quantity of weapons and equipment recovered,\" officials added.\n\nWith the onset of winter, Union Home MinisterAmit Shahcalled on security forces to remain on high alert and ensure that terrorists do not exploit snowfall and adverse weather conditions to infiltrate across the Line of Control (LoC) and International Border.\n\nThe directive from the BJP leader came during a high-level security review meeting chaired by Shah in Delhi to assess the ground situation in the union territory.\n\nThe meeting was also attended by Jammu and Kashmir Lieutenant Governor Manoj Sinha, Union Home Secretary, Director of Intelligence Bureau, Chief of Army Staff, Chief Secretary and Director General of Police of Jammu and Kashmir, Directors General of Central Armed Police Forces (CAPFs), and other senior officials from the Government of India, the Army, and the Jammu and Kashmir administration.",
  "url": "https://www.hindustantimes.com/india-news/army-kills-2-terrorists-in-j-ks-kupwara-after-suspicious-movement-search-ops-on-101760414876140.html",
  "scraped_timestamp": "2025-10-14T14:31:43.040348",
  "content_length": 1673,
  "word_count": 248,
  "source_domain": "www.hindustantimes.com"
}