{
  "title": "As Israel’s Hostages Came Home, a Mother From Nepal Learned Her Son Would Not",
  "content": "Padma Joshi’s heart had swelled this summer when she was handed a black zip-up bag containing the belongings of her only son, Bipin, a college student from Nepal, missing since Hamas gunmen snatched him from a kibbutz during the Oct. 7, 2023, attacks. Inside the bag, Padma found a poem he had written for her days before his abduction.\n\n“Mother, your little child has grown so tall. Yet still I run to your arms when I fall,” wrote Bipin Joshi,the first member of his family to seek work outside Nepal, tending orange and lemon groves on a work-study agricultural program near Israel’s border with Gaza. “Today I chase horizons wide. But your lullabies still echo inside.”Bipin’s words had fortified Padma, a primary-school teacher from Mahendranagar, a small town in the Himalayan foothills, who had somehow found herself the face of a two-year diplomatic campaign to retrieve the sole Nepali national held in Gaza. Yet on Monday, she gathered with her family on a phone call with an Israeli military officer who conveyed news they had long feared. Twenty captives were crossing over Israel’s border to jubilant homecomings, but Bipin wasn’t among them. His status, they were warned, was “unconfirmed.”Ten hours later, the officer called back with an even grimmer update: Hamas had just released a public statement, saying that Bipin’s remains would soon be delivered to Israel.Padma listened in silence, then broke down. She hadn’t slept all night, she said in an interview: “We have been in so much pain.”It still isn’t clear how, or exactly when, he died. The Israeli military said he was “murdered in captivity,” without providing further information or their forensic analysis of the body, which on Tuesday was on its way to Nepal. Hamas didn’t respond to a request for comment.Israeli policemen saluted as vehicles carrying the bodies of four hostages passed in Tel Aviv on Monday.In a mass kidnapping of more than 250 people from 13 countries, the experience of the Joshis was singular: Their son was the only foreigner whose plight remained unclear—whether he was dead or alive—until Monday, when news of his fate broke just as Israel and the Palestinian territories erupted in celebration. The ordeal of his parents—who live near the Mahakali River that winds between India and Nepal—is a reminder of how the Hamas attacks reverberated around the world. The attacks killed around 1,200 people and sparked a war that left more than 67,000 Palestinians dead and redrew regional geopolitics.Bipin was the sole captive from Nepal, a country with so little experience in international hostage crises that weeks after his kidnapping, the then-foreign minister asked reporters for The Wall Street Journal how he could reach the Red Cross. The Joshis watched as other governments—from Thailand to the Philippines—retrieved migrant farmworkers, including some who had harvested fruit on the same kibbutz as Bipin. More powerful governments, including the U.S. and U.K., brought home citizens. Meanwhile, the Joshis fell into a grinding two-year-long quest to answer the most basic question, whose final answer was only provided on Monday: Was Bipin alive?What Padma and her husband Mahanand knew was that Bipin, who was 22 at the time of his kidnapping,acted as a hero on Oct. 7. When two grenades slid across the floor of a basement in Kibbutz Alumim, he lunged forward, picked up one and lobbed it to safety. A second grenade exploded, throwing five of his friends to the floor, gravely injured.He had gathered fellow workers in the safety of a nearby kitchen, then tried to rally the group to slip back out and rescue victims. Before they could move, though, Hamas returned with reinforcements. The gunmen barged through the kitchen doors and grabbed Bipin and three Thai farmers hiding nearby.Bipin Joshi at Kibbutz Alumim in southern Israel.His family learned only that he had made it to Gaza still alive, in shape. Their last glimpse of him came in a proof-of-life video, filmed in the first month of his abduction, his eyes locked confidently on the camera.“It’s me, Bipin Joshi. I’m from Nepal,” he said. “I’m a student. I work on an agricultural farm.”In the two years that followed, the Joshi family fought to obtain even basic data points on the whereabouts of their son: They knew his cellphone had pinged from Gaza, and that he had been treated in a local hospital.Over the course of that journey, Padma and her daughter, Pushpa, would travel thousands of miles to seek answers in Israel and the U.S. The small-town family from Nepal became, by necessity, versed in the distant Middle Eastern conflict that had claimed their son, whose college education they hoped might transform their fortunes.Along the way, their owngovernment would be toppledin mass demonstrations, and replaced with a new post-revolutionary caretaker government. For officials of the old guard, their inability to return a single young citizen kidnapped while chasing opportunities abroad he couldn’t find at home would become a sore point and symbol of an elite’s failures. Nepali officials would find themselves inundated with calls from journalists and family members asking: Where was Bipin?“People say you’re the ambassador, you cannot return even one hostage, and I am saying he is not in my pocket where I can pick and give him to you,” said Nepal’s ambassador to Israel, Dhan Prasad Pandit. “What can I do? We are not the army, we cannot take action like America did with Osama bin Laden in Pakistan, Abbottabad. We are just waiting for results.”Proud motherWhen Bipin won a place to study in Israel, Padma didn’t want him to go. But Bipin persuaded her, promising to return to Nepal to start a commercial banana or walnut plantation. “He was saying, ‘Mom, it’s only a matter of 11 months; I will see the world, learn some good skills and come back to start my own commercial farming,’” she said.He called her every day and kept a diary, sketching rap lyrics and poems in blue ballpoint pen. He rapped about the hardships of Nepali farmers in his politically conscious song—“Prashna,” meaning “Question”—over a gritty, Wu-Tang Clan-style beat.Pushpa Joshi, Bipin's sister, looking at a photo of her brother as her mother, Padma Joshi, looks on.The first Padma heard of the Hamas attacks was on the morning of Oct. 8, 2023, when a family member called to say Bipin was missing and 10 Nepali students were dead. Almost the only information Nepal’s government had to work with was a scrap of paper with a note in Hebrew—shared by an Israeli farmer at Kibbutz Alumim, where Bipin worked along with 16 other Nepali agriculture students. Six of them were alive, listed alongside their registration numbers. Only one of the Nepalis, worker number 1725, was annotated: “missing.”“All the rest are dead,” the note said.By early November of 2023, Thai authorities managed to secure proof that 19 of their nationals, photographed in captivity, were alive, accompanied by assurances from Hamas that the Thais would come home soon. Thailand, which has a small Muslim minority, had contact with Hamas via intermediaries in Iran and neighboring Malaysia.By contrast, Nepal focused its outreach on Israel and the governments mediating the conflict: Qatar, Egypt and Turkey. The Nepali government dispatched a DNA collection team to the Joshi home to check the sample against unclaimed bodies, but none matched. The family’s frustration was building. They descended on a local government office with a group of Bipin’s friends waving placards: “Wake up Nepal government” and “Save Bipin Joshi.”On Nov. 19, Israel publishedsecurity camera footagetaken from the hallways of Gaza’s Al-Shifa hospital: The footage held little more than a grainy flicker of a young man being bundled in by armed militants, but to friends and colleagues his identity seemed clear: It was Bipin.The images were captured around 11 a.m. on Oct. 7, and released only after Israel seized control of the medical center. The video showed a tall, lean man wearing a sky-blue T-shirt, dark blue shorts and distinctive striped sandals like those worn by Bipin on the day he was abducted.“Our hopes have risen,” his father, Mahanand Joshi, said in an interview that month. “But they are nothing more than hopes as of now. We yearn to see him in person.”Mahanand Joshi, Bipin’s father, in his son’s room.In the family’s four-room, single-story home, the Joshi family watched with mixed emotions as Hamas released a string of hostages. The militant group was clearly using its captives for leverage in negotiations but neither the Nepali government nor its international allies could even say whether their son was alive.Determined to keep the story in the news, the family and Bipin’s friends organized “Bring Back Bipin” marches in Mahendranagar and other towns, emulating the nightly vigils of Israeli families in Tel Aviv’s so-called Hostage Square.Global questBy August 2025, Padma was standing on Hostage Square with Pushpa, meeting other captives’ families before heading to the residence of Israeli President Isaac Herzog to discuss Bipin’s case.In the previous months, she had met with a succession of Nepali foreign ministers and prime ministers as governments collapsed and the country lurched through political turmoil. Nepal’s leaders had been raising his case with Turkey’s President Recep Tayyip Erdogan, Egyptian President Abdel Fattah Al Sisi and Qatari royalty, but the trail appeared to be cold.Pushpa Joshi standing at the microphone at a rally organized by hostage families that she and her mother, Padma, attended in Tel Aviv in August.Israeli defense officials were privately briefing reporters and some Nepali officials that they understood Bipin was likely dead, but Padma refused to believe it. “It was the hope of bringing Bipin home alive that was giving her strength,” said Kishor Chandra Joshi, Bipin’s cousin.Padma also toured the newly renovated farmland of Kibbutz Alumim, where her son had lived and worked. The Nepali embassy handed her the black bag with Bipin’s belongings and inside was a diary, containing the poem.In September, Hamas appeared to offer evidence Bipin was alive, publishing his face on a press release with 48 hostages’ photographs, captioned: “a farewell photo.” But when Israeli Prime Minister Benjamin Netanyahu read a list of 20 surviving hostages at the United Nations, on Sept. 26, Bipin’s name wasn’t among them.“We were hoping that for some international sympathy and goodwill Hamas would keep and return Bipin alive. He as a Nepali had no stake in the conflict,” said Chandra Joshi.On Friday, as a nascent peace deal promised an end to a hostage crisis that stretched for 734 days, Netanyahu’s office summoned Nepal’s ambassador to Israel for a meeting.Joshi’s name wasn’t on Hamas’ final list of hostages, but they would search Gaza’s tunnels, an adviser to the prime minister said.Padma was in North Carolina with Pushpa, staying with a relative, after meeting U.N. Secretary-General António Guterres in New York. Shortly after midnight on Monday, she received the first of two calls that would end her search.Write to Krishna Pokharel atkrishna.pokharel@wsj.com, Drew Hinshaw atdrew.hinshaw@wsj.comand Joe Parkinson atjoe.parkinson@wsj.com\n\n“Mother, your little child has grown so tall. Yet still I run to your arms when I fall,” wrote Bipin Joshi,the first member of his family to seek work outside Nepal, tending orange and lemon groves on a work-study agricultural program near Israel’s border with Gaza. “Today I chase horizons wide. But your lullabies still echo inside.”\n\nBipin’s words had fortified Padma, a primary-school teacher from Mahendranagar, a small town in the Himalayan foothills, who had somehow found herself the face of a two-year diplomatic campaign to retrieve the sole Nepali national held in Gaza. Yet on Monday, she gathered with her family on a phone call with an Israeli military officer who conveyed news they had long feared. Twenty captives were crossing over Israel’s border to jubilant homecomings, but Bipin wasn’t among them. His status, they were warned, was “unconfirmed.”\n\nTen hours later, the officer called back with an even grimmer update: Hamas had just released a public statement, saying that Bipin’s remains would soon be delivered to Israel.\n\nPadma listened in silence, then broke down. She hadn’t slept all night, she said in an interview: “We have been in so much pain.”\n\nIt still isn’t clear how, or exactly when, he died. The Israeli military said he was “murdered in captivity,” without providing further information or their forensic analysis of the body, which on Tuesday was on its way to Nepal. Hamas didn’t respond to a request for comment.\n\nIn a mass kidnapping of more than 250 people from 13 countries, the experience of the Joshis was singular: Their son was the only foreigner whose plight remained unclear—whether he was dead or alive—until Monday, when news of his fate broke just as Israel and the Palestinian territories erupted in celebration. The ordeal of his parents—who live near the Mahakali River that winds between India and Nepal—is a reminder of how the Hamas attacks reverberated around the world. The attacks killed around 1,200 people and sparked a war that left more than 67,000 Palestinians dead and redrew regional geopolitics.\n\nBipin was the sole captive from Nepal, a country with so little experience in international hostage crises that weeks after his kidnapping, the then-foreign minister asked reporters for The Wall Street Journal how he could reach the Red Cross. The Joshis watched as other governments—from Thailand to the Philippines—retrieved migrant farmworkers, including some who had harvested fruit on the same kibbutz as Bipin. More powerful governments, including the U.S. and U.K., brought home citizens. Meanwhile, the Joshis fell into a grinding two-year-long quest to answer the most basic question, whose final answer was only provided on Monday: Was Bipin alive?\n\nWhat Padma and her husband Mahanand knew was that Bipin, who was 22 at the time of his kidnapping,acted as a hero on Oct. 7. When two grenades slid across the floor of a basement in Kibbutz Alumim, he lunged forward, picked up one and lobbed it to safety. A second grenade exploded, throwing five of his friends to the floor, gravely injured.\n\nHe had gathered fellow workers in the safety of a nearby kitchen, then tried to rally the group to slip back out and rescue victims. Before they could move, though, Hamas returned with reinforcements. The gunmen barged through the kitchen doors and grabbed Bipin and three Thai farmers hiding nearby.\n\nHis family learned only that he had made it to Gaza still alive, in shape. Their last glimpse of him came in a proof-of-life video, filmed in the first month of his abduction, his eyes locked confidently on the camera.\n\n“It’s me, Bipin Joshi. I’m from Nepal,” he said. “I’m a student. I work on an agricultural farm.”\n\nIn the two years that followed, the Joshi family fought to obtain even basic data points on the whereabouts of their son: They knew his cellphone had pinged from Gaza, and that he had been treated in a local hospital.\n\nOver the course of that journey, Padma and her daughter, Pushpa, would travel thousands of miles to seek answers in Israel and the U.S. The small-town family from Nepal became, by necessity, versed in the distant Middle Eastern conflict that had claimed their son, whose college education they hoped might transform their fortunes.\n\nAlong the way, their owngovernment would be toppledin mass demonstrations, and replaced with a new post-revolutionary caretaker government. For officials of the old guard, their inability to return a single young citizen kidnapped while chasing opportunities abroad he couldn’t find at home would become a sore point and symbol of an elite’s failures. Nepali officials would find themselves inundated with calls from journalists and family members asking: Where was Bipin?\n\n“People say you’re the ambassador, you cannot return even one hostage, and I am saying he is not in my pocket where I can pick and give him to you,” said Nepal’s ambassador to Israel, Dhan Prasad Pandit. “What can I do? We are not the army, we cannot take action like America did with Osama bin Laden in Pakistan, Abbottabad. We are just waiting for results.”\n\nWhen Bipin won a place to study in Israel, Padma didn’t want him to go. But Bipin persuaded her, promising to return to Nepal to start a commercial banana or walnut plantation. “He was saying, ‘Mom, it’s only a matter of 11 months; I will see the world, learn some good skills and come back to start my own commercial farming,’” she said.\n\nHe called her every day and kept a diary, sketching rap lyrics and poems in blue ballpoint pen. He rapped about the hardships of Nepali farmers in his politically conscious song—“Prashna,” meaning “Question”—over a gritty, Wu-Tang Clan-style beat.\n\nThe first Padma heard of the Hamas attacks was on the morning of Oct. 8, 2023, when a family member called to say Bipin was missing and 10 Nepali students were dead. Almost the only information Nepal’s government had to work with was a scrap of paper with a note in Hebrew—shared by an Israeli farmer at Kibbutz Alumim, where Bipin worked along with 16 other Nepali agriculture students. Six of them were alive, listed alongside their registration numbers. Only one of the Nepalis, worker number 1725, was annotated: “missing.”\n\nBy early November of 2023, Thai authorities managed to secure proof that 19 of their nationals, photographed in captivity, were alive, accompanied by assurances from Hamas that the Thais would come home soon. Thailand, which has a small Muslim minority, had contact with Hamas via intermediaries in Iran and neighboring Malaysia.\n\nBy contrast, Nepal focused its outreach on Israel and the governments mediating the conflict: Qatar, Egypt and Turkey. The Nepali government dispatched a DNA collection team to the Joshi home to check the sample against unclaimed bodies, but none matched. The family’s frustration was building. They descended on a local government office with a group of Bipin’s friends waving placards: “Wake up Nepal government” and “Save Bipin Joshi.”\n\nOn Nov. 19, Israel publishedsecurity camera footagetaken from the hallways of Gaza’s Al-Shifa hospital: The footage held little more than a grainy flicker of a young man being bundled in by armed militants, but to friends and colleagues his identity seemed clear: It was Bipin.\n\nThe images were captured around 11 a.m. on Oct. 7, and released only after Israel seized control of the medical center. The video showed a tall, lean man wearing a sky-blue T-shirt, dark blue shorts and distinctive striped sandals like those worn by Bipin on the day he was abducted.\n\n“Our hopes have risen,” his father, Mahanand Joshi, said in an interview that month. “But they are nothing more than hopes as of now. We yearn to see him in person.”\n\nIn the family’s four-room, single-story home, the Joshi family watched with mixed emotions as Hamas released a string of hostages. The militant group was clearly using its captives for leverage in negotiations but neither the Nepali government nor its international allies could even say whether their son was alive.\n\nDetermined to keep the story in the news, the family and Bipin’s friends organized “Bring Back Bipin” marches in Mahendranagar and other towns, emulating the nightly vigils of Israeli families in Tel Aviv’s so-called Hostage Square.\n\nBy August 2025, Padma was standing on Hostage Square with Pushpa, meeting other captives’ families before heading to the residence of Israeli President Isaac Herzog to discuss Bipin’s case.\n\nIn the previous months, she had met with a succession of Nepali foreign ministers and prime ministers as governments collapsed and the country lurched through political turmoil. Nepal’s leaders had been raising his case with Turkey’s President Recep Tayyip Erdogan, Egyptian President Abdel Fattah Al Sisi and Qatari royalty, but the trail appeared to be cold.\n\nIsraeli defense officials were privately briefing reporters and some Nepali officials that they understood Bipin was likely dead, but Padma refused to believe it. “It was the hope of bringing Bipin home alive that was giving her strength,” said Kishor Chandra Joshi, Bipin’s cousin.\n\nPadma also toured the newly renovated farmland of Kibbutz Alumim, where her son had lived and worked. The Nepali embassy handed her the black bag with Bipin’s belongings and inside was a diary, containing the poem.\n\nIn September, Hamas appeared to offer evidence Bipin was alive, publishing his face on a press release with 48 hostages’ photographs, captioned: “a farewell photo.” But when Israeli Prime Minister Benjamin Netanyahu read a list of 20 surviving hostages at the United Nations, on Sept. 26, Bipin’s name wasn’t among them.\n\n“We were hoping that for some international sympathy and goodwill Hamas would keep and return Bipin alive. He as a Nepali had no stake in the conflict,” said Chandra Joshi.\n\nOn Friday, as a nascent peace deal promised an end to a hostage crisis that stretched for 734 days, Netanyahu’s office summoned Nepal’s ambassador to Israel for a meeting.\n\nJoshi’s name wasn’t on Hamas’ final list of hostages, but they would search Gaza’s tunnels, an adviser to the prime minister said.\n\nPadma was in North Carolina with Pushpa, staying with a relative, after meeting U.N. Secretary-General António Guterres in New York. Shortly after midnight on Monday, she received the first of two calls that would end her search.\n\nWrite to Krishna Pokharel atkrishna.pokharel@wsj.com, Drew Hinshaw atdrew.hinshaw@wsj.comand Joe Parkinson atjoe.parkinson@wsj.com\n\nGet 360° coverage—from daily headlinesto 100 year archives.",
  "url": "https://www.hindustantimes.com/world-news/as-israel-s-hostages-came-home-a-mother-from-nepal-learned-her-son-would-not-101760506095843.html",
  "scraped_timestamp": "2025-10-15T11:21:30.773199",
  "content_length": 21780,
  "word_count": 3527,
  "source_domain": "www.hindustantimes.com"
}