{
  "title": "At least 3 dead, 400,000 evacuated as fresh tropical storm batters Philippines",
  "content": "The Philippines evacuated hundreds of thousands of people and confirmed at least three deaths Friday as a severe tropical storm battered the country, still feeling the effects of Super Typhoon Ragasa.\n\nCivil defence officials in southern Luzon's Bicol region said three people had been killed as walls collapsed and trees were uprooted by Severe Tropical Storm Bualoi, which is sweeping west by northwest at sustained speeds of 110 kilometres per hour.\n\nEvacuees in one province took cover under pews as the roof of a church where they were sheltering was ripped by the storm.\n\n\"Around 4am, the wind destroyed the door, the windows and the ceiling of the church,\" Jerome Martinez, a municipal engineer in southern Luzon island's Masbate province, told AFP.\n\n\"Thats's one of the strongest winds I've ever experienced,\" he said, adding some children had suffered minor injuries requiring stitches.\n\n\"I think more people will have to evacuate still because many houses were destroyed and many roofs were blown away. They are now blocking the streets and roads.\"\n\nAround 400,000 people have been evacuated, Bernardo Alejandro, a civil defence official, said at a Friday press briefing.\n\n\"We are clearing many big trees and toppled electric posts because many roads are impassable,\" Frandell Anthony Abellera, a rescuer in Bicol's Masbate City, told AFP by phone.\n\nVideos shared on social media and verified by AFP showed people using boats or trudging through waist-deep water to navigate flooded streets further south in the central Philippines' Visayas islands.\n\nThePhilippinesis hit by an average of 20 storms and typhoons each year, putting millions of people in disaster-prone areas in a state of constant poverty.\n\nScientists warn that storms are becoming more powerful as the world warms due to the effects of human-driven climate change.\n\nAuthorities warned Thursday of a \"high risk of life-threatening storm surge\" of up to three meters (10 feet) with the coming storm.\n\nThousands also remain displaced in the aftermath of Super Typhoon Ragasa, which passed over the country's far northern end and killed at least nine people earlier in the week.\n\nThe storms come as public anger seethes over a scandal involving bogus flood-control projects believed to have cost taxpayers billions of dollars.",
  "url": "https://www.hindustantimes.com/world-news/at-least-3-dead-400-000-evacuated-as-fresh-tropical-storm-batters-philippines-101758868486437.html",
  "scraped_timestamp": "2025-09-26T16:51:56.213907",
  "content_length": 2299,
  "word_count": 364,
  "source_domain": "www.hindustantimes.com"
}