{
  "title": "At MiG-21's farewell, Rajnath Singh's shoutout to India-Russia ties: 'Not just an aircraft'",
  "content": "Defence minister Rajnath Singh, while bidding farewell to Russian-origin MiG-21 fighter jet on Friday in Chandigarh, hailed how it is also a proof of the deep ties shared by India and Russia.\n\n\"MiG-21 is not only an aircraft or machine but also proof of deep India-Russia ties,\" the defence minister said.\n\nSingh's remarks come amid United States' bid to pressurise India into stopping purchase of oil from Russia by imposing punishing tariffs. However, India and Russia have maintained their deep diplomatic and trade ties, refusing to be influenced by external factors.\n\nDuring the farewell ceremony, Singh recalled the role of MiG-21 fighter jets during the 1971 India-Pakistan war and how the outcome of the war was determined the day the fighter jets attacked the Governor's House in Dhaka.\n\nHe said, “Who can forget the 1971 war. During the war with Pakistan, in adverse circumstances, the MiG-21 attacked the Governor's House in Dhaka, and on that very day, it outlined the result of that war.”\n\nHe added that the MiG-21 fighter jets have upheld the honour of the Indian flag every time there has been a historic mission. “Besides this, in its long history, there have been many such occasions when the MiG-21 proved its decisive capacity. Whenever there have been historic missions, every time the MiG-21 has enhanced the honour of the tricolour,” Singh said.\n\nAlso read:From MiG-21’s cockpit: ‘It felt like being strapped to a missile’\n\n“Therefore, this farewell is also of our collective memories, of our national pride, and of that journey in which the story of courage, sacrifice, and excellence has been written.”\n\nAlso read:Watch: Iconic MiG-21 jets soar to skies for last time at grand farewell in Chandigarh\n\nThe MiG-21 fighter jets were inducted in the early 1960s and after over six decades of service, the Indian Air Force's first supersonic fighter and interceptor aircraft sailed into the sunset on Friday.\n\nAlso read:View from the cockpit: Memories of flying a MiG-21\n\nThe first MiG-21 Squadron was led by Dilbagh Singh, who became the IAF chief in 1981. The jets were dominant during India's 1965 and 1971 wars with Pakistan, and also played a pivotal role in the 1999 Kargil war and the 2019 Balakot airstrikes.\n\nDuring the farewell ceremony of the aircraft, apart from Rajnath Singh, Chief of Defence Staff General Anil Chauhan, Army Chief Gen Upendra Dwivedi, Air Chief Marshal A P Singh and Navy Chief Admiral Dinesh K Tripathi were also present.",
  "url": "https://www.hindustantimes.com/india-news/at-mig-21s-farewell-rajnath-singhs-shoutout-to-india-russia-ties-not-just-an-aircraft-101758871946648.html",
  "scraped_timestamp": "2025-09-26T15:49:33.506352",
  "content_length": 2473,
  "word_count": 408,
  "source_domain": "www.hindustantimes.com"
}