{
  "title": "At White House, Pakistan PM Shehbaz Sharif parrots Donald Trump's role in ceasefire with India",
  "content": "In his meeting with US President Donald Trump at the White House, Pakistan Prime Minister Shehbaz Sharif seemed to have echoed that Washington helped it secure a ceasefire understanding with India during Operation Sindoor.\n\nSharif and Pakistani army chief, Field Marshal Shehbaz Sharif, met Trump at the Oval Office on Thursday. The meeting took place on the sidelines of this week's UN General Assembly.\n\nIndia has consistently denied claims that Donald Trump mediated the ceasefire with Pakistan after the four-day intense fight between the two South Asian neighbours. The tiff had occurred in the aftermath of the Indian Armed Forces'Operation Sindooron terror infrastructure in response to the April 22 Pahalgam attack that killed 26 people.\n\nDespite the denial from India, the US President has repeatedly claimed that he helped the two nuclear-armed neighbours achieve a ceasefire understanding, preventing further escalation of the tensions. The most recent statement on this from Trump was heard in his speech at the UNGA this week.\n\nThe readout from the Pakistan PMO read, \"Prime Minister Muhammad Shehbaz Sharif called on President Donald J. Trump, at the White House this afternoon. He was accompanied by Field Marshal Syed Asim Munir NI (M), HJ, Chief of the Army Staff. During their warm and cordial meeting, the Prime Minister expressed his deep admiration for President Trump, describing him as a \"man of peace\" who was engaged in sincere efforts to end conflicts around the globe.\"\n\n\"He appreciated President Trump's bold, courageous and decisive leadership that had facilitated the ceasefire between Pakistan and India, thereby helping to avert a major catastrophe in South Asia,\" it added.\n\nIn their discussions about the Middle East, Sharif also \"lauded\" Trump's efforts to bring an immediate end to the war in Gaza, especially over his \"initiative to invite key leaders of the Muslim world in New York for a comprehensive exchange of views for restoration of peace in the Middle East, in particular Gaza and the West Bank\".\n\nThe Pakistani Prime Minister also thanked Trump for the tariff deal that was concluded earlier this year. While fondly recalling the longstanding partnership between the two countries, the Prime Minister expressed the confidence that under President Trump's leadership, the Pakistan-US partnership would be further strengthened to the mutual benefit of both countries. In this regard, the Prime Minister invited the US Companies to invest in Pakistan's agriculture, IT, mines and minerals and energy sectors,\" the readout added.\n\nSharif thanked the US President for his public endorsement of Pakistan's \"role in counter-terrorism and stressed the need to further enhance cooperation in security and intelligence\".\n\nThe Pakistani PM has also invited Donald Trump for an official visit to Pakistan at his convenience.\n\nIn connection with Trump's claim about the India-Pakistan ceasefire, external affairs minister S Jaishankar has several times clarified that the understanding was reached after negotiations between the directors general of military operations of the two countries and not by any trade talk factor, as claimed by the US President.\n\nJaishankar had even explained thathe was in the room whenUS Secretary of State Marco Rubio spoke to Prime Minister Narendra Modi on the night of May 9, where he'd said that Pakistan would launch a massive assault on India.\n\nIn response, PM Modi indicated that India would respond.\n\nAnd just as the conversation took place, the Pakistanis did attack \"massively\", and the Indian forces responded \"very quickly\".\n\nOn the morning of May 10, there was an engagement between him and Rubio, who told Jaishankar that the Pakistanis were ready to talk. In the afternoon that day, Pakistani DMO, Major General Kashif Abdullah, directly reached out this Indian counterpart, Lieutenant General Rajiv Ghai, asking for a ceasefire.\n\nIn July, during a debate on Operation Sindoor in the Parliament, Jaishankar stated that there was no phone call between PM Modi and Trump in the period from April 22 to June 17.\n\nDuring the debate, PM Modi also sought to shut down Trump's claim and said that nobody brokered the ceasefire understanding between India and Pakistan. “No leader in the world asked India to stop military action,” he said in Lok Sabha.",
  "url": "https://www.hindustantimes.com/world-news/at-white-house-pakistan-pm-shehbaz-sharif-parrots-donald-trumps-role-in-ceasefire-with-india-101758882852627.html",
  "scraped_timestamp": "2025-09-26T17:43:31.870844",
  "content_length": 4325,
  "word_count": 683,
  "source_domain": "www.hindustantimes.com"
}