{
  "title": "Bengal BJP's red chilli powder protest on Mamata's Durgapur gang rape remarks",
  "content": "West Bengal BJP workers on Tuesday distributed red chilli powder among women for \"self-defence\" amid \"worsening law and order\" in the state, citing the recent gang rape of a medical student in Durgapur.\n\nThe BJP campaign, which it termed 'Operation Lal Mirch' (Operation Red Chilli), unfolded near a metro station in Salt Lake, where women workers of the saffron party distributed packets containing red chilli powder to women commuters, explaining that those were meant for self-defence.\n\nA woman BJP worker said, \"We are distributing these packets to mothers and sisters so that they can ensure their own safety... the message is simple -- we have to protect ourselves, and must use red chilli powder and pepper sprays if necessary.\"\n\nThe protesters said that the CM's reported remarks asking women not to venture out late at night was an admission of the state government's failure to ensure their safety.\n\nBanerjee, however, has clarified that her comments were \"deliberately distorted\".\n\n\"In 2025, we cannot accept the idea that women should not go out late at night,\" another protester said.\n\nAn IT employee said, \"The situation is really worrying... if a woman chief minister is suggesting that women should not venture out late at night, then how will we work? My office hours extend till 10.30 pm... what should I do? The CM should arrange for work from home then.\"\n\nA 23-year-old student, hailing from Odisha, of a private medical college in Durgapur in Paschim Bardhaman district was gang-raped by some men when she went out for dinner with her friend on Friday night.\n\nThe CM, while terming the incident \"shocking\" and asserting that her government has zero-tolerance for such crimes, had said that women boarders, especially those from outside the state, must adhere to hostel rules and not venture out late at night as the police would not be able to stand guard outside every home, while also calling for the institutions to ensure safety of its students inside and around the campus.",
  "url": "https://www.hindustantimes.com/india-news/bengal-bjps-red-chilli-powder-protest-on-mamatas-durgapur-gang-rape-remarks-101760424975627.html",
  "scraped_timestamp": "2025-10-14T14:31:29.017174",
  "content_length": 1999,
  "word_count": 331,
  "source_domain": "www.hindustantimes.com"
}