{
  "title": "Benjamin Netanyahu's flight to US featured an unusual route, thanks to ICC warrant",
  "content": "Israeli Prime Minister Benjamin Netanyahu took a very unusual flight route while travelling to the US for the UN General Assembly and a meeting with President Donald Trump, in an apparent effort to avoid countries that could enforce an outstanding arrest warrant against him for alleged war crimes in Gaza.\n\nWhile Netanyahu's flight would normally fly over several European countries, flight tracker websites showed that this time, he flew the length of the Mediterranean Sea and over the Strait of Gibraltar after leaving Tel Aviv on Wednesday.\n\nAccording to FlightRadar24, Netanyahu’s flight briefly overflew Greece and Italy, but entirely avoided French and Spanish airspace, lengthening the duration of the flight. CNN reported, quoting sources, that France had greenlit Netanyahu’s flight passing through its airspace, but the Israeli PM avoided it.\n\nThis comes after manyEuropean nations used the UN General Assembly platform to announce the recognitionof a Palestinian state, which Netanyahu and his government have opposed.Slovenia on Thursday declared a ban on Netanyahu, citing ICC proceedings against him over alleged war crimes.\n\nIn July, Slovenia banned Israeli ministers, Itamar Ben Gvir and Bezalel Smotrich, accusing them of inciting \"extreme violence and serious violations of the human rights ofPalestinians\" with \"their genocidal statements\".\n\nThe Israeli PMO announced two weeks ago that some journalists and members of Benjamin Netanyahu’s entourage would not accompany him for “technical arrangements related to seating and security.” According to a report by The Jerusalem Post, the exclusion was a way of compensating for the additional fuel required for the unusual route.\n\nThe International Criminal Court (ICC) issued an arrest warrant forBenjamin Netanyahulast November for alleged war crimes and crimes against humanity that allegedly happened during the ongoing war between Israel and Hamas in Gaza.\n\nThe Israeli leader seemed to avoid nations that are members of the ICC, as he could be forced to land and be arrested. Neither the US nor Israel are a member of the organisation.\n\nDuring his last trip to the US in July, he flew over Greece, Italy, and France, according to ADS-B Exchange, another flight tracking website.",
  "url": "https://www.hindustantimes.com/world-news/benjamin-netanyahus-us-flight-featured-an-unusual-route-thanks-to-icc-warrant-101758812901474.html",
  "scraped_timestamp": "2025-09-26T00:48:15.948532",
  "content_length": 2252,
  "word_count": 344,
  "source_domain": "www.hindustantimes.com"
}