{
  "title": "Bihar election 2025: Chirag Paswan says NDA seat allocation at final stage; BJP releases list of 71",
  "content": "Union minister and Lok Janshakti Party (Ram Vilas) president Chirag Paswan on Tuesday said that the National Democratic Alliance (NDA) in Bihar has finalised its seat-sharing arrangement ahead of the upcoming assembly elections, following what he described as \"amicable discussions\" among partners.\n\nHe was speaking before the BJP announced the names for 71 seats, of the 101 it has been allotted out of the 243 in the Bihar Vidhan Sabha. While numbers were decided already, the exact seats were awaited.\n\nPaswan stated that, under the leadership of Prime Minister Narendra Modi and Bihar Chief Minister Nitish Kumar, all NDA parties are prepared and united for the upcoming election.\n\nPaswan also emphasised that discussions on which party will contest which seats are also nearing their final stage.\n\nAlso Read |Bihar assembly election 2025: BJP releases first list of candidates\n\n“The issue of seat allocation among NDA parties has been resolved through amicable discussions. The discussion on which party will contest which seat is also in its final stage with positive talks,” Chirag Paswan wrote on X.\n\n\"Under the leadership of Modi ji and Nitish ji, all NDA parties are fully prepared with unity. Bihar is ready. NDA government,\" Paswan added.\n\nAlso Read |NDA, Oppn bloc in close contest, reveals survey\n\nHis remarks come two days after the ruling National Democratic Alliance (NDA) announced its seat-sharing arrangement for the upcoming Bihar elections.\n\nNDA's two main coalition partners – the Bharatiya Janata Party (BJP) and Janata Dal (United) or JD (U) – will each contest 101 of the state’s 243 assembly seats.\n\nThe seat-sharing arrangement also allocated 29 seats to Chirag Paswan's Lok Janshakti Party (Ram Vilas) and six each to both the Rashtriya Lok Morcha (RLM) and Hindustani Awam Morcha (Secular), or HAM (S).\n\nAs reported by HT, this will be the first election since 2005—when the JD(U) joined the NDA—that the party, traditionally the dominant partner in Bihar, will not contest more seats than the BJP. To be sure, it contested the 2015 elections as part of an alliance with the RJD and Congress.\n\nPolls for the 243-seat Bihar Assembly are scheduled to take place on November 6 and November 11, and votes will be counted on November 14.",
  "url": "https://www.hindustantimes.com/india-news/bihar-election-2025-chirag-says-nda-seat-allocation-at-final-stage-bjp-releases-list-of-71-101760431406298.html",
  "scraped_timestamp": "2025-10-14T16:01:13.884604",
  "content_length": 2262,
  "word_count": 368,
  "source_domain": "www.hindustantimes.com"
}