{
  "title": "Bihar elections 2025: Dharna outside Nitish's residence, resignation by JDU leaders over ticket woes",
  "content": "Ticket woes have hit the Bihar chief ministerNitish Kumar-led Janata Dal-United with some leaders and their supporters reaching his residence in Patna on Tuesday and sitting on a dharna demanding candidature to fight the upcoming state assembly election.\n\nJD(U) MLA Gopal Mandal, who is understood to have a slim chance of getting a party ticket for the upcomingassembly elections, sat on a dharna near Nitish Kumar's residence with a group of slogan-shouting supporters.\n\nGopal Mandal is currently the MLA from Gopalpur seat in Bhagalpur district, enjoying his fourth consecutive term there.\n\nWhen security personnel stopped him from entering the premises, pointing out that he did not have an appointment, Gopal Mandal sat on the road, close to the gate.\n\n\"I will not budge till I get the party symbol from the CM, who is our party's supremo. The security personnel may charge the baton if they wish,\" PTI news agency quoted Gopal Mandal as saying.\n\nIn another development, JD(U) MP from Bhagalpur, Ajay Kumar Mandal, resigned from his position as Member of Parliament on Tuesday, alleging he was not consulted in the election ticket distribution ahead of Assembly elections.\n\nJD(U) and the Bharatiya Janata Party (BJP) have struck aseat-sharing deal, with both parties deciding to contest 101 seats each in the polls to the 243-strong assembly, a little less than they had fought five years ago.\n\nUnion minister Chirag Paswan's Lok Janshakti Party (Ram Vilas) have been given 29 seats to fight on while six each have been allotted to the Rashtriya Lok Morcha of Rajya Sabha MP Upendra Kushwaha and Hindustani Awam Morcha founded by former chief minister, and now a Union minister, Jitan Ram Manjhi.\n\nVoting for theBihar assembly election2025 will take place in two phases, on November 6 and November 11, while the counting of votes is scheduled for November 14.",
  "url": "https://www.hindustantimes.com/india-news/bihar-elections-2025-dharna-nitish-kumar-residence-cordoned-off-resignation-jdu-ajay-gopal-mandal-ticket-101760423828542.html",
  "scraped_timestamp": "2025-10-14T14:46:37.705703",
  "content_length": 1864,
  "word_count": 304,
  "source_domain": "www.hindustantimes.com"
}