{
  "title": "Bihar assembly poll: Does NDA’s seat sharing deal put Nitish Kumar's grip to test?",
  "content": "On October 12, when the National Democratic Alliance (NDA) announced its seat sharing formula for the Bihar elections, both the Bharatiya Janata Party (BJP) and the Janata Dal (United) were allotted 101 assembly constituencies (ACs) each, with 29 going to Chirag Paswan’s Lok Janshakti Party-Ramvilas (LJP-R) and six each to Jitan Ram Manjhi’s Hindustani Awam Morcha (HAM) and Upendra Kushwaha’s Rashtriya Lok Morcha (RLM).\n\nThe JD(U) and BJP contesting an equal number of ACs is a first in the fourassembly electionsthe two parties have contested together in the state. More than anything it was seen as a weakening of Nitish Kumar’s bargaining position within the NDA, though he remains the chief ministerial candidate of the NDA in the state.\n\nTo be sure, Nitish Kumar becoming the chief minister after the 2020 elections in itself was more than awkward, as the JD(U) had just 43 MLAs in the assembly compared to the BJP’s 74 despite the former contesting 115 ACs while the latter contested only 110.\n\nOne of the biggest reasons behind the JD(U)’s poor showing was the LJP putting up 113 candidates against it despite being a part of the NDA at the centre. It only put up six candidates against the BJP. There were64 ACs where the LJP polled more votes than the victory margin in 2020 and the JD(U) lost in 27 of them.\n\nThese historical facts, the seat sharing formula in the 2025 elections, more than one anecdotal account of growing dissension within the JD(U)’s rank and file, and the JD(U) not releasing any of its candidates’ names untilTuesday evening has raised serious questions about how united the JD(U) is in these elections.\n\nAt least one Lok Sabha MP from the JD(U) – Ajay Kumar Mandal from Bhagalpur – has written publicly to Kumar offering to resign because of alleged non consultation in distribution of tickets and also said that he was not being allowed to meet Kumar. Kumar has been keeping indifferent health for some time, his public appearances and media interactions have been rare and there is growing speculation that he is not as hands on as he used to be vis-à-vis not just the public campaign but also the functioning of the party.\n\nTo be sure, he continues to be the national president of the party, a position he took back from Lalan Singh in 2023 but later outsourced a large part of the responsibility to Sanjay Jha, who was appointed the working president in June 2024. The growing diatribes from within the JD(U) ranks seem to be targeted at Jha and Union minister Lalan Singh who have been the face of the coordination with the other NDA partners, especially the BJP leadership.\n\nWhile rumours of a growing dissension from within the JD(U) ranks, with some even suggesting that Kumar himself expressed his displeasure, reached a peak on Monday night, the BJP announced its first list of 71 candidates on Tuesday afternoon. JD(U) saw candidates, including its state president, Umesh Kushwaha, senior leader and minister Bijendra Yadav and mafioso-turned-politician Anant Singh, filing papers without a formal list being released even as leaders claimed that all was well in the NDA. “There is no dissension. NDA is set for a landslide victory, bigger than 2010. NDA is one,” Kushwaha said after filing his nomination.\n\n“Things are fluid at this stage in the JD-U, as some leaders are upset with the prospect of losing their seats due to swapping, as per the formula worked out in the NDA by party’s senior leaders and the BJP. The problem is that Nitish Kumar does not hold aces any more due to his health issues and the manoeuvrings by his own party leaders, who may have taken his words ‘no more flip-flop and I will always remain with the NDA’ as carte blanche,” said a senior JD-U leader, without elaborating. Between 2013 and 2024, Kumar and the JD(U) exited the NDA, returned to it, exited it again, and returned again.\n\nThe leader’s reference to a swap is about the JD(U) and the BJP trading constituencies either is representing in the current assembly.\n\nBoth Sanjay Jha and Union minister and BJP’s Bihar in-charge Dharmendra Pradhan dismissed speculation about problems within the JD(U) and reiterated that the NDA was set of a decisive victory. “I urge the people not to pay attention to rumours, as NDA is working cohesively for a big mandate and by evening seat allocation would also be clear. NDA is for Bihar’s progress under Nitish Kumar and is working under his guidance only,” Jha said on Tuesday. “The seat allocation in the NDA has been almost completed and there is nothing to worry. The opposition has already lost the battle. NDA is moving ahead with conviction and that has unnerved the opposition,” Pradhan told reporters on Tuesday.\n\nThe filing of nomination for the first phase ends on October 17 and for the second, October 20.\n\nTo be sure, NDA is not the only alliance which seems to be having problems in the state. There are growing reports of a rift between the Rashtriya Janata Dal (RJD) and Congress with the latter insisting on more seats than the former is willing to concede even as standalone candidates from different parties continue to announce their candidature. And unlike the NDA, which at least announced the seat sharing formula, the Mahagatbandhan is yet to do so.\n\nPolitical expert and former chairperson of AN Sinha Institute of Social Studies DM Diwakar said that Nitish Kumar might not be at his best due to his health and ageing, but he still remained the most trusted CM face in Bihar and the pivot around whom the state politics has revolved for two decades. “He has been a master strategist, as he remained the undisputed CM face despite changing partners at will. The fact is Nitish Kumar never allowed either the BJP or the RJD to run their agenda despite being numerically weak. BJP could never have a state leader of his stature who could be widely acceptable to the faction-ridden party. NDA is going to polls on Nitish Kumar’s face and continuing with him may turn out to be a compulsion for the BJP post-poll. However, even if it chooses to find a replacement, it will not be easy to find one,” Sinha added.",
  "url": "https://www.hindustantimes.com/india-news/bihar-assembly-election-ndas-seat-sharing-deal-puts-nitish-kumars-grip-to-test-101760499073063.html",
  "scraped_timestamp": "2025-10-15T10:54:16.379103",
  "content_length": 6106,
  "word_count": 1051,
  "source_domain": "www.hindustantimes.com"
}