{
  "title": "BJP slammed for ‘councillor’ claim after Ladakh 'Gen Z' protests, Pawan Khera says Congress to move court",
  "content": "The Congress on Friday criticised several Bharatiya Janata Party leaders, certain television anchors, and social media influencers for allegedly circulating a photograph and video of an individual falsely identifying him as Congress councillor Phuntsog Stanzin Tsepag in Ladakh.\n\nPosting on X, Congress leader and head of the party’s media and publicity wing, Pawan Khera said, \"Several leaders of the BJP and some anchors/social media influencers have been showing a picture and footage of someone, and misrepresenting him as the elected councillor of Congress - Phuntsog Stanzin Tsepag. We are proceeding with legal recourse and criminal proceedings against all those who have not just attempted to defame our party but have also tried to cause social unrest to fuel further dissensions.\"\n\nHe further said, “Instead of sensitively engaging with the betrayed people ofLadakh, the BJP and their media/social media minions are engaging in their usual mudslinging and looking for an opportunity to milk the outrage of Ladakh and settle scores with political opponents.”\n\nThis response followed BJP’s accusation that the violence in Ladakh on Wednesday, linked to the statehood demand agitation, was part of the Congress’s “nefarious design” to create situations resembling Bangladesh, Nepal and the Philippines.\n\nAt a press briefing, BJP MP and national spokesperson Sambit Patra alleged that Congress councillor Stanzin Tsepag was the chief instigator of the unrest. He added that attempts had been made to “portray” the protests as being spearheaded by Gen Z.\n\nLadakh protestsThe ruling party’s allegation came after the agitation over Ladakh’s demand for statehood and inclusion in the Sixth Schedule of the Constitution spiralled into violence, arson and street clashes in Leh, leaving four people dead and injuring at least 90, including 40 police personnel.So far, police have detained around 50 individuals in connection with the unrest, which erupted on Wednesday during a shutdown called by the Leh Apex Body (LAB) pressing for statehood and an extension of the Sixth Schedule to Ladakh.According to police, some demonstrators pelted stones at security personnel who attempted to stop their march in Leh, while others torched a paramilitary vehicle and the local Bharatiya Janata Party office.In response, police opened fire, used tear gas and resorted to baton charges, leaving dozens injured, officers and residents said. Four of those critically wounded later succumbed to their injuries, they added.On Friday, the Congress called for a judicial investigation into the killing of four young men during the Ladakh protests.The fatalities occurred when police opened fire while attempting to quell the violent demonstrations for statehood in Ladakh on Wednesday.In a post on X, Congress general secretary Jairam Ramesh said, \"My colleague Nawang Rigzin Jora has written to the Lt Governor of Ladakh UT demanding a judicial enquiry into the killings of four young men in the protests on September 24th.\"\n\nThe ruling party’s allegation came after the agitation over Ladakh’s demand for statehood and inclusion in the Sixth Schedule of the Constitution spiralled into violence, arson and street clashes in Leh, leaving four people dead and injuring at least 90, including 40 police personnel.\n\nSo far, police have detained around 50 individuals in connection with the unrest, which erupted on Wednesday during a shutdown called by the Leh Apex Body (LAB) pressing for statehood and an extension of the Sixth Schedule to Ladakh.\n\nAccording to police, some demonstrators pelted stones at security personnel who attempted to stop their march in Leh, while others torched a paramilitary vehicle and the local Bharatiya Janata Party office.\n\nIn response, police opened fire, used tear gas and resorted to baton charges, leaving dozens injured, officers and residents said. Four of those critically wounded later succumbed to their injuries, they added.\n\nOn Friday, the Congress called for a judicial investigation into the killing of four young men during the Ladakh protests.\n\nThe fatalities occurred when police opened fire while attempting to quell the violent demonstrations for statehood in Ladakh on Wednesday.\n\nIn a post on X, Congress general secretary Jairam Ramesh said, \"My colleague Nawang Rigzin Jora has written to the Lt Governor of Ladakh UT demanding a judicial enquiry into the killings of four young men in the protests on September 24th.\"",
  "url": "https://www.hindustantimes.com/india-news/congress-to-challenge-bjp-s-ladakh-rioter-allegation-in-court-pawan-khera-101758873264754.html",
  "scraped_timestamp": "2025-09-26T16:20:27.815766",
  "content_length": 4458,
  "word_count": 688,
  "source_domain": "www.hindustantimes.com"
}