{
  "title": "BJP names 71 Bihar candidates, NDA seat allocation talks continue | See list",
  "content": "The Bharatiya Janata Party on Tuesday announced its first list of candidates for the upcoming Bihar assembly election, with outgoing deputy chief ministers Samrat Choudhary and Vijay Kumar Sinha being fielded from the Tarapur and Lakhisarai assembly constituency, respectively.\n\nThe 243-seat Bihar assembly will go to polls in two phases on November 6 and 11, and the results for the election will be announced on November 14.\n\nOf the 101 seats that the BJP is contesting in the assembly polls, the first list names candidates for 71 assembly constituencies.\n\nOn Sunday, the National Democratic Alliance (NDA) finalised its seat-sharing formula for the Bihar assembly elections, with the Bharatiya Janata Party and the Janata Dal-United (JDU) contesting 101 seats each, and the Chirag Paswan-led Lok Janshakti Party (Ram Vilas) contesting 29 seats.\n\nUpendra Kushwaha's Rashtriya Lok Morcha (RLM) and Jitan Ram Manjhi's Hindustani Awam Morcha (Secular) or HAM(S) will fight on six seats each.\n\nThe final seat-sharing figures witnessed a climbdown for Nitish Kumar's JD(U) as the party contested 115 seats in the 2020 Bihar assembly election. The BJP also came down to 101 from last time's 110 seats.\n\nAnnouncing the finalisation of the seat-sharing agreement, Union minister Dharmendra Pradhan posted on X, \"The NDA allies have completed the distribution of seats in a cordial atmosphere. All workers and leaders of NDA parties warmly welcome this. Bihar is ready and a NDA government will be formed again.\"\n\nThe decision came after days of intense speculation and marathon meetings as talks of demands of Chirag Paswan's LJP(RV) and Manjhi's HAM(S) were doing the rounds.\n\nLast week, Manjhi had suggested that he would like his HAM(S) party to contest at least 15 of the 243 seats in the Bihar assembly. He had been lobbying for at least 15 seats for his party, saying that they must win at least eight seats in the polls to get the 'recognised' status from the Election Commission.\n\nThere were also talks of Chirag Paswan aiming to contest 45 to 54 seats in the election, with LJP(RV) leaders familiar with a meeting between the brass saying that the BJP was willing to give only 20-25 seats.\n\nThe opposition Mahagathbandhan, comprising the Rashtriya Janata Dal (RJD) and Congress, along with some others, has yet to announce its seat-sharing formula.\n\nIn the 2020 Bihar assembly election, the BJP had contested 110 seats, while the JD(U) had fought on 115 seats. Meanwhile, the HAM(S) fielded candidates for seven constituencies and the Vikassheel Insaan Party (VIP), then part of the NDA, contested 11 seats.\n\nThe LJP (then combined) contested 135 seats independently.\n\nThis will be the first time that the Nitish Kumar-led JD(U) is not contesting on more seats than the Bharatiya Janata Party.",
  "url": "https://www.hindustantimes.com/india-news/bihar-assembly-election-2025-bjp-releases-first-list-of-candidates-samrat-choudhary-vijay-sinha-101760432582706.html",
  "scraped_timestamp": "2025-10-14T15:53:05.523529",
  "content_length": 2797,
  "word_count": 452,
  "source_domain": "www.hindustantimes.com"
}