{
  "title": "BJP sticks to social engineering formula in Bihar",
  "content": "The Bharatiya Janata Party has adhered to its tried and tested social engineering formula in poll bound Bihar, giving representation to candidates from across castes. According to a senior party functionary, more than 60 percent of the tickets announced in the first list have been given to candidates from Dalits, backward, extremely backward communities and to women.\n\n“The party has given representation to all the communities, especially to those on the margins and known as the Dalit, Vanchit and Pichda (deprived and backward),” the functionary said.\n\nIn the first list of candidates, which includes 71 names, there are 20 OBCs, 11 from extremely backward classes, and eight women.\n\nThe BJP, which is contesting 101 seats has also fielded six candidates from the SC and ST communities. Of the 71, there are 11 Bhumihars, 7 Brahmins, 15 Rajputs, communities such as Kayasthas, and Marwaris have also been given tickets.\n\n“In the last 11 years of NDA’s rule at the centre and with Nitish Kumar at the state, there has been focussed attention on social schemes tailored for the marginalised and the poor. And along with these schemes and programmes there has also been a concerted effort to give representatives of these castes and communities political space…the list that you have today exemplifies that commitment,” said a second party functionary.\n\nThe party has also struck a balance between the old and the new, deviating from its practice of dropping between 20-30% of the sitting elected representatives.\n\n“There was a concerted effort to ensure that the party’s candidate list has a healthy mix of the experienced and the new…the first list has some fresh faces as well,” said the first functionary quoted above.\n\nAmong the new faces are Sanjay Gupta who has replaced Arun Sinha in Kumhrar; in Sitamarhi Mithilesh kumar has been replaced by Sunil Kumar Pintu, Ratnesh Khushwah has been fielded from Patna Sahib, replacing Nandkishore Yadav, in Rajnagar Sujeet Paswan has replaced Ram Rit Paswan.\n\nWhile the party has swapped the Tarapur and Teghra seats with its ally the Janata Dal United, it has largely retained the seats for which candidates have been declared.\n\nPolitical commentator, AK Jha said the BJP’s list underscores the party’s effort to strike a balance between the so-called Upper Castes and the marginalised communities.\n\n“There is a perception that the upper castes are BJP supporters, but this group of people are also the ones who also ask questions if they feel there is something lacking. This time there will be a tussle for the Upper Caste vote with the presence of a new entity, Prashant Kishore’s Jan Suraaj, and the Rastriya Janata Dal also wooing them by giving them more tickets,” Jha said.\n\nHe went on to say that social engineering which used to be the forte of RJD has now been adopted by the BJP, which has been successful in drawing support of the marginalised castes, the OBCs and the EBCs through targeted interventions.",
  "url": "https://www.hindustantimes.com/india-news/bjp-sticks-to-social-engineering-formula-in-bihar-101760502962462.html",
  "scraped_timestamp": "2025-10-15T11:03:15.149309",
  "content_length": 2967,
  "word_count": 490,
  "source_domain": "www.hindustantimes.com"
}