{
  "title": "Calcutta HC orders return of 6 Bengal residents deported to Bangladesh",
  "content": "Kolkata:The Calcutta High Court directed the centre on Friday to bring back all six members of the two West Bengal families — including a pregnant woman and two minors — who were detained in Delhi in June on suspicion of being illegal Bangladeshi immigrants and deported on the orders of the foreigners regional registration officer, lawyers who attended the hearing said.\n\n“The division bench of justices Tapabrata Chakraborty and Ritabrata Kumar Mitra gave the centre four weeks to bring back Sunali Khatun, who is in her eighth month of pregnancy, her husband Danish Sheikh, their minor son Sabir Sheikh, and another couple, Sweety Bibi and Kurban Sheikh, and their minor son Imam Dewan,” one of the lawyers who represented the families said.\n\nBoth the families are from West Bengal’s Birbhum district. During the hearings that started in July, their lawyer Raghunath Chakraborty had submitted records claiming the families possessed land in Birbhum at least 20 years before Bangladesh was born in 1971. On July 11, the bench sought a report from the Delhi government, and the hearings continued.\n\nThe court was told that the two families were detained from Delhi’s Rohini area on June 24 solely because they speak Bengali, and were pushed across the border on June 26 without informing the West Bengal government, although members of both families showed identity documents such as Aadhaar cards.\n\nAlso Read:Over 2,000 migrant workers brought back to Bengal, many still in detention camps: CM\n\nThe division bench reserved its order on Wednesday when lawyers for the Delhi Police argued that the Bangladesh government had not yet claimed that the deportees were Indian nationals. The Centre’s counsels questioned the high court’s jurisdiction in the matter, saying the deportation was ordered in Delhi and petitions against it were filed at the Delhi High Court, lawyers said.\n\nOn Friday, the division bench did not take these arguments into consideration. “We have ordered the persons to be returned to India. Four weeks’ time is being given,” the bench observed and turned down the Centre’s request for postponement of the order.\n\nAlso Read:Mamata Banerjee targets BJP as 52 Bengali migrant workers detained in Gurugram\n\nTMC Rajya Sabha member Samirul Islam, who is providing legal aid for these migrant workers, welcomed the court order. “The BJP’s information technology cell carried out a malicious campaign against me and my family. We couldn’t have won this battle without Chief Minister Mamata Banerjee’s support. This is Bengal’s victory,” Islam said.\n\nBJP state spokesperson Debjit Sarkar called the deportations “a mistake” and claimed that illegal migration from Bangladesh poses a crisis for the nation. “Sunali Khatun and the others were deported by mistake. This is an exceptional case. Illegal migration from Bangladesh poses a crisis. We cannot allow infiltrators to settle down and claim the rights of people like Khatun,” said Sarkar.",
  "url": "https://www.hindustantimes.com/india-news/calcutta-hc-orders-return-of-6-bengal-residents-deported-to-bangladesh-101758888100126.html",
  "scraped_timestamp": "2025-09-26T18:03:14.601952",
  "content_length": 2956,
  "word_count": 470,
  "source_domain": "www.hindustantimes.com"
}