{
  "title": "Can Shotguns, Spy Planes, Lasers Protect Europe From the Next Drone Incursion?",
  "content": "WYRYKI, Poland—After suspected Russian drones violated NATO airspace in recent weeks, closing airports and rattling citizens, European militaries and governments find themselves in a new era of conflict with an urgent need to bolster their defenses.\n\nAllied countries are caught between having to develop long-term solutions to address Russia’s continuing hybrid threats, and a more immediate need to help civilians prepare for the next potential wave of drones. The solutions span from multilayered air-defense systems to civilian target practice againstdrones.The North Atlantic Treaty Organization is racing to adopt new technologies that can spot drones from afar and take them out without wasting expensive weaponry. It is also weighing how to confront incursions by unmanned vehicles when the culprit, and their intentions, can’t be determined.Drones in recent weeks forced airport closures in Denmark and circled above the country’s most crucial air force base. The aircraft disappeared before authorities could intercept them, leaving Danish authorities without evidence of who sent them. In Poland, NATO warplanesshot down several Russian droneslast month.Poland and Denmark rank among Ukraine’s staunchest wartime allies and are now looking to Kyiv for support. Poland is in contact with Ukraine to discuss how to respond to drone threats, and Danish defense companies have firsthand knowledge from the war-torn country of the rapidly changing drone technology in play there.Other allies are responding, too. The German cabinet last week agreed on a draft law authorizing police to shoot down drones posing an immediate threat. Sweden on Friday announced that it would invest about $370 million in new counter-drone systems, including weapons to down unmanned aircraft, drone interceptors and jamming sensors.Two British surveillance aircraft flew a 12-hour mission on Thursday along the Russian border, supported by U.S. and NATO forces, prompted by the recent incursions.Defending Europe against drones involves several steps: detecting and identifying the unmanned vehicles, deciding whether to neutralize them, and exerting pressure away from the skies to deter enemies from launching them.DetectionThe drone incursions have prompted European officials to speed up the construction of a so-called drone wall on NATO’s eastern flank, using new technology such as acoustic detection and lasers. Those plans, combining six NATO countries, were put into motion last year but haven’t found funding from the European Union.“The drone wall was decided months ago; what we are worried about is the lack of understanding of urgency among our allies,” said Marko Mihkelson, head of Estonia’s parliamentary foreign-policy committee.Some experts say the idea of a wall gives a misguided impression of how to stop drones. For Western European countries, drone prevention also happens further from NATO’s eastern borders. Denmark said the drones that circled its airspace recently were launched from the vicinity of the country, not from afar.“A drone wall is perhaps best understood as a defense on the border with Russia, but it is just as important to have a similar defense in depth,” said Hans-Christian Mathiesen, vice president of defense programs at Sky-Watch, a Danish maker of a type of fixed-wing combat drone used in Ukraine. “As long as we have as open societies as we do, there are endless ways to bring in drones.”Since the recent drone incidents, the Danish armed forces have installed Doppler radars by at least two of the overflown sites, Copenhagen Airport and an air base in Skrydstrup that is home to most of the country’s F-16 and F-35 jet fighters. The radars, produced by Danish engineering company Weibel, are similar to ones the company installed at Charles de Gaulle Airport for the 2024 Paris Olympics.Drones over civilian areas present governments with a conundrum of how to respond. Airport disruptions, for instance, generally fall under the jurisdiction of homeland security authorities or interior ministries, but can require the protection of militaries. This potentially slows down supply of crucial defense material.“If we are to supply solutions, who do we send them to, who has the budgets, who are the decision makers?” said Peter Røpke, Weibel’s chief executive officer.Efficient drone detection relies on sifting through vast amounts of information from air and ship traffic, and responding to a drone threat within seconds rather than hours. That requires multiple types of sensors, including radars, electro-optical and infrared cameras and artificial intelligence, combined in one system, said Jesper Bøhnke, executive vice president and chief technology officer of Danish-based radar maker Terma Group.“It requires an unbelievably complex combination of systems interacting completely seamlessly,” he said.InterceptionOnce a drone is detected, the decision of whether to down it involves an assessment of risk and cost. A crashed drone can cause damage and casualties on the ground. Targeting it with missiles can quickly deplete precious arsenals if drone incursions become routine.One solution: shotguns. The Danish armed forces last month received a large order of shotguns after expediting an existing order, and rushed to train instructors from the navy, air force and army to hit drones with them.Swedish aerospace and defense giant Saab in August introduced its first-ever missile dedicated specifically to down drones. With a range of 3 miles, the Nimbrix missile has a warhead that can detonate in the air to target swarms of drones at a relatively low cost.Earlier this year, Saab also introduced a modular counter-drone system that integrates a mobile radar with a remote weapons station, which is equipped with machine guns, and electronic-warfare components.Working with the Swedish armed forces, Saab produced the system in three months, aiming for a quick, Silicon Valley-style innovation to meet the rapidly changing demands, said Petter Bedoire, Saab’s chief technology officer. “Instead of setting a very high bar,” said Bedoire, “we said, if we want it fast, what can we get?”The company hopes to fully integrate the Loke system across NATO wartime units by the end of the year.Alternative pressurePressuring Russia on other fronts could be its own deterrent. That, however, requires tangible evidence of Russian responsibility, something that isn’t always clear, given the clandestine nature of drone attacks, said Andreas Graae, head of research at the Institute for Military Technology at the Royal Danish Defence College. He cautioned that engaging Russia in hybrid warfare could escalate the conflict.“Generally, Russia has systems that offer much better protection against hybrid attacks than we do,” Graae said.Regardless, last week, the Danish government said it would intensify environmental inspections of ships at Skagen Red, one of Scandinavia’s busiest anchorages at the northern tip of Denmark. The inspections will target older ships, particularly those belonging to Russia’s clandestine network of vessels known as the shadow fleet, transporting sanctioned oil through Danish waters.“We have to put a stop to Putin’s war machine. That goes for the Russian shadow fleet as well,” said Morten Bødskov, Danish minister for industry, business and financial affairs. “We will use all tools at our disposal.”As politicians and militaries deliberate and procure equipment, citizens are rattled. On Poland’s eastern border where the first drones crossed into allied airspace, residents are working out on their own how to respond to the next threat.Ewa Jablonska organizes first-aid classes for the community.In Wyryki, where a house was destroyed recently after a jet fighter tried to down one of Russia’s low-cost Gerbera drones, Ewa Jablonska, a police-dog trainer, has seen the turnout for her first-aid classes jump. A physical-education teacher is instructing pupils in how to respond to drones, and the village mayor has started weekend skeet-shooting classes.“Anyone who is skilled at that would be able to shoot down a drone,” said Wyryki County Mayor Bernard Blaszczuk. Soldiers with battlefield experience say drones are harder to hit than birds.Formerly in the border guard service, Blaszczuk sent a letter to the Ministry of Defense offering for the armed forces to use a school as a base. He has also applied for EU funding to build bomb shelters after residents of three villages recently voted to build them using budget funds.“We all want peace, but sometimes you get attacked, and then you need to be able to defend your people,” he said.At the first-aid training session, nearly 30 residents learned to perform first aid in preparation for the next time drones showed up.One participant was Joanna Lesniewska-Gulwell, mayor of neighboring village Horostyta-Kolonia. “There is no initiative from the government, so we organize ourselves,” she said.Write to Sune Engel Rasmussen atsune.rasmussen@wsj.comand Thomas Grove atthomas.grove@wsj.com\n\nAllied countries are caught between having to develop long-term solutions to address Russia’s continuing hybrid threats, and a more immediate need to help civilians prepare for the next potential wave of drones. The solutions span from multilayered air-defense systems to civilian target practice againstdrones.\n\nThe North Atlantic Treaty Organization is racing to adopt new technologies that can spot drones from afar and take them out without wasting expensive weaponry. It is also weighing how to confront incursions by unmanned vehicles when the culprit, and their intentions, can’t be determined.\n\nDrones in recent weeks forced airport closures in Denmark and circled above the country’s most crucial air force base. The aircraft disappeared before authorities could intercept them, leaving Danish authorities without evidence of who sent them. In Poland, NATO warplanesshot down several Russian droneslast month.\n\nPoland and Denmark rank among Ukraine’s staunchest wartime allies and are now looking to Kyiv for support. Poland is in contact with Ukraine to discuss how to respond to drone threats, and Danish defense companies have firsthand knowledge from the war-torn country of the rapidly changing drone technology in play there.\n\nOther allies are responding, too. The German cabinet last week agreed on a draft law authorizing police to shoot down drones posing an immediate threat. Sweden on Friday announced that it would invest about $370 million in new counter-drone systems, including weapons to down unmanned aircraft, drone interceptors and jamming sensors.\n\nTwo British surveillance aircraft flew a 12-hour mission on Thursday along the Russian border, supported by U.S. and NATO forces, prompted by the recent incursions.\n\nDefending Europe against drones involves several steps: detecting and identifying the unmanned vehicles, deciding whether to neutralize them, and exerting pressure away from the skies to deter enemies from launching them.\n\nThe drone incursions have prompted European officials to speed up the construction of a so-called drone wall on NATO’s eastern flank, using new technology such as acoustic detection and lasers. Those plans, combining six NATO countries, were put into motion last year but haven’t found funding from the European Union.\n\n“The drone wall was decided months ago; what we are worried about is the lack of understanding of urgency among our allies,” said Marko Mihkelson, head of Estonia’s parliamentary foreign-policy committee.\n\nSome experts say the idea of a wall gives a misguided impression of how to stop drones. For Western European countries, drone prevention also happens further from NATO’s eastern borders. Denmark said the drones that circled its airspace recently were launched from the vicinity of the country, not from afar.\n\n“A drone wall is perhaps best understood as a defense on the border with Russia, but it is just as important to have a similar defense in depth,” said Hans-Christian Mathiesen, vice president of defense programs at Sky-Watch, a Danish maker of a type of fixed-wing combat drone used in Ukraine. “As long as we have as open societies as we do, there are endless ways to bring in drones.”\n\nSince the recent drone incidents, the Danish armed forces have installed Doppler radars by at least two of the overflown sites, Copenhagen Airport and an air base in Skrydstrup that is home to most of the country’s F-16 and F-35 jet fighters. The radars, produced by Danish engineering company Weibel, are similar to ones the company installed at Charles de Gaulle Airport for the 2024 Paris Olympics.\n\nDrones over civilian areas present governments with a conundrum of how to respond. Airport disruptions, for instance, generally fall under the jurisdiction of homeland security authorities or interior ministries, but can require the protection of militaries. This potentially slows down supply of crucial defense material.\n\n“If we are to supply solutions, who do we send them to, who has the budgets, who are the decision makers?” said Peter Røpke, Weibel’s chief executive officer.\n\nEfficient drone detection relies on sifting through vast amounts of information from air and ship traffic, and responding to a drone threat within seconds rather than hours. That requires multiple types of sensors, including radars, electro-optical and infrared cameras and artificial intelligence, combined in one system, said Jesper Bøhnke, executive vice president and chief technology officer of Danish-based radar maker Terma Group.\n\n“It requires an unbelievably complex combination of systems interacting completely seamlessly,” he said.\n\nOnce a drone is detected, the decision of whether to down it involves an assessment of risk and cost. A crashed drone can cause damage and casualties on the ground. Targeting it with missiles can quickly deplete precious arsenals if drone incursions become routine.\n\nOne solution: shotguns. The Danish armed forces last month received a large order of shotguns after expediting an existing order, and rushed to train instructors from the navy, air force and army to hit drones with them.\n\nSwedish aerospace and defense giant Saab in August introduced its first-ever missile dedicated specifically to down drones. With a range of 3 miles, the Nimbrix missile has a warhead that can detonate in the air to target swarms of drones at a relatively low cost.\n\nEarlier this year, Saab also introduced a modular counter-drone system that integrates a mobile radar with a remote weapons station, which is equipped with machine guns, and electronic-warfare components.\n\nWorking with the Swedish armed forces, Saab produced the system in three months, aiming for a quick, Silicon Valley-style innovation to meet the rapidly changing demands, said Petter Bedoire, Saab’s chief technology officer. “Instead of setting a very high bar,” said Bedoire, “we said, if we want it fast, what can we get?”\n\nThe company hopes to fully integrate the Loke system across NATO wartime units by the end of the year.\n\nPressuring Russia on other fronts could be its own deterrent. That, however, requires tangible evidence of Russian responsibility, something that isn’t always clear, given the clandestine nature of drone attacks, said Andreas Graae, head of research at the Institute for Military Technology at the Royal Danish Defence College. He cautioned that engaging Russia in hybrid warfare could escalate the conflict.\n\n“Generally, Russia has systems that offer much better protection against hybrid attacks than we do,” Graae said.\n\nRegardless, last week, the Danish government said it would intensify environmental inspections of ships at Skagen Red, one of Scandinavia’s busiest anchorages at the northern tip of Denmark. The inspections will target older ships, particularly those belonging to Russia’s clandestine network of vessels known as the shadow fleet, transporting sanctioned oil through Danish waters.\n\n“We have to put a stop to Putin’s war machine. That goes for the Russian shadow fleet as well,” said Morten Bødskov, Danish minister for industry, business and financial affairs. “We will use all tools at our disposal.”\n\nAs politicians and militaries deliberate and procure equipment, citizens are rattled. On Poland’s eastern border where the first drones crossed into allied airspace, residents are working out on their own how to respond to the next threat.\n\nEwa Jablonska organizes first-aid classes for the community.\n\nIn Wyryki, where a house was destroyed recently after a jet fighter tried to down one of Russia’s low-cost Gerbera drones, Ewa Jablonska, a police-dog trainer, has seen the turnout for her first-aid classes jump. A physical-education teacher is instructing pupils in how to respond to drones, and the village mayor has started weekend skeet-shooting classes.\n\n“Anyone who is skilled at that would be able to shoot down a drone,” said Wyryki County Mayor Bernard Blaszczuk. Soldiers with battlefield experience say drones are harder to hit than birds.\n\nFormerly in the border guard service, Blaszczuk sent a letter to the Ministry of Defense offering for the armed forces to use a school as a base. He has also applied for EU funding to build bomb shelters after residents of three villages recently voted to build them using budget funds.\n\n“We all want peace, but sometimes you get attacked, and then you need to be able to defend your people,” he said.\n\nAt the first-aid training session, nearly 30 residents learned to perform first aid in preparation for the next time drones showed up.\n\nOne participant was Joanna Lesniewska-Gulwell, mayor of neighboring village Horostyta-Kolonia. “There is no initiative from the government, so we organize ourselves,” she said.\n\nWrite to Sune Engel Rasmussen atsune.rasmussen@wsj.comand Thomas Grove atthomas.grove@wsj.com\n\nGet 360° coverage—from daily headlinesto 100 year archives.",
  "url": "https://www.hindustantimes.com/world-news/can-shotguns-spy-planes-lasers-protect-europe-from-the-next-drone-incursion-101760421366911.html",
  "scraped_timestamp": "2025-10-14T14:31:42.993863",
  "content_length": 17901,
  "word_count": 2739,
  "source_domain": "www.hindustantimes.com"
}