{
  "title": "‘Can I meet Eric?’ Indonesian president Prabowo Subianto heard asking Trump on hot mic; here's what US prez replied",
  "content": "Indonesian president Prabowo Subianto was heard telling US President Donald Trump on hot mic that he wanted to meet his son, Eric Trump. The incident happened at a multinational Gaza summit in Egypt backing the conclusion of theIsrael-Hamasconflict. The conference was aimed at \"ending the war in the Gaza Strip, enhancing efforts to achieve peace and stability in the Middle East, and ushering in a new era of regional security and stability,\" according to the Egyptian presidency.\n\nSeemingly unaware of a live microphone recording his words, Subianto spoke to Trump and referenced a region that is “not safe, security-wise”. He then asked Trump, “Can I meet Eric?”\n\n“I’ll have Eric call. Should I do that? He’s such a good boy. I’ll have Eric call,” Trump replied.\n\nRead More |Trump's stern words to Emmanuel Macron during tense handshake at Egypt summit revealed by lip reader, ‘You hurt me’\n\nBoth Eric Trump and Donald Trump Jr. serve as executive vice-presidents of the Trump Organisation.\n\nSubianto then told Trump that “we’ll look for a better place,” to which the US President reiterated, “I’ll have Eric call you”.\n\nIt is unclear if the two were referring to the Trump Organisation or any business deals involving the president or his family. It was reported that the company opened its first golf club in Indonesia under the Trump name in March, collaborating with a local company.\n\nRead More |Biden hails Trump after Hamas hostages' release, ‘The road to this deal was not easy’\n\nMeanwhile, Trump’s last-minute plan to inviteBenjamin Netanyahuto the summithad to be droppedafter Turkish president Recep Tayyip Erdoğan said that if the invitation stood, he would not land his plane in Sharm el-Sheikh. The summit was jointly chaired by the US president and his Egyptian counterpart, Abdel Fatah al-Sisi, in Egypt.\n\nAs many as 20 world leaders attended the summit, including heads of Qatar, Palestine, Turkey, Spain, the United Kingdom, Italy, Norway and representatives from the United Nations and European Council. Israeli officials and representatives from Hamas were notably missing.",
  "url": "https://www.hindustantimes.com/world-news/us-news/can-i-meet-eric-indonesian-president-prabowo-subianto-heard-asking-trump-on-hot-mic-heres-what-us-prez-replied-101760428998113.html",
  "scraped_timestamp": "2025-10-14T15:28:12.526533",
  "content_length": 2096,
  "word_count": 336,
  "source_domain": "www.hindustantimes.com"
}