{
  "title": "Canada FM says her visit to India part of Ottawa’s ‘systematic approach’ towards ties with New Delhi",
  "content": "Toronto:Canada’s Minister of Foreign Affairs Anita Anand has said that her visit to India was part of Ottawa’s “systematic approach” towards ties with New Delhi and the joint statement that was issued by the two countries was “meant to be the initial phase of a broader economic framework”.\n\nAnand was responding to questions during a videoconference from Mumbai prior to her departure from India.\n\n“I met with the business community in Mumbai today. I met with the Canadian pension funds in Mumbai today. And there is a significant level of economic interaction between the Canadian and the Indian economy. A free trade negotiation and process would augment already strong economic ties with a framework. But the joint declaration that we finalised is meant to be the initial phases of a broader economic framework,” she said. However, she did not specify when discussions towards a free trade pact will commence.\n\nShe cited the joint statement while saying there will be “increased interaction betweenCanada and Indiain order to jointly achieve the objective of greater trade resilience between the two countries”.\n\nAlso Read | Majority of Canadians support Ottawa’s decision to reset ties with New Delhi: Poll\n\n“In many conversations that I have had, there has been an interest in Canadian energy, in LNG, in solar, in nuclear, and the list goes on. And as you know, our Prime Minister (Mark Carney) has repeatedly reiterated that there will be work in Canada as we augment to an energy superpower. This is well recognised in India,” she said.\n\nThere were also conversations over “staffing up” of the diplomatic missions of the two countries, a process that commenced with the appointment of High Commissioners to the two capitals. “I can assure you that we are building back to a complement of Canadian diplomats across the country. In terms of my conversations on this matter with (External Affairs) Minister (S) Jaishankar, we both agreed that we would staff up as we had been before in order to service our respective populations,” she said.\n\nShe pointed out that the step-by-stepapproach adopted byCanada included “first and foremost, ensuring that the consular and the diplomatic positions are filled, beginning with the High Commissioner” as well as ensuring the security and law enforcement dialogues between the two countries continue.\n\nShe also said she raised “at all points issues relating to transnational repression, issues relating to the safety and security of every Canadian citizen, and the importance of an independent legal investigation that must always investigate crimes that have occurred on Canadian soil.” She pointed to remarks by her and by Jaishankar while stressing “the importance of the security dialogue and ensuring that public security in Canada is one of the building blocks of this relationship as we go forward step by step”.",
  "url": "https://www.hindustantimes.com/world-news/canada-fm-says-her-visit-to-india-part-of-ottawa-s-systematic-approach-towards-ties-with-new-delhi-101760466293036.html",
  "scraped_timestamp": "2025-10-15T09:51:03.738089",
  "content_length": 2866,
  "word_count": 462,
  "source_domain": "www.hindustantimes.com"
}