{
  "title": "‘Carried out flight trials…’: Defence Minister confirms successful testing of drone-launched guided missile",
  "content": "Defence Minister Rajnath Singh on Friday announced that India has conducted the successful flight trials of the UAV Launched Precision Guided Missile (ULPGM)-V3 in the National Open Area Range, test range in Kurnool district of Andhra Pradesh.\n\nIn a major boost to India’s defence capabilities, DRDO successfully carried out flight trials of UAV Launched Precision Guided Missile (ULPGM)-V3 in the National Open Area Range (NOAR), test range in Kurnool, Andhra Pradesh. ULPGM-V3 is an enhanced version of the ULPGM-V2 missile…pic.twitter.com/WMqSzfgYmw\n\nIn a social media post on X, the Defence Minister extended greetings to theDefence Research and Development Organisation (DRDO)and itsindustrypartners for the achievement.\n\nThe social media post read, “In a major boost to India’s defence capabilities, @DRDO_India has successfully carried out flight trials of UAV Launched Precision Guided Missile (ULPGM)-V3 in the National Open Area Range (NOAR), test range in Kurnool, Andhra Pradesh.”Congratulations to DRDO and the industry partners, DcPPs,MSMEsand Start-ups for the development and successful trials of the ULPGM-V3 system.\n\nIn a major boost to India’s defence capabilities,@DRDO_Indiahas successfully carried out flight trials of UAV Launched Precision Guided Missile (ULPGM)-V3 in the National Open Area Range (NOAR), test range in Kurnool, Andhra Pradesh.Congratulations to DRDO and the industry…pic.twitter.com/KR4gzafMoQ\n\nThis success proves that the Indian industry is now ready to absorb and produce criticalDefenceTechnologies,” it added. Earlier in May, the Indian Army undertook extensive Capacity Development Demonstrations at key locations across the country, including the Pokhran Field Firing Ranges, Babina Field Firing Ranges, and Joshimath, with dedicated Air Defence equipment demonstrations also scheduled at Agra and Gopalpur.\n\nAccording to an official press release issued on May 31, these field trials were conducted under near-combat conditions, integrating electronic warfare simulations to assess the performance of cutting-edge defence systems rigorously.On May 27, General Upendra Dwivedi, Chief of the Army Staff, visited Babina Field Firing Ranges and reviewed the ongoing demonstrations and interacted with all stakeholders.\n\nThe demonstrations featured a wide array of advanced technologies developed under the Aatmanirbhar Bharat initiative, aimed at accelerating indigenous capability development.\n\nThe trials mark a significant step in the Indian Army’s roadmap for a “Decade of Transformation” and are designed to ensure rapid absorption of emerging technologies to meet evolving battlefield requirements.A large number of defence industry partners also took part in the demonstration, reflecting the increasing synergy between the Indian Army and domestic manufacturers.\n\nKey platforms undergoing evaluation included Unmanned Aerial Systems (UAS), UAV Launched Precision Guided Munition (ULPGM), Runway Independent (RWI) Remotely Piloted Aerial Systems (RPAS), Counter-UAS Solutions, Loitering Munitions, Specialised Vertical Launch (SVL) Drones, Precision Multi Munition Delivery Systems, Integrated Drone Detection and Interdiction System (IDDIS), Low Level Light Weight Radars, VSHORADS (Next Generation) IR Systems and Electronic Warfare (EW) Platforms.",
  "url": "https://www.financialexpress.com/business/defence/carried-out-flight-trials-defence-minister-confirms-successful-testing-of-drone-launched-guided-missile/3926579/",
  "scraped_timestamp": "2025-09-26T16:40:31.586958",
  "content_length": 3303,
  "word_count": 447,
  "source_domain": "www.financialexpress.com"
}