{
  "title": "Chaitanyananda Saraswati tracked students through CCTV feeds, had cameras installed outside bathrooms: Police",
  "content": "A former chairman of a Delhi management college, who is accused ofsexually assaulting more than 17 studentson campus in Vasant Kunj, allegedly tracked women through hostel CCTV feeds, including cameras installed outside washrooms, PTI reported on Thursday, citing the police.\n\nSwami Chaitanyananda Saraswati, also known as Dr Parthasarthy, was booked after students of Sri Sharada Institute of Indian Management filed a complaint with the group captain heading the Directorate of Education (air headquarters), in August. He had been booked in similar cases in the past but had never been arrested.\n\nAccording to the police, Swami Chaitanyananda Saraswati, also known as Parth Sarthy, used to take female students to Rishikesh in his BMW car under the pretext of \"industrial visits\".\n\nAlso Read |Female student recalls Chaitanyananda's sexual harassment: ‘Baby, I love you…'\n\nThe car has been seized from the institute's basement, and police said the dashcam footage will be examined.\n\n\"Apart from the cameras installed in the institute, CCTV surveillance was also placed in the hostel lobby and outside the bathrooms. The hostel lodges around 75 female students from the economically weaker section (EWS) category. Saraswati regularly monitored the students and kept track of their movements through his phone,” PTI quoted a senior police officer as saying .\n\nAlso Read |‘Come to my room, will take you abroad’: Chaitanyananda's sleazy texts surface\n\nAccording to investigators, Saraswati tampered with the institute's digital video recorder (DVR) system, leading to destruction of crucial CCTV evidence. However, police believe the dashcam of the BMW may provide some material evidence.\n\nThe police also refuted claims of a “torture chamber” where female scholars, particularly those from the EWS category, were allegedly exploited.\n\nDCP (Southwest) Amit Goel has clarified that no such chamber was found during the searches.\n\nPolice said the investigation also revealed that Saraswati tightened his control over the institute by allegedly subletting the properties of Jagadguru Shankaracharya Mahasamsthanam Dakshinamnaya Sri Sharada Peetham, which runs it, to private companies for financial gains.\n\nAlso Read |Inside ‘godman’ Chaitanyananda's sexual exploitation scandal at Delhi college\n\n“He reportedly used the proceeds to purchase high-end luxury vehicles,” an officer said, according to PTI.\n\nWhile Saraswati’s whereabouts are unclear, the police had earlier said that he was in London when the case was filed in August. A lookout circular was issued against him for airports in India on Wednesday.\n\nAccording to police, the accused’s last active location was traced to Mumbai, based on the information on his foreign travel. He is suspected to have travelled abroad recently, deliberately avoiding electronic devices and disguising his appearance to evade arrest, police said, according to PTI.",
  "url": "https://www.hindustantimes.com/india-news/chaitanyananda-saraswati-tracked-students-through-cctv-feeds-had-cameras-installed-outside-bathrooms-police-101758806585963.html",
  "scraped_timestamp": "2025-09-26T00:13:46.027809",
  "content_length": 2903,
  "word_count": 432,
  "source_domain": "www.hindustantimes.com"
}