{
  "title": "Charlie Kirk's parents seen for the first time since his death, videos from Medal of Freedom ceremony surface | Watch",
  "content": "Charlie Kirk’s parentswere seen for the first time since theTurning Point USAfounder’s assassination in October. Kirk, 31, was allegedly shot dead by Tyler Robinson on September 10 during an appearance at a campus event in Utah.\n\nKirk’s parents, Robert W. Kirk and Kathryn Kirk, remained away from the spotlight after his death. They were seen for the first time during a ceremony in the White House Rose Garden, during which President Donald Trump posthumously awarded the Presidential Medal of Freedom to Kirk. The ceremony took place on October 14, which would have been Kirk's 32nd birthday.\n\nRead More |Charlie Kirk's murder ‘part of a larger effort’? FBI probing groups that may have 'aided and abetted’ Tyler Robinson\n\nSeveral social media posts have revealed that Kirk’s parents were present at the ceremony, including a video of Trump speaking to them.\n\nSenator Marsha Blackburn posted a photo on Instagram, writing, “It was an honor to share a special moment with Charlie Kirk’s parents at the White House today. The loss they have endured is unimaginable. Charlie’s legacy will never be forgotten, and I can’t think of a more fitting tribute to his life than the Presidential Medal of Freedom.”\n\nA post shared by Sen. Marsha Blackburn (@marshablackburn)\n\nAnother video shows the grieving parents standing in silence after the ceremony, with President Trump and Vice President JD Vance standing with Kirk’s widow, Erika Kirk, as Amazing Grace played.\n\nMeanwhile,The White Houseshared a post honoring Kirk, writing on Truth Social, “Freedom is not a theory, it's a testimony. Every single day the Trump Administration will continue to carry out the mission for which Charlie Kirk lived. For Charlie.”\n\nRead More |Is Tyler Robinson autistic? Viral video sparks theory after Charlie Kirk's murder\n\nKirk’s parents were notably absent from his memorial at State Farm Stadium in Glendale, Arizona. The event included high-profile guests like Trump, Vance, and Tucker Carlson. It was organized by Turning Point USA, and Erika was present as the new CEO.",
  "url": "https://www.hindustantimes.com/world-news/us-news/charlie-kirks-parents-seen-for-the-first-time-since-his-death-videos-from-medal-of-freedom-ceremony-surface-watch-101760495113583.html",
  "scraped_timestamp": "2025-10-15T11:17:05.599789",
  "content_length": 2056,
  "word_count": 329,
  "source_domain": "www.hindustantimes.com"
}