{
  "title": "Chhattisgarh ranks second in national water conservation campaign",
  "content": "Raipur, Chhattisgarh has secured the second position in the 'Jal Sanchay Jan Bhagidari' 1.0 campaign, marking a major achievement in water conservation and community participation, an official said on Friday.\n\nThe Raipur Municipal Corporation has won the first prize for its outstanding contribution through 33,082 water conservation works, in the urban bodies category, the official said.\n\nChief Minister Vishnu Deo Sai congratulated the people of the state, calling the success a foundation for securing water resources for future generations, a government release stated.\n\nSai said Chhattisgarh's success in JSJB 1.0, an initiative of the Ministry of Jal Shakti , has not only brought national recognition but also established the state as a model of water management for India.\n\nIt reflects not just statistics but a collective consciousness that has made Chhattisgarh a source of inspiration for the nation, he said.\n\nSo far, 4,05,563 water conservation projects have been completed across the state, turning the initiative into a mass movement.\n\nAccording to the government release, Balod, Rajnandgaon, and Raipur secured the top three ranks respectively in Category 1, and these districts will receive an award of₹2 crore each.\n\nIn Category 2, Mahasamund, Balodabazar, and Gariaband districts will receive₹1 crore each, while in Category 3, Bilaspur, Raigarh, Balrampur, Dhamtari, Surajpur, and Durg districts will be awarded₹25 lakh each, it stated.\n\nSai emphasised that the honour belongs to every farmer, woman, youth, and public representative who pledged to save every drop of water.\n\nHe credited the achievement to the state's \"dialogue and participation-based good governance policy\", describing water conservation as the cornerstone of Chhattisgarh's agriculture-based economy and long-term growth.\n\nLauding Raipur's achievement, Sai said its model of community-driven urban water conservation is exemplary for the entire country.\n\nHe urged citizens to adopt water conservation as a way of life, stressing that \"saving every drop is the guarantee of future water security\".\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/chhattisgarh-ranks-second-in-national-water-conservation-campaign-101758882915968.html",
  "scraped_timestamp": "2025-09-26T17:02:01.175003",
  "content_length": 2182,
  "word_count": 322,
  "source_domain": "www.hindustantimes.com"
}