{
  "title": "China imposes port fees on US as tensions over tariffs heat up",
  "content": "China announced on Tuesday that new special port fees will take effect for US ships arriving in Chinese ports, according to state media reports.\n\nThe move comes amid trade tensions between Washington and Beijing.\n\nThe special charges, according to China, were imposed with the aim to \"safeguard the legitimate rights and interests of the Chinese shipping industry and enterprises while ensuring fair competition in international shipping,\" Global Times reported.\n\nShips subject to the special port fees also include those owned or operated by entities where US enterprises, organisations and individuals hold a direct or indirect stake of 25 per cent or more, as well as all the US-flagged and US-built vessels, China's Ministry of Transport said.\n\nThe Chinese Ministry, in a statement, outlined a phased escalation for the special port fees on eligible US vessels berthing at Chinese ports, which will initially be 400 yuan ($56) per net ton from Tuesday and increase annually on April 17 for the subsequent three years.\n\nChina imposed the levy on October 10 in response to the US decision to levy additional port fees on Chinese ships arriving at American ports from October 14, the Chinese Transport Ministry said.\n\nThe ministry, according to the Global Times, had noted that the US actions have seriously violated WTO rules and the China-US maritime transport agreement, causing severe disruption to maritime trade between the two countries.\n\nChina had also announced moves to tighten controls on its rare earth exports.\n\nUS President Donald Trump had then responded with a threat of imposing an additional 100 per cent tariff on China and other restrictive measures, set to take effect on November 1.\n\nMeanwhile, China on Tuesday urged the US to \"correct its wrongdoings\" and \"demonstrate sincerity in trade discussions\" to meet each other halfway, state media reported.\n\nThe statement by China's Ministry of Commerce followed Monday's working-level talks between Washington and Beijing, amidst an escalation in trade tensions between the world's two largest economies.\n\n\"The US side cannot seek talks on one hand while threatening to introduce new restrictive measures on the other. This is not the right way to get along with China,\" a spokesperson for the Chinese Ministry said in a statement today according to Xinhua.",
  "url": "https://www.hindustantimes.com/world-news/china-imposes-port-fees-on-us-as-tensions-over-tariffs-heat-up-101760427612992.html",
  "scraped_timestamp": "2025-10-14T15:45:21.622408",
  "content_length": 2327,
  "word_count": 369,
  "source_domain": "www.hindustantimes.com"
}