{
  "title": "CM hints at cabinet rejig after elections in Bihar",
  "content": "Karnataka Chief Minister Siddaramaiah has indicated that a cabinet reshuffle may take place after the Bihar assembly elections, subject to the approval of the Congress high command, according to senior party insiders familiar with the matter.\n\nAt a dinner meeting held on Monday night at his official residence, Cauvery, in Bengaluru, Siddaramaiah reportedly told ministers that nearly a dozen positions could be reallocated to bring in new faces. He is said to have emphasised that any reorganisation would occur only after receiving a final nod from the party leadership in Delhi.\n\nDeputy Chief Minister and state Congress president D.K. Shivakumar attended the dinner along with several cabinet members. Sources present said that after Shivakumar left early, Siddaramaiah held informal discussions with his colleagues, urging them to stay focused on governance and party work. The chief minister is believed to have reminded his ministers that performance and loyalty remain key factors in the party’s decision-making process, noting that “the high command sees everything and rewards accordingly.”\n\nAccording to insiders, Siddaramaiah also encouraged ministers to take greater responsibility in strengthening the Congress organisation and to be ready for assignments outside Karnataka, including potential roles in Bihar.\n\nPublicly, ministers sought to downplay speculation of a reshuffle. Transport Minister Ramalinga Reddy said, “We discussed the BBMP, Zilla Panchayat, and Taluk Panchayat elections. No discussion was held regarding the cabinet reshuffle. The only agenda of the dinner meet was elections.” Labour Minister Santosh Lad described the event as “a general and casual gathering,” adding, “We had a great and delicious dinner. It was a general and casual gathering where we greeted each other and spoke. Some people personally spoke to the CM, but nothing in particular was discussed.”\n\nSenior leaders, however, suggested that the dinner served multiple purposes beyond camaraderie. One aim, they said, was to reinforce Siddaramaiah’s authority amid growing talk within the ruling party of a “November Revolution” -- a term reportedly used by supporters of Shivakumar to hint at a possible leadership change as the Congress government reaches its halfway mark.\n\nAnother purpose, according to those aware of the discussions, was to prepare ministers for potential changes in the cabinet to maintain political balance. Siddaramaiah’s aides are said to be concerned that any reshuffle could provoke discontent among those excluded, possibly deepening existing divisions within the party.\n\nA third issue addressed during the discussions, insiders said, related to a letter from the State Contractors’ Association alleging irregularities across several departments. The letter, which was sent to both Siddaramaiah and the Congress leadership in Delhi, prompted the chief minister to instruct ministers overseeing the departments involved -- reportedly seven or eight --to identify and resolve internal issues.\n\nEarlier that day, Siddaramaiah responded to growing speculation over leadership changes. Reacting to comments made by Shivakumar in a television interview that only the high command’s opinion mattered, Siddaramaiah said, “I will not answer to these. High command is high command. Both the opinion of legislators and high command are important. Without the opinion of the legislators, no one can become the chief minister. Only with the majority. Of course, you need the blessings of the high command as well.”\n\nHis remarks reflected his confidence in the backing he holds among Congress legislators -- a support base that has long been central to his political strength within the state unit.\n\nWhen asked whether the dinner had any link to cabinet changes, Siddaramaiah dismissed the suggestion with a laugh. “The dinner party has nothing to do with the cabinet reshuffle,” he said. “I host dinners quite often.”",
  "url": "https://www.hindustantimes.com/india-news/cm-hints-at-cabinet-rejig-after-elections-in-bihar-101760469593621.html",
  "scraped_timestamp": "2025-10-15T09:51:03.041106",
  "content_length": 3936,
  "word_count": 590,
  "source_domain": "www.hindustantimes.com"
}