{
  "title": "Code of ethics for digital news websites",
  "content": "The Digital News Publishers Association has voluntarily drawn up a Code of Ethics for its members as outlined below, which demonstrates their commitment to responsible digital publishing — even as it, in order to protect our 19 (1) (a) and other Constitutionally mandated freedoms, keeps under review and scrutinizes any developments likely to restrict the gathering and dissemination of news and current affairs or any other content.\n\nThe object of this Code is to outline high standards, ethics and practices in digital news publishing, and does not constitute any attempt to involve itself in the day to day operations of the publishers — who have complete editorial and content independence.\n\nThe basic precepts of the Code of Ethics are to maintain the standards of digital publishing as well as protect and maintain the independence of journalists, content entities and publishers.\n\n1. Digital news websites follow the laws of the land including the Constitution of India, the over 30 laws relating to the media, relevant provisions of IPC, CrPC as well as the Information Technology Act, 2000, where applicable.\n\n2. They also diligently adhere to accepted norms of journalistic ethics and practices and maintain the highest standards of professional conduct. There are several layers of these self-regulatory ethics and codes – including as outlined by specific entities as well as rigorous processes in newsrooms at the level of journalists and editors.\n\n3. Accuracy, Transparency & Fairness Members should eschew publication of inaccurate, baseless or distorted material. Pre-publication verification should be mandatory. Defamation should be avoided. Adherence to applicable laws and rules is necessary.\n\na. News reports and articles should incorporate comments or version of person or party in respect of whom allegations are carried. If not carried, the person or party’s response, if received later, to be incorporated.\n\nb. If there are developments in the news, and the concerned person or party requests an update, the same must be carried appropriately. Date of update should also appear in the news item published.\n\nIf news report or article is found to contain false or inaccurate information, then on approach by the concerned person or party, providing correct information, identifying himself or herself, providing required documents or material, the portion of the news report or article should be edited or deleted.\n\nIf entire news report is found to contain false, inaccurate information, the entire article should be deleted.\n\na. Copyright in text, photographs, plans, diagrams, cartoons, etc must be respected. If copyrighted material is used, then prior permission should be taken and publication must acknowledge moral and ownership rights.\n\nb. If permission requires payment of fee or royalty, the same must be paid.\n\nc. Trade Marks and Service Marks of third parties not to be used except with prior permission or if such use constitutes fair use.\n\nd. In case infringement of intellectual property – upon receiving any request and after getting the necessary documents, the concerned content should be edited, deleted or take down if necessary.\n\n7. Care to be taken for reporting sensational matters and crime. Presumption of innocence must be preserved. Comments and speculation on evidence, witness and witness conduct, accused and victim and their respective conduct to be avoided. Such reporting should be based on facts and unbiased.\n\n8. Special care to be taken while reporting on sexual harassment in workplace, child abuse, rape, where accused or victims are minors, matrimonial, riots and communal disputes / clashes, divorce and custody cases, adoption matters, etc.\n\n• Care to be taken, to follow Sections 67, 67A and 67B of the Information Technology Act, 2000 where applicable — which provide for penalties for publishing or transmitting obscene material, sexually explicit material and also material depicting children in sexually explicit acts, in electronic form.\n\nMembers –when intermediaries as defined under the Information Technology Act, 2000— follow the grievance redressal mechanism as outlined therein and are cognizant of the liabilities and safe harbor protections under Section 79 of the IT Act 2000. Hence, as relevant, they follow the Information Technology (Intermediary Guidelines) Rules, 2011 including appointing a grievance officer whose contact details are displayed on the website and who acts within 36 hours of receipt of complaint by affected person and redresses the complaint within one month from its receipt.\n\nConduct periodic training and awareness programs with editorial staff about existing laws including Constitution of India, the over 30 laws relating to the media like The Indecent Representation of Women (Prohibition) Act, Copyright Act, Right to Information Act, relevant provisions of Indian Penal Code and CrPC, civil and criminal defamation, IPR, Juvenile justice, POCSO, relevant provisions relating to reporting on rape and molestation, harassment in the work place, caste or gender related crime, domestic violence, etc.\n\no Names of victims and details leading to identification of victims or perpetrator, if juvenile or in the workplace, to be strictly avoided.\n\no Photographs of victims, their residence, workplace, etc to be avoided.\n\no Special care and caution must be exercised at all times while reporting matters related to communal or religious disputes/clashes. Such news items shall be published only after a proper verification of facts and should be presented with due caution and restraint, ensuring an environment that is conducive to promoting communal harmony, amity and peace.\n\no Special care in reporting on Courts and judicial matters. Create awareness among editorial staff about legislative privileges and correct reporting of Court hearings, judicial matters, etc. To ensure that versions of victim and accused are covered, without comments thereon.\n\no Respect for privacy especially persons not in public life.\n\nStay updated with the latest -Click here to follow us on Instagram\n\nUnited States President Donald Trump Friday announced a new round of punishing tariffs, saying the US will impose 100% duties on imported branded drugs, 25% tariffs on heavy-duty trucks, and 50% tariffs on kitchen cabinets starting October 1.",
  "url": "https://indianexpress.com/article/india/code-of-ethics-for-digital-news-websites-6758543/",
  "scraped_timestamp": "2025-09-26T15:39:49.264525",
  "content_length": 6335,
  "word_count": 971,
  "source_domain": "indianexpress.com"
}