{
  "title": "‘Deeply troubling’: Editors Guild of India on exclusion of women journalists at Afghan Taliban minister presser",
  "content": "Amid the ongoing row over the absence of women journalists at a press conference by Afghanistan's Taliban regime's foreign minister, the Editors Guild of India on Saturday \"strongly condemned\" the exclusion and said that such a \"discriminatory\" act was \"deeply troubling\" regardless of whether the ministry of external affairs coordinated the event.\n\nThe press conference held by Taliban foreign minister, Amir Khan Muttaqi, who is on a diplomatic visit to India, sparked a political row and gender rights controversy, after women were allegedly barred from attending it.\n\nSeveral political leaders, including Congress leaders Rahul Gandhi and P Chidambaram, and TMC MP Mahua Moitra, expressed dismay over the exclusion of female media personnel.\n\nThe Ministry of External Affairs addressed the criticism and said thatthe government had \"no involvement\"in the press interaction held on Friday by Afghanistan's foreign minister, Amir Khan Muttaqi, in Delhi.\n\nThe Editors Guild of India issued a statement on the matter and said the organisation \"strongly condemns the exclusion of women journalists from the press conference\" held by Muttaqi.\n\nThe EGI noted that the media address was meant to mention diplomatic and bilateral engagements during Muttaqi's India visit.\n\n\"While diplomatic premises may claim protection under the Vienna Convention, that cannot justify blatant gender discrimination in press access on Indian soil,\" it added.\n\nThe Guild said that whether or not the MEA coordinated the event, the exclusion was still deeply troubling, adding that the missing solidarity in pointing out such a discriminatory practice hints at a \"troubling complacency\" in the nation's community.\n\n\"Whether or not the MEA coordinated the event, it is deeply troubling that such a discriminatory exclusion was allowed to proceed without objection. The absence of solidarity in pointing this discriminatory practice at the event signals a troubling complacency in our community,\" the statement said.\n\nThe EGI urged the central government to publicly affirm that press access at diplomatic events held within the country \"must respect gender equity\".\n\n\"We also call upon our journalist colleagues and media houses to reflect on this lapse and adopt a zero-tolerance stand against any kind of discriminatory exclusion of anyone at a press event. A free and inclusive press must defend representation, not enable exclusion,\" the EGI statement added.\n\nTaliban foreign minister Amir Khan Muttaqi's week-long visit to India is the first high-level delegation from Kabul to New Delhi since the Taliban took control of Afghanistan in 2021.\n\nThe Taliban has long been known for its views on women, with several debates highlighting the challenges faced by Afghan women due to the militant group's rule in the country.\n\nThey have systematically restricted women's rights across various verticals, including education, healthcare, employment, and public life.\n\nGirls have been banned from attending school beyond the sixth grade, and women are required to remain fully covered from head to toe whenever they leave home. The very sound of a woman's voice in public has also been effectively silenced.",
  "url": "https://www.hindustantimes.com/india-news/deeply-troubling-editors-guild-of-india-on-exclusion-of-women-journalists-at-afghan-taliban-minister-presser-101760192912962.html",
  "scraped_timestamp": "2025-10-11T23:53:33.447013",
  "content_length": 3181,
  "word_count": 484,
  "source_domain": "www.hindustantimes.com"
}