{
  "title": "Defence",
  "content": "As per the official information released on the Indian Navy’s official website, 51 helicopters will be deployed by the Navy,…\n\nIndia’s Sudarshan Chakra air defence mission, announced by PM Modi, aims to shield the nation from aerial attacks by 2035.…\n\nThe ministry of defence said the launch validated all operational and technical parameters. “It was carried out under the aegis…\n\nPM Narendra Modi recalled the part of the Mahabharat when Lord Shri Krishna had blocked the sunlight with his Sudarshan…\n\nIndia’s annual defence production has reached a record-breaking ₹1,50,590 crore in the 2024-25 fiscal year, marking an 18% growth over…\n\nFor the Indian Army, Acceptance of Necessity (AoN) has been approved for the procurement of Thermal Imager-based Driver Night Sights…\n\nA Para (Special Forces) officer, Lt Gen Singh, during his illustrious career spanning 38 years, has held various command and…\n\nTwo infantry brigades near the border have already been changed into Rudra units. These will also get specially designed logistics…\n\nIndia successfully flight-tested the UAV Launched Precision Guided Missile (ULPGM)-V3 in Kurnool, Andhra Pradesh, a significant boost to indigenous defence…\n\nIn a statement, the spokesperson said the UK remains very grateful for the support and collaboration of the Indian authorities…\n\nThe delivery is part of a larger contract signed between Boeing and the Indian government to supply a total of…\n\nNavy chief admiral says he is optimistic that Nistar will carry forward the legacy of the original ‘Nistar’ ship, which…\n\nThe two-day trial was conducted at an altitude of over 15,000 feet in eastern Ladakh, where the Akash Prime successfully…\n\nThe developments also come amid speculation that neighbouring Pakistan will soon induct Chinese fifth-generation fighter jets.\n\nCDS General Anil Chauhan last month strongly refuted Pakistan’s claims of shooting down six Indian aircraft, including Rafales, calling the…\n\nThe Defence Acquisition Council has approved military equipment purchases worth Rs 1.05 lakh crore, all from domestic sources. The acquisitions…\n\nBrazil has shown keen interest in India’s Garuda 105 v2 artillery system developed by Bharat Forge’s Kalyani Strategic Systems. The…\n\nThe Indian Air Force will get at least half-a-dozen Tejas Light Combat Aircraft by March 2026, Hindustan Aeronautics Ltd CMD…",
  "url": "https://www.financialexpress.com/business/defence/",
  "scraped_timestamp": "2025-10-14T15:27:17.820177",
  "content_length": 2356,
  "word_count": 356,
  "source_domain": "www.financialexpress.com"
}