{
  "title": "Delhi and the firecracker debate go back a long way: A 1961 redux",
  "content": "The recent debate around firecrackers in Delhi took a new turn after the Supreme Court said the ban will be lifted for five days. While the decision about relaxing the absolute ban is still pending, Delhi will likely witness legal firecrackers this year. But the issue of firecrackers in Delhi is not new.\n\nIt goes back to 1961, when concerns over noise pollution prompted a proposal to ban crackers. However, the government of India did not approve it.\n\nThe proposal dates back to January of that year and originated from the Deputy Ganj Committee, one of the industrial market associations in Delhi’s Sadar Bazar, news agency PTI reported, citing official records.\n\nThe committee wrote to the then chief commissioner of Delhi complaining about noise pollution caused by large-scale use of fireworks during festivals and other celebrations.\n\nThe letter was then forwarded from the office of the chief commissioner, who was the executive head of the national capital, to the Ministry of Works, Housing and Supply for its consideration.\n\nThe Supreme Court first imposed a ban on firecrackers in Delhi-NCR in 2014-15 due to rising pollution levels. Last year, despite a ban on burning firecrackers, the city was filled with smoke as firecrackers were heard citywide from 6 pm till well after midnight.\n\nOn Friday, the Supreme Court said that it willlift the ban for the “time being”.\n\n“However, we will confine it to certain time limits,” it said, just days ahead of Diwali that's on October 20 this year.\n\nAlso read:Delhi banks on ‘green crackers’ this Diwali: What are they? Risks and concerns | Explained\n\nThe observation, which hinted at relaxation of the ban, was made by a bench comprising Chief Justice B R Gavai and Justice K Vinod Chandran, which reserved its order on a batch of pleas seeking permission to manufacture and sell \"green\" firecrackers in Delhi-NCR.\n\nBack in 1961, Delhi’s population was around 26 lakh, a fraction of the over 2 crore residents the city has now.\n\nIn its letter, the committee said that the deafening noise from some high-decibel crackers was causing distress, especially to those with heart ailments. It further said, \"During the course of the fireworks display, it appears as if a complete warfare is going on outside,” adding that the authorities seemed \"immune to the situation\".\n\nAlso read:Why green firecrackers for Diwali are still bad news for Delhi\n\nIt also suggested several measures to control the problem, including issuing a complete ban on high-decibel crackers and the prohibition of fireworks after 10 pm.\n\nThe secretary to the government of India in the Ministry of Works, Housing and Supply responded to the proposal, stating that a total ban was unnecessary.\n\nThe government said the manufacture of crackers was already regulated under the Indian Explosives Act and Rules, and the sizes of crackers had been reduced in 1958 \"with a view to minimising the noise produced by their firing\", the letter noted.\n\nThe government also said that the issue can be addressed by police vigilance and limiting firecrackers for certain hours.\n\nAt the time, Delhi did not have a chief minister, as the Delhi legislative assembly had been dissolved in 1956 following the tenure of the city’s first chief minister, Chaudhary Brahm Prakash (1952–1955).\n\nUntil the establishment of the Delhi Metropolitan Council in 1966, the Chief Commissioner administered Delhi under the direct authority of the President of India.",
  "url": "https://www.hindustantimes.com/india-news/delhi-and-the-firecracker-debate-go-back-a-long-way-a-1961-redux-101760179604932.html",
  "scraped_timestamp": "2025-10-11T23:45:58.011076",
  "content_length": 3454,
  "word_count": 563,
  "source_domain": "www.hindustantimes.com"
}