{
  "title": "‘Delhi banega Khalistan’: Freed terrorist in Canada issues threat against India, warns NSA Doval",
  "content": "Khalistani separatist Inderjeet Singh Gosal, the man at the centre of India's long-running separatist dispute, recently announced his intent to push for a Khalistan referendum in India after being released on bail in Canada.\n\nGosal, who has been linked to the Khalistani cause, was released on bail from the Ontario Central East Correctional Centre within a week.\n\nSoon after the bail, Gosal released a video warning India's top security official that New Delhi will soon become Khalistan.\n\nAlso Read |Trump’s $100K H-1B visa fee may open doors for Canada to attract talent, experts say\n\n\"India, I'm out; to support Gurpatwant Singh Pannun, to organise the Khalistan referendum on November 23, 2025. Delhi banega Khalistan,\" Gosal says in the video captured just outside the prison gates.\n\nThreat issued to NSA Ajit DovalIn the same clip, Khalistani terrorist Gurpatwant Singh Pannun aimed his remarks squarely at the Modi government and India's National Security Adviser Ajit Doval, daring him to attempt any extradition or arrest abroad.\"Ajit Doval, why don't you come to Canada, America or any European country and try to arrest or do any extradition. Doval, I am waiting for you,\" Pannun announced.Meanwhile, Pannun, who heads the banned Sikhs For Justice outfit, was recently charged with challenging India's sovereignty, over a speech in which he had offered a₹11 crore reward to anyone who would stop the flag hoisting inRed Fort on Independence Day.Inderjeet Gosal released on bailThe coordinator in Canada for the secessionist group Sikhs for Justice's (SFJ) so-called Khalistan Referendum, and Inderjeet Singh Gosal, was released on bail by authorities on Thursday.Gosal, who is considered a close confidant of SFJ general counsel Gurpatwant Pannun,was arrested along with Jagdeep Singh, 41, of Pickville, New York, and Arman Singh, 23, of Toronto.SFJ said that Gosal was released from the Lindsay Correctional Centre in Ontario, where he was being held, and would lead the next phase of the so-called referendum, scheduled for November 23.On Wednesday, in a statement, the Ontario Provincial Police’s Highway Safety Division said three persons faced 36 weapons-related charges after their vehicle was stopped in the town of Oshawa on September 19.\n\nIn the same clip, Khalistani terrorist Gurpatwant Singh Pannun aimed his remarks squarely at the Modi government and India's National Security Adviser Ajit Doval, daring him to attempt any extradition or arrest abroad.\n\n\"Ajit Doval, why don't you come to Canada, America or any European country and try to arrest or do any extradition. Doval, I am waiting for you,\" Pannun announced.\n\nMeanwhile, Pannun, who heads the banned Sikhs For Justice outfit, was recently charged with challenging India's sovereignty, over a speech in which he had offered a₹11 crore reward to anyone who would stop the flag hoisting inRed Fort on Independence Day.\n\nThe coordinator in Canada for the secessionist group Sikhs for Justice's (SFJ) so-called Khalistan Referendum, and Inderjeet Singh Gosal, was released on bail by authorities on Thursday.\n\nGosal, who is considered a close confidant of SFJ general counsel Gurpatwant Pannun,was arrested along with Jagdeep Singh, 41, of Pickville, New York, and Arman Singh, 23, of Toronto.\n\nSFJ said that Gosal was released from the Lindsay Correctional Centre in Ontario, where he was being held, and would lead the next phase of the so-called referendum, scheduled for November 23.\n\nOn Wednesday, in a statement, the Ontario Provincial Police’s Highway Safety Division said three persons faced 36 weapons-related charges after their vehicle was stopped in the town of Oshawa on September 19.",
  "url": "https://www.hindustantimes.com/india-news/delhi-banega-khalistan-terrorist-inderjeet-singh-gosal-in-canada-issues-threat-against-india-warns-nsa-ajit-doval-101758874443698.html",
  "scraped_timestamp": "2025-09-26T17:23:13.466667",
  "content_length": 3677,
  "word_count": 574,
  "source_domain": "www.hindustantimes.com"
}