{
  "title": "Democratic representative Ilhan Omar slams Donald Trump over Somalia remarks: 'Lying buffoon, embarrassing fool'",
  "content": "In a fresh war of words between Democratic Representative Ilhan Omar and US President Donald Trump, former branded POTUS a \"lying buffoon\" and “embarrassing liar” for falsely claiming that he had spoken to Somalia's president to deport her.\n\n\"From denying Somalia had a president to making up a story, President Trump is a lying buffoon. No one should take this embarrassing fool seriously,\" Minnesota congresswoman wrote on X. “You know, I met the head of Somalia... And I suggested that maybe he'd like to take her back. And he said, 'I don't want her.'”\n\nOmar made the remarks over Trump's claim that he had spoken to Somalia's president to deport Omar while signing executive orders at the Oval Office.\n\nEarlier, Trump had made remarks against Omar and targeted her country of origin, Somalia for its political and economic instability.\n\n\"Ilhan Omar's Country of Somalia is plagued by a lack of central Government control, persistent Poverty, Hunger, Resurgent Terrorism, Piracy, decades of Civil War, Corruption, and pervasive Violence,\" Trump said on Truth Social.\n\n“70% of the population lives in extreme Poverty, and widespread Food Insecurity. Somalia is consistently ranked among the World's Most Corrupt Countries, including Bribery, Embezzlement, and a Dysfunctional Government.” he said.\n\n\"All of this, and Ilhan Omar tells us how to run America! P.S. Wasn't she the one that married her brother in order to gain Citizenship???\" Trump wrote\n\n\"What SCUM we have in our Country, telling us what to do and how to do it,\" he continued.\n\nThe online post was followed by fresh remarks from Trump later the same day, when he once again attacked Omar and Somalia after a resolution to reprimand her and strip her of committee assignments failed in the House, The Hill reported. He called for Omar's impeachment.\n\n\"I think she's terrible. I think she should be impeached. I think she's terrible,\" Trump told reporters aboard Air Force One.\n\nReferring again to Somalia, where Omar was born before moving to the United States in the 1990s, Trump said, \"So how are they doing? How's your government? Do they have a president? Do they have a council? Do they have anything? Do they have police? I love these people. They come from a place with nothing, nothing, no, anything, and then they tell us how to run our country.\"\n\nThe fresh feud between the two emerged after Omar's remarks over conservative activist Charlie Kirk who was assassinated on September 10. She called a “reprehensible human being” and a “stochastic terrorist, following which Rep. Nancy Mace introduced a resolution to reprimand Omar over her comments.",
  "url": "https://www.hindustantimes.com/world-news/us-news/democratic-representative-ilhan-omar-slams-donald-trump-over-somalia-remarks-lying-buffoon-embarrassing-fool-101758871349312.html",
  "scraped_timestamp": "2025-09-26T18:03:57.879804",
  "content_length": 2624,
  "word_count": 431,
  "source_domain": "www.hindustantimes.com"
}