{
  "title": "Disney monorail accident: Was there a death at the Contemporary Resort? What we know",
  "content": "Multiple reports are circulating online alleging that a person died at Disney’s Contemporary Resort at Walt Disney World on Tuesday. According to unverified social media posts, an individual may have either fallen or jumped onto the Monorail tracks and was struck by an oncoming train. Some posts also claim that a body was seen being removed from the scene. Monorail and Observation Deck are closed as a result.\n\nWDWNT reported that multiple sheriff’s units and emergency vehicles were present at the Contemporary Resort. A crime scene tape had been placed around a service entrance. Videos showing law enforcement activity at the location have also surfaced on social media.\n\nHowever, as of now, neither Disney nor local authorities have confirmed any details regarding the incident.\n\nAlso Read:Disneyland guest dies after Haunted Mansion ride: What we know about cause of death\n\nOn July 30, a ferry boat collided with a dock at Magic Kingdom park in WaltDisney World, alarming guests on board. Speaking to PEOPLE, one visitor recounted the incident.\n\nThe guest, Deanna, said she was visiting Magic Kingdom with her husband and their two daughters. They stayed until park closing, hoping to watch the nighttime parade. However, cast members announced the parade would be canceled due to impending weather.\n\nAccording to Deanna, staff directed guests to exit the park and recommended taking the monorail to return to the Transportation and Ticket Center (TTC), where most guests had parked. Since they had arrived via monorail earlier that day, the family decided to take the ferry back.\n\nOnce on board, the family split up. Deanna and one daughter went to the upper deck, while her husband and their other daughter remained on the lower level. What happened next shocked everyone on board.\n\n“The boat hit with full speed, I mean, it went full speed into this barrier,” she told PEOPLE.",
  "url": "https://www.hindustantimes.com/world-news/us-news/disney-monorail-accident-was-there-a-death-at-the-contemporary-resort-what-we-know-101760492769424.html",
  "scraped_timestamp": "2025-10-15T11:04:22.202749",
  "content_length": 1887,
  "word_count": 307,
  "source_domain": "www.hindustantimes.com"
}