{
  "title": "Donald Trump's approval ratings today: How have they changed since the Gaza peace deal? Explained",
  "content": "President Donald Trump seems to be currently stuck with a double dilemma. While he is still picking up the laurels of the peace deal in Gaza betweenHamasand Israel, after nearly three years of fighting, on the domestic front, he is dealing with a government shutdown. In such a conflicting situation, how is the 47th POTUS' approval ratings faring?\n\nFrom the pinnacle of popularity after the November 2024 US election, which saw Trump win both the majority vote and the electoral votes, Trump's approval rating has significantly fallen nine months into his tenure. Nate Silver currently ranks Trump more on the disapproval side, with more than 52% disapproving, and a little more than 44% approving. Over the last one week, his net approval has fallen by between 10-16 points, multiple polls reveal.\n\nAmong the contributors to it have been Trump's spending cuts, firing of federal workers, sending ICE and National Guard to Democrat-ruled states, and attempting to carry out mass deportations.\n\nThen on October 9, 2025, Hamas and Israel accepted the US and Egypt-negotiated peace deal in Gaza, in which 20 Israeli prisoners were swapped by Hamas in exchange for several Palestinian political convicts and detainees. It brought momentary peace in the Gaza Strip since the war started on October 7, 2023, though it remains to be seen if the peace holds.\n\nTrump's role in the peace deal has been noticed, with many rivals such as Hilary Clinton and former PresidentJoe Bidenlauding him for it. But that has failed to convert into a significant gain in net approval amid the government shutdown and backlash over policy decision.\n\nThe Gaza Peace Deal was accepted by Hamas on October 9, 2025, after a series of negotiations over the last month. The US and Egypt played a key role in it, with Trump being the first to announce it, alongside Israeli PMBenjamin Netanyahu. But when it comes to approval, there are conflicting reports.\n\nTheNate SilverBulletin notes that the President's Net Approval has gone up slightly, from -10.3% on September 13 to -7.9% on October 14. It marks a slight recovery on the Nate Silver rating from Trump's February high of +11%.\n\nMeanwhile, theEconomist's approval rating for Trump over the last week was rather bleak. It was noted in an October 15 update on the rating that Trump's net approval currently stands at -16%.\n\nThen, on the Rasmussen Reports poll, Trump's net approval rose from -10 on October 8 to -7 on October 14.\n\nSimilarly, Newsweek's tracker also showed an improvement of +1 from -8 on October 8 to -7 on October 14.",
  "url": "https://www.hindustantimes.com/world-news/us-news/donald-trumps-approval-ratings-today-how-have-they-changed-since-the-gaza-peace-deal-explained-101760495318028.html",
  "scraped_timestamp": "2025-10-15T10:16:04.757737",
  "content_length": 2560,
  "word_count": 428,
  "source_domain": "www.hindustantimes.com"
}