{
  "title": "Donald Trump stops speech to let Pakistan PM Shehbaz Sharif speak at Middle East summit",
  "content": "US President Donald Trump halted his speech at a Middle East peace summit in Egypt on Monday to ask Prime Minister Shehbaz Sharif to say a few words, with the Pakistani leader repeating Trump’s claim about having stopped hostilities between India and Pakistan in May and brokered a ceasefire.\n\nThough Trump praised a number of world leaders who were either on stage or in the audience at the conclusion of the Sharm El-Sheikh Peace Summit, including UK Prime Minister Keir Starmer, Turkish President Recep Tayyip Erdogan and Indonesian President Prabowo Subianto, Sharif was the only one he invited to speak in the middle of his own speech.\n\nTrump began by praising Pakistan Army chief Asim Munir, whom he described as his “favourite field marshal” and Sharif. He then turned to Sharif, who was standing behind him on stage, and said: “Would you like to say what you said [to me] the other day? I think it was so nice.”\n\nSharif stepped up to the lectern and described Trump as “a man of peace” who has worked to build a world with peace and prosperity. “I would say that Pakistan had nominated President Donald Trump for Nobel Peace Prize for his outstanding, extraordinary contributions, first to stop war between India and Pakistan and then achieve ceasefire along with his very wonderful team,” Sharif said, reiterating Trump’s repeated claims that he stopped hostilities between India and Pakistan in May.\n\n“And today again, I would like to nominate this great president for Nobel Peace Prize because I genuinely feel that he is the most genuine and most wonderful candidate for Peace Prize because he has brought not only peace in South Asia, saved millions of people, and today, here in Sharm-el-Sheikh, achieving peace in Gaza is saving millions of lives in the Middle East,” he said.\n\nSaluting Trump for his “exemplary leadership”, Sharif said the US president will be remembered as a man who stopped “eight wars”.\n\n“Suffice to say, had it not been for this gentleman…who knows. India and Pakistan are both nuclear powers. Had he not intervened along with this wonderful team, during those four days, the war could have escalated to a level who would have lived to tell what happened,” Sharif said.\n\nIndia has already dismissed Trump’s claims about brokering a ceasefire with Pakistan, and the matter had also figured in a phone call in June between Prime Minister Narendra Modi and Trump.\n\nForeign secretary Vikram Misri had said at the time that Modi told Trump during the phone call that the decision by India and Pakistan to halt military actions was made directly during talks between the armies of the two sides and without any mediation by the US. Despite this, Trump has persisted with his claims about halting the hostilities that began when India targeted terrorist infrastructure in Pakistan in retaliation for the Pahalgam terror attack in April.\n\nTrump had also announced the halting of military operations between India and Pakistan on social media before official statements issued by both countries. Sharif’s government subsequently nominated Trump for the Nobel Peace Prize for his purported efforts in stopping the hostilities. Since then, there has been a marked upswing in US-Pakistan ties, with Trump meeting Munir twice in the US.",
  "url": "https://www.hindustantimes.com/world-news/donald-trump-stops-speech-to-let-pakistan-pm-shehbaz-sharif-speak-at-middle-east-summit-101760430762668.html",
  "scraped_timestamp": "2025-10-14T14:46:49.137078",
  "content_length": 3260,
  "word_count": 541,
  "source_domain": "www.hindustantimes.com"
}