{
  "title": "Donald Trump vs Xi Jinping in yet another escalation over tariffs: ‘If the US continues…’",
  "content": "US PresidentDonald Trumpand Chinese leader Xi Jinping’s latest tit-for-tat showdown has both countries claiming the ball is now in the other’s court, with the clock ticking toward another escalation in import tariffs.\n\nAfter Trump signaled openness to doing a deal with Beijing, US Vice President JD Vance on Sunday declared the outcome would “depend on how the Chinese respond.” Hours later,China’sForeign Ministry made clear Beijing would take its cues from Washington’s next steps, after having already unleashed what it saw as retaliatory actions.\n\n“If the US continues on its wrong course, China will firmly take necessary measures to safeguard its legitimate rights and interests,” Foreign Ministry spokesman Lin Jian said at a regular briefing in Beijing. Chinese authorities haven’t yet retaliated to Trump’s threat to impose 100% tariffs over their latestrare-earthcurbs, while saying there could be “exemptions” in order to facilitate trade.\n\nTreasury Secretary Scott Bessent said Monday that he believes the Trump-Xi meeting “will still be on,” noting there had been “substantial communication over the weekend.” In the meantime, he expected US-China staff-level meetings this week, along with moves by the Trump administration to mobilize US allies to put pressure on Beijing, while also threatening “straight brute force countermeasures” if Beijing doesn’t act.\n\n“This is China versus the world,” Bessent said. “They have pointed a bazooka at the supply chains and the industrial base of the entire free world. And you know, we’re not going to have it.”\n\nThe S&P 500 closed 1.6% higher Monday, its best showing since May, as investors saw the back-and-forth as strategic posturing. China’s markets showed resilience to the turmoil, with the CSI 300 benchmark for onshore shares ending Monday down just 0.5%.\n\nWhile it’s hard to gauge who exactly has more leverage, what’s abundantly clear is China’s export sector can withstand US tariffs of around 50%, said Christopher Beddor, deputy China research director at Gavekal Dragonomics.\n\n“Beijing does care if the tariffs go past 100%, but as long as that scenario doesn’t materialize, tariffs are a lesser priority,” he added. “The rare-earth actions are intended to extract US concessions on tech export controls, but it’s also not in either side’s interest to completely derail the negotiations.”\n\nTrade data on Monday showed China’s shipments overseas growing at their fastest pace in six months, blunting the impact of any tariff hike from the US. Trump has other tools to inflict pain: He’s already threatened to thwart Beijing’s access to jet parts and stop selling China critical software.\n\nBessent, speaking on Fox Business Monday, said he expects to meet with his counterpart, Vice Premier He Lifeng, “in Asia” ahead of the Trump-Xi sitdown. Last month, before the current flap, he had indicated Frankfurt for the next round of talks aimed at extending a rolling 90-day truce that’s set to expire in early November. The conversations will likely lay the groundwork for concessions to resolve the latest flare up.\n\nUltimately, China believes it has the upper hand, said Josef Gregory Mahoney, a professor of international relations at Shanghai’s East China Normal University.\n\n“China is confident it’s better positioned than the US to absorb any shocks from the trade war,” he said. “Trump needs a deal before the holiday shopping and maybe even before the Supreme Court rules against him,” he added, referring to a pending decision on whether his tariffs are legal.\n\nWhen a trade truce between the US and China fell apart in May after Washington took fresh steps against Chinese national chip champion Huawei Technologies Co., Beijing imposed a blockade on its rare earth magnets critical to manufacturing everything from mobile phones to missiles. Trump responded by relenting on some export controls, marking a seismic change in Washington’s approach.\n\nIf the US doesn’t make similar concessions in this round then Xi could once again jam the flow of rare earths to the US, by slowing the license approval system it imposed earlier this year. Unwinding US curbs imposed for national security reasons would likely face opposition from China hawks in Washington, who — though not as prominent as in Trump’s first term — are still pushing for pursuing a harder line on Beijing.\n\nAdding to the incentive to keep talks on track, the Republican leader is under pressure from farmers in key voting states to find markets for US soybeans that Beijing won’t buy. Meanwhile, losing a deal previously agreed with Xi’s team to keep Chinese app TikTok online in the US would hinder his ability to connect with voters on the platform ahead of the 2026-midterms.\n\nXi’s framework for controlling its rare earths — which applies even to shipments by foreign firms overseas, under the latest rules — mirrors measures Washington has for years had in place on its cutting-edge semiconductors. While China once condemned those tactics as “long-arm jurisdiction,” now it appears to be playing the US at its own game.\n\n“Beijing might also be incorporating some of Trump’s signature negotiation tactics,” said Ting Lu, chief China economist at Nomura. That includes “extreme opening offers, exploiting leverage and opponents’ weaknesses and credible walk-away threats.”\n\nWu Xinbo, director at Fudan University’s Center for American Studies in Shanghai, said the US would need to scale back actions it took after last month’s phone call between Trump and Xi for the two men to hold their first meeting since 2019.\n\nIn recent weeks, the US has moved ahead with a deadline for imposing US port fees on Chinese ships and removed a Biden-era waiver allowing some of the world’s biggest chipmakers to keep operations in China.\n\n“If you want to go ahead with summit meeting, then you have to adjust your regulations, your policies,” said Wu. “If not — fine. We don’t beg for a summit meeting.”",
  "url": "https://www.hindustantimes.com/world-news/donald-trump-vs-xi-jinping-in-yet-another-escalation-over-tariffs-if-the-us-continues-101760423067473.html",
  "scraped_timestamp": "2025-10-14T15:11:26.814406",
  "content_length": 5934,
  "word_count": 951,
  "source_domain": "www.hindustantimes.com"
}