{
  "title": "‘Double standards’: Jaishankar says Ukraine and Gaza wars jeopardise food, energy security",
  "content": "External Affairs Minister SJaishankaron Thursday said that terrorism remains a \"persistent threat\" to development and stressed that the world must show neither tolerance nor accommodation to terrorist activities.\n\nAddressing theG20Foreign Ministers’ meeting atUnited Nations, Jaishankar said those who act against terrorists on any front render a \"larger service to the international community as a whole\".\n\nSpeaking on the correlation between international peace and global development, he said that in recent times, both deteriorated in parallel.\n\n\"A persistent threat to development is that perennial disruptor of peace - terrorism,\" he said, adding, \"It is imperative that the world display neither tolerance nor accommodation to terrorist activities.\"\n\nAs the world confronts conflict, economic pressures and terrorism, the limitations of multilateralism and the United Nations are visible, Jaishankar said.\n\n\"The need for reforming multilateralism has never been greater,” he said, adding that today, the international situation is both politically and economically volatile.\n\n“We as members of G20 have a particular responsibility to strengthen its stability and give it a more positive direction that is best done by undertaking dialogue and diplomacy, by firmly combating terrorism, and by appreciating the need for stronger energy and economic security.”\n\nSpeaking on peace and global development, he said ongoing conflicts, particularly in Ukraine and Gaza, have starkly demonstrated the costs, especially to the Global South, in terms of energy, food and fertiliser security.\n\n“Apart from jeopardising supplies and logistics, access and cost themselves became pressure points on nations. Double standards are clearly in evidence,” he said.\n\nJaishankar stressed that while peace enables development, threatening development cannot facilitate peace.\n\nHe said that making energy and other essentials more uncertain in an economically fragile situation helps no one, and called for moving the needle towards dialogue and diplomacy, \"not in the opposite direction towards further complications\".\n\nIn any conflict situation, there will be a few who have the ability to engage both sides and such countries can be utilised by the international community, both to achieve peace and to maintain it thereafter, he said.\n\n“So even as we attempt to address complex threats to peace, the value of encouraging a buy-in from those supportive of such goals should be appreciated,\" he said.",
  "url": "https://www.hindustantimes.com/india-news/double-standards-jaishankar-says-ukraine-and-gaza-wars-jeopardise-food-energy-security-101758822510039.html",
  "scraped_timestamp": "2025-09-26T00:55:58.209321",
  "content_length": 2485,
  "word_count": 363,
  "source_domain": "www.hindustantimes.com"
}