{
  "title": "ED restores  ₹175-cr worth assets to distressed homebuyers; SC praises its initiative",
  "content": "New Delhi, The Enforcement Directorate has restored flats, commercial units and plots worth₹175 crore to more than 200 homebuyers who had been waiting to get possession of their dream home for over 12 years, the agency said.\n\nThe unsold inventory of 354 flats, 17 commercial units and two plots belong to a project named Royal Rajvilas in Rajasthan's Udaipur.\n\nThe project's present market value is about₹175 crore, the ED said in a statement issued on Tuesday.\n\nThe case pertains to a money laundering investigation against an accused named Bharat Bomb, apart from some others, who are alleged to have cheated the Syndicate Bank to the tune of₹1267.79 crore between 2011 and 2016.\n\nThe ED had attached properties worth₹535 crore in this case in April, 2019 including assets of₹83.51 crore in the form of unsold/unregistered inventory of a company named Udaipur Entertainment World Private Limited .\n\nMultiple cases were filed against this attachment order and the company was later admitted for insolvency before the National Company Law Tribunal .\n\nThe resolution plan of the UEWPL was approved by the NCLT, Mumbai in February, 2022 as it also vacated the ED attachment order of April, 2019 .\n\n\"It is pertinent to mention that ED was not made a party in the proceedings before the NCLT,\" the agency said.\n\nLater, the matter went to the Rajasthan High Court and after multiple hearings it ordered that the ED had \"suffered\" in the case as it was not impleaded as a party in the proceedings before the NCLT.\n\nSoon after, the new management of UEWPL approached the Supreme Court challenging the Rajasthan HC order.\n\nThe apex court directed both parties to arrive at a consensus so as to \"protect\" the interest of the bona-fide homebuyers, who had invested their money in the project and could not get possession of their units/flats, due to aforesaid legal proceedings pending before different judicial forums, as per the ED.\n\n\"In view of the directions of the Hon'ble Supreme Court to protect the interest of the bona-fide homebuyers, the ED approached the Resolution Professional and new management of UEWPL seeking the details of all the homebuyers whose claims were admitted before the NCLT, Mumbai,\" it said.\n\nThe ED scrutinised the details of the homebuyers and submitted a 'No Objection Certificate' before the SC for restitution of the attached properties for benefit of bona-fide homebuyers except some of the assets.\n\nIt said the agency took \"proactive\" approach to arrive at a \"harmonious\" solution without compromising the objectives of the PMLA and in interest of the 213 homebuyers who were suffering due to the \"prolonged\" litigation.\n\nIn view of the affidavit made by the ED, the SC issued an order on October 10 \"wherein the attached properties, having a present market value of about₹175 crore now stand restituted under Section 8 of the PMLA to the Successful Resolution Applicant of Udaipur Entertainment World Private Limited for the sole benefit of the genuine and innocent homebuyers.\"\n\nThis, the ED said, brings to an end the the plight of 213 innocent homebuyers who had been suffering for more than 12 years after putting their hard earned money and the protracted litigation of over seven years between UEWPL and the ED.\n\n\"The Hon'ble Supreme Court has passed the order on the peculiar facts of the case without going into the merits and has also observed that this shall not be treated as a precedent and the questions of law shall remain open to be decided in an appropriate case,\" the ED said.\n\nThe SC lauded the role of the ED saying \"...we place on record our appreciation for the efforts made by the learned counsel for the parties and the DoE in restoring the attached properties to secure the interests of genuine and innocent home buyers.\"\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/ed-restores-rs-175-cr-worth-assets-to-distressed-homebuyers-sc-praises-its-initiative-101760503623942.html",
  "scraped_timestamp": "2025-10-15T11:03:27.387251",
  "content_length": 3868,
  "word_count": 645,
  "source_domain": "www.hindustantimes.com"
}