{
  "title": "EPF subscribers can now withdraw up to 100% funds. Step-by-step guide",
  "content": "With the new announcement by the union labour ministry, the subscribers of the Employees’ Provident Fund (EPF) scheme can now withdraw upto 100% of the funds from their accounts. The Employees’ Provident Fund Organisation (EPFO) manages the retirement savings of nearly 70 million salaried workers\n\nThe Central Board of Trustees (CBT), the apex decision-making body of EPFO, headed by Labour Minister Mansukh Mandaviya, took several path-breaking decisions during its meeting, news agency PTI reported.\n\nThe CBT decided to simplify the partial withdrawals of the EPF scheme by merging 13 complex provisions into a single, streamlined rule categorised into three types, namely, Essential Needs (illness, education, marriage), Housing Needs and Special Circumstances.\n\nTo enhance the Ease of Living of EPF members, the CBT decided to simplify the partial withdrawal provisions of the EPF Scheme by merging 13 complex provisions into a single, streamlined rule categorised into three types, namely, Essential Needs (illness, education, marriage), Housing Needs and Special Circumstances.\n\nNow, members will be able to withdraw up to 100 per cent of the eligible balance in the Provident Fund, including employee and employer share.\n\nHere is how you can withdraw funds from your PF account\n\nStep 1: Log on to your UAN portal with your account number and password. Enter the captcha and click on “Sign in” button.\n\nStep 2: Next, on the ‘Manage tab’, click on KYC to see if all your details such as Aadhaar, PAN and bank details are verified.\n\nStep 3: After the KYC details are verified, click on the ‘Online Services’ tab and select the option ‘Claim (Form-31,19,10C&10D)’ from the drop-down menu.\n\nStep 4: Then enter your bank account number and click on ‘Verify’.\n\nStep 5: Click on ‘Yes’ to sign the certificate of the undertaking and then proceed.\n\nStep 7: Under ‘I Want To Apply For’ on the claim form, select the claim you require, i.e. full EPF settlement, EPF part withdrawal (loan/advance) or pension withdrawal.\n\nStep 9: Then, select ‘PF Advance (Form 31)’ to withdraw your fund. Further, provide the purpose of such advance, the amount required and the employee’s address.\n\nStep 10: Click on the certificate and submit your application.\n\nThe requirement for minimum service has been uniformly reduced to only 12 months for all partial withdrawals.\n\nEarlier, under ‘Special Circumstances,’ the member was required to clarify the reasons for partial withdrawals viz. natural calamity, lockouts/closure of establishments, continuous unemployment, outbreak of epidemic, etc.",
  "url": "https://www.hindustantimes.com/india-news/epf-subscribers-can-now-withdraw-up-to-100-funds-step-by-step-guide-101760427013699.html",
  "scraped_timestamp": "2025-10-14T15:36:41.863502",
  "content_length": 2575,
  "word_count": 401,
  "source_domain": "www.hindustantimes.com"
}