{
  "title": "Explained: Is Musk's Starlink fuelling Myanmar scam centres? Why US Congress launched probe",
  "content": "Starlink, the satellite communication firm owned by Elon Musk, is under a big investigation in the United States, reportedly over the alleged use of the satellites by scam centres operating in Myanmar. Despite a crackdown on these scam centres months ago, rapid construction reportedly resumed at compounds near the Thailand–Myanmar border within weeks.\n\nAccording to news agency AFP, the centres are now using Starlink satellite internet service from Elon Musk on a massive scale, and flocks of these dishes were seen in visuals shared by the news agency as part of an exclusive probe. This was after Thailand cut off internet and power connections.\n\nIn July 2024, several Californian prosecutors had reportedly warned Musk's Starlink that its satellites were being used by the fraudsters. However, the US Congress Joint Economic Committee has now launched a probe into Starlink's alleged involvement in the scam centres' operations, reported AFP.\n\nEarlier, several American and Thai leaders had raised concerns over the running of the fraud centres to Elon Musk. In July this year, senator Maggie Hassan had also cited the use of the satellite service in operating \"scam compounds\" in Southeast Asia.\n\n\"Scam networks in Myanmar, Thailand, Cambodia, and Laos, however, have apparently continued to use Starlink despite service rules permitting SpaceX to terminate access for fraudulent activity,\" Hassan wrote in a letter to Musk, news agency Reuters had reported.\n\nHowever, there was no official response from Starlink or SpaceX on that front.\n\nHundreds of thousands of foreign nationals from Asia, Africa and elsewhere were were pulled out of these fraud factories in February this year. They had been trafficked into working for these illegal centres over many years.\n\nThe issue found international spotlight after the abduction of Chinese actor Wang Xing, who was kidnapped after arriving in Thailand in January. He was later located across the border in Myanmar, and rescued.\n\nIndians were also among the workers who were pulled out of these fraud compounds. Six youths from Bihar were rescued from a cyber fraud hub in Myawaddy in February. They fell prey to an international job scam, after being lured with lucrative employment opportunities.\n\n\"I was offered a job in Thailand by a Nepali citizen, Dharmendra Choudhary, who promised me an annual salary of₹12 lakh. On January 15, Dharmendra and Jitendra Choudhary (both Nepali citizens) facilitated my travel to Bangkok via Kolkata and then to Myanmar on a ‘work visa’,\" Sachin Kumar Singh, an engineer, had said.\n\nHe also reported assault by armed men who took him hostage in Myanmar, and said that he was asked to pay₹5 lakh if he wished to leave.\n\nFollowing the huge crackdown on scam centres along the border in Myanmar in February, Thailand halted electricity, internet, and fuel supplies to five Myanmar border areas, including Myawaddy.\n\nIt was expected that this would deal a huge blow to the fraud factories, but they are reportedly still blooming. New office and dormitory blocks are reportedly rising across many of the roughly 27 scam centres in Myawaddy.\n\nFlocks of Starlink satellite dishes are reportedly covering the compounds that emerged only weeks after the crackdown. According to AFP, 80 Starlink dishes are visible on one roof alone in KK Park, as per satellite images accessed.\n\nStarlink is not licensed in Myanmar and wasn't even part of the list of internet service providers in the country before February this year. However, it is now the clear frontrunner, holding the top spot every day from July 3 to October 1, as per data from Asian regional internet registry APNIC.\n\nThese scam centres have duped Chinese and American victims out of billions of dollars. According to accounts of trafficked workers now freed, workers at the scam compounds were given detailed scripts on how to bait their targets, usually in the US.\n\nThe victims were targeted with unsolicited messages, and in some cases a romantic guise was also reportedly used to lure them. Workers adopted the persona of \"Abby\", a lovesick 35-year-old Japanese woman, in order to build a romantic rapport with the target, AFP reported, citing a 25-page text.\n\n\"Almost everyone inside had been beaten at some point... either for refusing to work or trying to get out,\" Sun, a rescued Chinese national, told AFP. He recalled how him and other workers trapped there with him were repeatedly beaten with electric rods and whips. He said he was abducted, brought to to a militia camp and sold for 650,000 Thai baht ($20,000) to a scam centre.",
  "url": "https://www.hindustantimes.com/world-news/explained-is-musks-starlink-fuelling-myanmar-scam-centres-why-us-congress-launched-probe-101760423619862.html",
  "scraped_timestamp": "2025-10-14T15:28:23.807327",
  "content_length": 4583,
  "word_count": 744,
  "source_domain": "www.hindustantimes.com"
}