{
  "title": "'Factually incorrect, baseless': India dismisses NATO boss remarks on Modi-Putin phone call",
  "content": "India on Thursday dismissed the remarks made by NATO chief Mark Rutte on a purported conversation between Prime Minister Narendra Modi and Russian President Vladimir Putin on the latter's Ukraine stance, terming it “factually incorrect and entirely baseless”.\n\nNATO secretary-general Mark Rutte earlier claimed that US President Donald Trump's tariffs on India are indirectly affecting Russia.Rutte claimed that NewDelhi has been in contact with Moscow, with PM Modi urging Putin to clarify his position on Ukraine.\n\n\"Delhi is on the phone with Putin, and Narendra Modi is asking him to explain his strategy on Ukraine because India is being hit with tariffs,\" Rutte told CNN.\n\nMinistry of External Affairs (MEA) spokesperson Randhir Jaiswal, during a weekly press briefing, said, “We have seen the statements made by NATO chief Mark Rutte regarding a purported phone call between Prime Minister Modi and Russian President Vladimir Putin, and let me be clear, this statement is factually incorrect and entirely baseless.”\n\n“At no point has PM Modi spoken with President Putin in the manner suggested. No such conversation has taken place,” Jaiswal added.\n\nThe MEA spokesperson further said that India expects the leadership of an important and esteemed institution like NATO to “exercise greater responsibility and accuracy in public statements”.\n\n“Speculative or careless remarks that misrepresent the Prime Minister's engagements or suggest conversations that never occurred are unacceptable,” Jaiswal stated.\n\nLast month, US President Donald Trump doubled the tariffs on Indian goods to 50 per cent. He imposed an additional 25 per cent on the existing 25 per cent levy, saying that it was a penalty for New Delhi's Russian oil purchase.\n\nIn light of the conversation surrounding India and Russia ties, and Trump's tariffs, the MEA spokesperson reaffirmed that New Delhi's energy imports are meant to ensure predictable and affordable energy cost to the Indian consumer.\n\n“India will continue taking all necessary measures to safeguard its national interests and economic security,” Jaiswal added.\n\nMeanwhile, the trade talks between India and the US are on track, with Commerce Minister Piyush Goyal-led delegation being in New York for further discussions.\n\nFollowing a meeting with the visiting US delegation in New Delhi on September 16, the the commerce ministry stated that both sides agreed to push for an early and mutually beneficial conclusion of the bilateral trade agreement.",
  "url": "https://www.hindustantimes.com/india-news/factually-incorrect-baseless-india-dismisses-nato-boss-mark-rutte-remarks-on-modi-putin-phone-call-ukraine-plan-101758884096430.html",
  "scraped_timestamp": "2025-09-26T18:03:32.682484",
  "content_length": 2490,
  "word_count": 382,
  "source_domain": "www.hindustantimes.com"
}