{
  "title": "Family, locals hold candle march in UP, demand fair probe into NDA cadet's death",
  "content": "Bahraich , The family members of Antriksh Kumar Singh, a cadet found hanging at the NDA hostel in Pune, and the locals here held a candlelight march, demanding that the government conduct an impartial investigation into the death and provide justice.\n\nThe body of the first-year cadet was found hanging in his hostel room at the premier institute on October 10, with the police suspecting it to be a case of suicide, while his family members alleged that harassment by seniors drove him to take the extreme step.\n\nThe 18-year-old cadet's family members also expressed suspicion that he was murdered and have accused Maharashtra Police and the NDA administration of \"concealing facts.\"\n\nDuring the march in Sumerpur village on Monday evening, Antriksh's mother Seema Singh became emotional and said, \"I went to Pune 13 days ago, then he was absolutely fine. He had told me that a senior was torturing him, they were forcibly making him vomit by making him drink four jugs of water. Then a complaint was made to the academy officials, but we only got assurances.\"\n\nSpeaking to reporters, Seema Singh said that the academy and the police have not shown her the CCTV recordings.\n\nShe said, \"We kept asking them for the CCTV footage, but they kept postponing it. They told us the footage was with the police. When we went to the police, they said it was there . We ran from pillar to post until nightfall. Finally, we had to come to Bahraich without seeing the footage.\"\n\n\"They are calling it a suicide, but it's a murder. My son couldn't have committed suicide. How can we believe he committed suicide? He didn't go there to commit suicide; he went there to become something and serve the country,\" she asserted.\n\nAntriksh's younger brother, Abhinav, a Class 7 student, said that \"the room where he was staying had very high ceilings. He didn't know how to hang himself.\"\n\nThe academy said a court of inquiry has been ordered into the death.\n\nAccording to police, Antriksh's course mates saw him hanging in his room in the morning. No note was found at the spot, but preliminary findings suggest a possible case of suicide.\n\nHowever, Antriksh's family members alleged he was harassed by his seniors at the academy and they had raised the issue with the NDA authorities recently.\n\nHe was disturbed by the harassment and would say he wanted to discontinue his training at the academy, located on the outskirts of Pune city, the family claimed.\n\nAfter bringing Antariksh's body from Pune to Bahraich, the military officers of the Dogra Regiment performed his last rites with military honours in his native village on Sunday in the presence of hundreds of citizens, public representatives, police and administrative officials.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/family-locals-hold-candle-march-in-up-demand-fair-probe-into-nda-cadet-s-death-101760437173159.html",
  "scraped_timestamp": "2025-10-14T16:00:53.293216",
  "content_length": 2812,
  "word_count": 474,
  "source_domain": "www.hindustantimes.com"
}