{
  "title": "Finance",
  "content": "Odisha Chief Minister Mohan Charan Majhi has instructed officials to release government employees' salaries on September 26, ahead of the Durga Puja holidays starting September 27. This early disbursement aims to facilitate employees' festive preparations and shopping needs. The decision also encourages participation in the nationwide 'Savings Festival' following the implementation of GST 2.0 reforms.\n\nIn a major development poised to transform the industrial and agricultural landscape of Telangana, the state's Industrial Promotion Cabinet Sub-Committee has approved investments worth ₹3,745 crore from three multinational companies, expected to generate direct employment for 1,518 people.\n\nIn a move to reinforce fiscal prudence, the Ministry of Finance has instructed all central ministries, departments, and CPSEs to halt the practice of using public funds for Diwali and other festive gifts. This directive, issued by the Department of Expenditure, aims to curb non-essential spending and maintain financial discipline across governmental bodies, taking immediate effect.\n\nIndia's banking system liquidity surplus is poised to recover soon, analysts predict. Government spending and bond redemptions are expected to counteract the impact of recent tax outflows, which had reduced the surplus to its lowest level since late March. Further support will come from a phased reduction in the cash reserve ratio, beginning in early October.\n\nDivestment: The Indian government may accelerate its divestment program by selling minority stakes in about half a dozen state-run companies, focusing on value creation for small investors through OFS and IPOs. Insurance and defence sectors are likely to see increased activity.\n\nNew GST rates: India's GST 2.0 reform, effective September 22, simplifies tax slabs, potentially saving consumers ₹2 lakh crore. Households are already seeing price reductions in milk, ghee, medicines, and automobiles. This move, timed for the festive season, aims to stimulate demand, boost economic growth, and benefit both urban and rural markets by increasing disposable income.\n\nDigital gold purchases have surged in popularity, with UPI transactions increasing by 377% since April 2024, driven by rising gold prices and the convenience of online buying. The value of these purchases has more than doubled, reaching ₹1,184 crore in August.\n\nA Systematix Research report indicates that reduced GST rates could cost the government ₹1.2 trillion, potentially limiting capital expenditure and infrastructure credit demand. Double tariffs are weakening Indian exporters' competitiveness, while RBI's rate cuts are pressuring banks' net interest margins.\n\nThe Income-Tax Department has uncovered fraudulent exemption claims amounting to approximately ₹700 crore, prompting enhanced risk assessment in return processing. This has led to slower refund issuance, particularly for claims exceeding ₹10 lakh. Taxpayers are being notified to revise returns, contributing to a 24% decrease in refunds issued as of September 17.\n\nRBI Governor Sanjay Malhotra urged CCIL to develop infrastructure for currency pairs beyond USD-INR, supporting rupee internationalization. He also emphasized enhancing retail investor offerings in forex and government securities, aiming for a seamless customer experience. Malhotra highlighted India's pioneering role in anonymous electronic trading of government securities and repo transactions.\n\nCrisil said that the recent GST rate rationalisation is unlikely to burden the government fiscally, despite an estimated short-term loss of ₹48,000 crore. This loss appears insignificant compared to the previous fiscal's ₹10.6 lakh crore GST collections. The simplification to a two-rate structure could formalise more goods and services, boosting tax buoyancy.\n\nIndia's net direct tax collections saw a rise. The collections increased by 9.18% year-on-year. As of September 17, the collection reached ₹10.82 lakh crore. Advance tax payments grew, but at a slower pace. Gross collections also experienced an increase. The government issued refunds, but less than the previous year. Officials are optimistic about meeting the annual target.\n\nIndia's net direct tax collection saw a rise of 9.18% to over Rs 10.82 lakh crore between April 1 and September 17, driven by a significant 23.87% decrease in refunds. Gross tax collection increased by 3.39% to Rs 12.43 lakh crore, while advance tax collection grew by 2.90% to Rs 4.48 lakh crore during the same period.\n\nFinancial Services Secretary Nagaraju emphasized the critical need for a new investment cycle to propel economic progress, urging India Inc to leverage their strong balance sheets and increase investments. He highlighted the government's efforts in spending and policy reforms, while encouraging the financial sector to provide support.\n\nUnion Finance Minister Nirmala Sitharaman announced that recent GST reforms are projected to inject approximately Rs 2 lakh crore into the Indian economy, stimulating demand across various sectors.\n\nThe government has mandated cyber security audits for all cryptocurrency exchanges. This is due to the rise in cyber heists. These audits are essential for registration with the Financial Intelligence Unit. Crypto-related crimes now constitute a significant portion of cybercrime in India. The move aims to strengthen user safeguards.",
  "url": "https://economictimes.indiatimes.com/news/economy/finance",
  "scraped_timestamp": "2025-09-26T16:15:04.033720",
  "content_length": 5382,
  "word_count": 775,
  "source_domain": "economictimes.indiatimes.com"
}