{
  "title": "Fixed airfares till Dec 31: All about Air Alliance's ‘Fares se Fursat’",
  "content": "In a reprieve for flyers ahead of the holiday season, government-owned regional carrierAlliance Airhas launched an airfare scheme to stabilise the price of air tickets.\n\nThe initiative, under the banner of “Fares se Fursat” will be implemented on a pilot basis from October 13 -December 31, 2025 across select routes, to evaluate its operational feasibility and passenger response, news agencyPTIreported.\n\nHere is all you need to know about the Fares se Fursat scheme:\n\nIn India, the airfares keep fluctuating depending upon the demand and time of booking the tickets. For example, passengers flying in the same flight pay varying amounts, depending on the time of the booking. Generally, tickets booked well in advance are cheaper than the ones booked later.\n\nThe airfares usually skyrocket during the holiday season and year-end. With “Fares se Fursat”, you can book a ticket two weeks in advance or the morning of your travel, the fares will remain the same.\n\nIn its statement, Alliance Air said while effective for revenue management, it often causes passenger frustration due to unpredictable last-minute fares.\n\n\"Fares Se Fursat\" aims to address this long-standing challenge by introducing transparency and stability in pricing, it said.\n\n\"The 'Fares Se Fursat' scheme perfectly aligns with the core principles of the UDAN scheme. Today, Alliance Air is carrying forward Prime Minister Narendra Modi's vision of democratizing aviation and making it affordable for the middle class, lower-middle class and neo-middle class,\" Civil Aviation Minister Rammohan Naidu Kinjarapu said as he launched the scheme.\n\n\"The static fare system eliminates uncertainty and stress associated with fluctuating airfares, ensuring predictability of costs, even for last-minute bookings,\" the minister added.\n\nAlliance Air is a government-owned regional carrier, chaired by Amit Kumar with Rajarshi Sen as its CEO.\n\nAccording to the August DGCA monthly traffic numbers, Alliance Air flew a total of 37,000 passengers in the reporting month and held a 0.3 per cent share of the 1.29 crore passengers flown by all domestic carriers that month.\n\nThe airline had clocked a load factor of 68.7 per cent while its OTP was the lowest among the five airlines - IndiGo, Akasa, Air India Group and SpiceJet--at 55 per cent during August 2025, as per DGCA data.\n\nIt had eight aircraft in operations and 12 on ground of the total 20 in the fleet, as on October 11, as per aircraft fleet tracking website, Planespotter.",
  "url": "https://www.hindustantimes.com/india-news/fixed-airfares-till-dec-31-all-about-air-alliances-fares-se-fursat-101760420972820.html",
  "scraped_timestamp": "2025-10-14T14:54:56.670985",
  "content_length": 2492,
  "word_count": 394,
  "source_domain": "www.hindustantimes.com"
}