{
  "title": "Foreign Trade",
  "content": "America seeks global backing against China's rare earth export curbs. Treasury Secretary Scott Bessent expects support from India and European democracies. China's actions are seen as provocative. Former President Donald Trump previously threatened tariffs. China dominates rare earth mining and processing. The US has imposed tariffs on India.\n\nIndian exports of key goods to the United States saw a significant drop in August. Labour-intensive products like textiles, leather, and jewellery experienced a downturn. This follows the imposition of tariffs by Washington on New Delhi. Shipments of marine products, tyres, and garments also declined. Even kitchen staples like tea and spices faced reduced exports.\n\nIndia and Taiwan have asked the WTO to postpone a decision on import duties until April 2026. Both nations are working to resolve the issue through talks. This delay aims to facilitate a mutual agreement. The WTO's dispute settlement body will consider this request soon. The ruling concerns duties on certain information and technology products.\n\nIndia's mobile phone exports surged by 95% year-on-year in September, reaching over $1.8 billion despite a historically lean period. For April-September, exports hit $13.5 billion, with the US being the largest destination, accounting for nearly 70% of the total. This growth highlights India's strengthening mobile manufacturing ecosystem and global reliability.\n\nBrazil's Ambassador welcomed India's potential ethanol exports, emphasizing its role in making ethanol a global commodity. The two nations are deepening bioenergy cooperation, focusing on sustainable aviation fuel and higher ethanol blending targets, with Brazil sharing its extensive experience in ethanol integration.\n\nStarting October 29, 2025, meat exporters will be required to contribute to the newly established Meat Export Development Fund, which will include both chilled and frozen products. The Agricultural and Processed Food Products Export Development Authority (APEDA) oversees this initiative, underlining the importance of animal product exports in India's agricultural landscape, which generated a remarkable USD 4.\n\nIndia's mobile phone exports surged 95% year-on-year to over $1.8 billion in September 2025, with April-September exports reaching $13.5 billion, a 60% increase. The US emerged as a key destination, accounting for nearly 70% of total exports. Projections indicate a rise to $35 billion in FY2025-26.\n\nIn a significant move, India has initiated an investigation into the rising influx of chemical products from South Korea. A local enterprise argues that these imports, which thrive on advantages from a free trade agreement, are threatening the livelihoods of domestic producers. The inquiry will determine whether the spike in imports, driven by tariff reductions, inflicts substantial harm.\n\nIndia, a major edible oil importer, faces price volatility due to frequent tariff changes. A new study urges a stable, multi-year tariff policy. This will help control prices, boost investment, and benefit consumers. The recommendations aim to create predictability for suppliers and refiners. Focusing on palm oil tariffs is key to market stability and reducing import reliance.\n\nCanada is seeking to diversify its trade and strategic partnerships, particularly with India, to mitigate economic pressures from the United States and China. Foreign Minister Anita Anand is leading efforts to strengthen ties with India, focusing on trade, technology, energy, and security, aiming for a more stable economic future.\n\nIndian textile exporters are diversifying to the EU market and offering discounts to U.S. customers to counter steep tariffs. With trade talks between India and the EU in a decisive phase, exporters are upgrading facilities to meet EU standards and reduce reliance on the U.S., their largest market. Some companies face potential job losses and consider relocating production if U.S.\n\nThe Reserve Bank of India has amended FEMA regulations, allowing exporters to hold foreign exchange proceeds in Gujarat's Gift City for up to three months. This move provides operational relief and greater flexibility in repatriating funds, aligning with USD-INR trends. Previously, funds had to be repatriated by the end of the following month.\n\nIndian trade negotiators are heading to the US this week for talks on a bilateral trade agreement, with both sides hopeful of concluding the first phase by year-end. Discussions are progressing positively, and New Delhi may also increase natural gas purchases from the US to address the trade gap.\n\nIn New Delhi, External Affairs Minister Dr. S. Jaishankar and Canadian Foreign Minister Anita Anand held a landmark meeting, signalling a major reset in India–Canada relations. Both leaders agreed to “rebuild trust” and strengthen cooperation across key areas including trade, critical minerals, AI, energy, and security dialogue. Jaishankar said the two nations seek to ‘de-risk the international economy by forging strong partnerships of growing range and depth.’ The talks mark a constructive new chapter after months of diplomatic strain.\n\nIndia and Canada have agreed on a new roadmap for bilateral relations following talks between their foreign ministers in New Delhi. Canadian Foreign Minister Anita Anand's visit aims to reset ties, with discussions focusing on enhanced cooperation in trade, energy, technology, agriculture, and people-to-people connections.\n\nIndia and the US are nearing a trade deal, with optimism high for a fall conclusion. A delegation heads to Washington this week to finalize market access, energy, and tech trade. Simultaneously, India's Free Trade Agreement talks with the EU are progressing, though carbon adjustment and sector-specific issues remain. These efforts bolster India's global economic strategy.",
  "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade",
  "scraped_timestamp": "2025-10-15T10:30:15.022656",
  "content_length": 5846,
  "word_count": 859,
  "source_domain": "economictimes.indiatimes.com"
}