{
  "title": "Foreign Trade",
  "content": "India and the US held constructive trade talks, but disagreements over India's Russian oil purchases are hindering progress. The US is pressuring India to reduce its reliance on Russian energy, while India is offering concessions like increased purchases of American goods and easing restrictions on genetically modified corn.\n\nLed by Minister Piyush Goyal, an Indian delegation engaged in productive discussions with US officials in Washington, exploring the potential framework for a bilateral trade agreement. Both sides aim for a mutually beneficial agreement and will continue discussions. U.S. businesses and investors expressed strong confidence in India's growth and interest in expanding their activities there.\n\nNew US tariffs may heavily impact European pharmaceutical imports. These tariffs target branded and patented drugs. India might be less affected due to its focus on generic medicines. However, the treatment of branded generics remains uncertain. Major pharma companies are investing heavily in US manufacturing. Roche, Novartis, and others pledge over USD 350 billion.\n\nHungary, a NATO member, significantly relies on Russian oil, sourcing over 80% of its crude from Moscow, a move that has drawn criticism from Brussels and Washington. Despite EU efforts to phase out Russian fossil fuels, Hungary maintains its dependence, citing Soviet-era infrastructure and energy security concerns.\n\nTrump tariffs: US President Donald Trump on Thursday announced a new wave of steep tariffs on a wide range of imported goods, including a 100% duty on branded drugs and 25% tariffs on heavy-duty trucks, set to take effect next week.\n\nTo operationalize the GST Council's decision for 90% upfront refunds to exporters, a legal amendment is needed. The current GST Act lacks provisions for risk-based provisional refunds, especially for industries with inverted duty structures. An ordinance is being considered to expedite the process, with the law committee examining the required changes and defining \"risky taxpayers.\"\n\nIndia made a massive purchase of soyoil from Argentina. The purchase occurred over two days. This is the largest such purchase ever. Argentina scrapped export taxes, leading to the deal. The move may impact palm oil shipments from Indonesia and Malaysia. The soyoil is for shipment between October and March. This deal highlights the impact of Argentina's policy change.\n\nThe leather industry in Tamil Nadu and other Indian states faces a crisis. US tariffs have led to factory closures and job losses. Exporters struggle as orders decline and goods remain stuck. Workers face unpaid leave and financial hardship. The government is urged to provide support. Companies consider relocating to countries with lower tariffs.\n\nNarendra Modi has reinforced India's robust alliance with Russia. This happened despite the US urging a reduction in engagement. Modi highlighted defense ties and a joint venture for AK-203 rifles. India has maintained a stable partnership with Moscow for decades. Tensions with the US have risen due to tariffs and trade frictions. India plans to continue buying Russian energy.\n\nA Lowy Institute report reveals China's growing dominance in Southeast Asia, surpassing the U.S. in overall influence. Beijing leads in economics and diplomacy, becoming the primary partner for six nations. While the U.S. maintains defense and cultural strengths, Trump-era policies have weakened its economic and diplomatic presence.\n\nDespite trade disputes and concerns over Russian oil imports, the US and India navigate a period of diplomatic friction. High-level engagements, including Secretary Rubio's meeting with Minister Jaishankar and a positive phone call between Presidents Trump and Modi, highlight the relationship's importance. The US emphasizes a commitment to expanding cooperation, viewing India as a crucial partner.\n\nSouth Asia analyst Michael Kugelman has highlighted the importance of trade talks between India and the United States, stating that a potential trade deal could serve as a major confidence-building measure and help stabilise the bilateral relationship while easing tensions.\n\nIndia and the European Union's 13th round of FTA negotiations in Delhi saw limited progress, particularly in automotive and agricultural sectors. While advancements were made in rules of origin and investment, key disagreements persist in agriculture, chemicals, and automotive standards. The EU highlighted the need for high-level interventions to bridge the gap, with the next round scheduled in Brussels.\n\nIndia is ratifying the WTO Agreement on Fisheries Subsidies, advocating for stricter rules for nations historically providing high subsidies. New Delhi emphasizes 'precise' special treatment for developing countries and calls for balanced disciplines promoting sustainability. It seeks subsidy calculations on a per capita basis and a 25-year exemption to protect its small-scale fishers.\n\nFood Minister Pralhad Joshi stated the government will consider easing wheat product export restrictions after assessing the planting and production outlook for the season. The flour milling industry requested permission to export up to 1 million tonnes of processed wheat products. The government will evaluate availability and food security before making any decisions regarding export liberalization.\n\nThe United States aims to boost energy ties with India. This includes natural gas, coal, nuclear energy, and clean cooking fuels. US Energy Secretary Chris Wright praised India as a \"star\" in clean cooking fuels. He highlighted India's growing energy needs and economic dynamism. The US seeks increased energy trade and collaboration with India.",
  "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade",
  "scraped_timestamp": "2025-09-26T16:17:12.995156",
  "content_length": 5698,
  "word_count": 837,
  "source_domain": "economictimes.indiatimes.com"
}