{
  "title": "Foreign Trade",
  "content": "To operationalize the GST Council's decision for 90% upfront refunds to exporters, a legal amendment is needed. The current GST Act lacks provisions for risk-based provisional refunds, especially for industries with inverted duty structures. An ordinance is being considered to expedite the process, with the law committee examining the required changes and defining \"risky taxpayers.\"\n\nIndia made a massive purchase of soyoil from Argentina. The purchase occurred over two days. This is the largest such purchase ever. Argentina scrapped export taxes, leading to the deal. The move may impact palm oil shipments from Indonesia and Malaysia. The soyoil is for shipment between October and March. This deal highlights the impact of Argentina's policy change.\n\nThe leather industry in Tamil Nadu and other Indian states faces a crisis. US tariffs have led to factory closures and job losses. Exporters struggle as orders decline and goods remain stuck. Workers face unpaid leave and financial hardship. The government is urged to provide support. Companies consider relocating to countries with lower tariffs.\n\nNarendra Modi has reinforced India's robust alliance with Russia. This happened despite the US urging a reduction in engagement. Modi highlighted defense ties and a joint venture for AK-203 rifles. India has maintained a stable partnership with Moscow for decades. Tensions with the US have risen due to tariffs and trade frictions. India plans to continue buying Russian energy.\n\nA report indicates China's growing influence in Southeast Asia. It surpasses the United States in regional impact. China is a key partner for many nations. The US faces challenges due to past policies. China excels in economics and diplomacy. The US maintains strength in defense. Southeast Asian countries are managing these shifts.\n\nDespite trade disputes and concerns over Russian oil imports, the US and India navigate a period of diplomatic friction. High-level engagements, including Secretary Rubio's meeting with Minister Jaishankar and a positive phone call between Presidents Trump and Modi, highlight the relationship's importance. The US emphasizes a commitment to expanding cooperation, viewing India as a crucial partner.\n\nSouth Asia analyst Michael Kugelman has highlighted the importance of trade talks between India and the United States, stating that a potential trade deal could serve as a major confidence-building measure and help stabilise the bilateral relationship while easing tensions.\n\nIndia and the European Union's 13th round of FTA negotiations in Delhi saw limited progress, particularly in automotive and agricultural sectors. While advancements were made in rules of origin and investment, key disagreements persist in agriculture, chemicals, and automotive standards. The EU highlighted the need for high-level interventions to bridge the gap, with the next round scheduled in Brussels.\n\nIndia is ratifying the WTO Agreement on Fisheries Subsidies, advocating for stricter rules for nations historically providing high subsidies. New Delhi emphasizes 'precise' special treatment for developing countries and calls for balanced disciplines promoting sustainability. It seeks subsidy calculations on a per capita basis and a 25-year exemption to protect its small-scale fishers.\n\nFood Minister Pralhad Joshi stated the government will consider easing wheat product export restrictions after assessing the planting and production outlook for the season. The flour milling industry requested permission to export up to 1 million tonnes of processed wheat products. The government will evaluate availability and food security before making any decisions regarding export liberalization.\n\nThe United States aims to boost energy ties with India. This includes natural gas, coal, nuclear energy, and clean cooking fuels. US Energy Secretary Chris Wright praised India as a \"star\" in clean cooking fuels. He highlighted India's growing energy needs and economic dynamism. The US seeks increased energy trade and collaboration with India.\n\nThe UAE-India Business Council has forged strategic agreements to enhance trade and investments between the two nations. These agreements aim to strengthen institutional collaboration, deepen cooperation in key service sectors, and facilitate CEPA implementation at the grassroots level. These initiatives are expected to unlock new opportunities and redefine global trade flows.\n\nIndia and Australia have formalized a mutual recognition arrangement (MRA) to streamline trade in organic goods. This agreement facilitates the acceptance of each other's organic standards and certification systems, encompassing items like wine and agricultural produce. The initiative aims to reduce trade barriers, ensure certification equivalence, and boost India's organic exports.\n\nThe government has restricted silver and unstudded jewellery imports until March 31, 2026. This action follows a surge in silver imports, especially from Thailand. Officials suspect duty evasion under the Asean-India Trade Agreement. Separately, non-basmati rice exports now require contract registration with APEDA. India's rice exports increased by 6.4% during April-August of FY26.\n\nThe government has imposed import restrictions on certain silver jewellery until March 31, 2026, to curb imports from Thailand under the guise of unstudied jewellery. The Directorate General of Foreign Trade (DGFT) amended the policy from free to restricted, requiring importers to obtain a government licence for these goods.\n\nIndia's smartphone exports surged 39% year-on-year to $1.53 billion in August 2025, with exports to the US doubling to $965 million. ICEA refuted claims of slowing exports, attributing the dip to new model introductions, plant retrofitting, and increased domestic demand during the festive season. The industry body cautioned against oversimplifying trade data based on monthly comparisons.",
  "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade",
  "scraped_timestamp": "2025-09-26T00:33:42.795551",
  "content_length": 5926,
  "word_count": 857,
  "source_domain": "economictimes.indiatimes.com"
}