{
  "title": "Foreign Trade",
  "content": "India and Canada are discussing ways to boost economic ties. Ministers Piyush Goyal and Maninder Sidhu explored new trade opportunities in clean technology, AI, agriculture, and critical minerals. This comes after past trade agreement negotiations were paused. Discussions aim to build on mutual respect and trust. India's exports to Canada saw an increase in the last fiscal year.\n\nIndia's historic trade milestone with the EFTA nations, including Switzerland, Norway, Iceland, and Liechtenstein, officially commenced on October 1, 2025. This landmark agreement promises USD 100 billion in investments and one million jobs over fifteen years, fostering growth in key sectors and facilitating skilled worker mobility.\n\nThe US-China trade war is expected to boost Indian exports to the US, experts say. Higher US tariffs on Chinese goods, rising to 130% from November 1, 2025, make Chinese products less competitive, benefiting Indian exporters, especially in textiles, toys, and other sectors. India exported $86 billion to the US in 2024-25, its largest trading partner.\n\nUS tariffs on Chinese goods will rise 100% from November 1, 2025, pushing up prices for EVs, wind turbines, and semiconductor parts, says GTRI. The escalation heightens US-China trade tensions and may force Washington into negotiations over rare earths.\n\nIndia and Brazil are strengthening trade ties and exploring ways to boost bilateral trade and investment, particularly in response to increased US import tariffs. Discussions under the India-Brazil Trade Monitoring Mechanism focused on expanding preferential trade agreements and enhancing collaboration in key sectors like pharmaceuticals and chemicals.\n\nIndian steel exporters face significant challenges from upcoming European Union tariffs and reduced duty-free import quotas. These measures threaten to make Indian steel uncompetitive in the EU market. Industry representatives are urging that the India-EU free trade agreement negotiations prioritize addressing these steel-related concerns.\n\nThe Union Cabinet will soon discuss a new Export Promotion Mission. This mission aims to strengthen India's export sector. It will provide targeted financial and market support. The focus is on MSMEs and labour-intensive industries. The mission will help exporters gain a competitive edge globally. It addresses both financial and non-financial challenges faced by exporters.\n\nIndia and the UK have forged a strategic partnership at India Mobile Congress 2025, pledging £24 million over four years to drive digital connectivity innovation. The India-UK Connectivity and Innovation Centre (CIC) will foster collaboration between researchers, innovators, and businesses, focusing on telecommunications, cybersecurity, and AI's role in transforming the sector.\n\nThe government has mandated registration on a renewable energy equipment import monitoring system for importers of solar and wind energy components, effective November 1. This applies to items like photovoltaic cells and wind turbine parts. Separately, imports of Sulfadiazine API below Rs 1,774 per kg are restricted until September 30, 2026, with exemptions for certain entities.\n\nIIT(ISM) Dhanbad, in collaboration with the University of Cambridge and TEXMiN, has established a Critical Minerals Supply Chain Satellite Observatory. This initiative, part of the UK-India Critical Minerals Supply Chain Observatory, will utilize advanced technologies to enhance India's capabilities in mineral traceability, sustainability, and resource mapping, fostering a globally resilient ecosystem.\n\nAfghan Foreign Minister Amir Khan Muttaqi announced that Kabul will send diplomats to India to improve bilateral relations. He assured New Delhi that Afghan soil will not be used for activities detrimental to India's interests. This comes after extensive talks with External Affairs Minister S Jaishankar.\n\nChina has intensified its control over rare earth exports, affecting industries worldwide. India faces supply challenges, particularly for electric vehicles and electronics. New Delhi is actively pursuing global partnerships and domestic solutions. Efforts are underway to develop alternative technologies and reduce reliance on Chinese supplies. But China's leverage is just too much.\n\nTatarstan aims to boost economic ties with India, positioning itself as a gateway to the Russian market for Indian businesses. The region seeks to increase exports of its products while inviting Indian investment in sectors like IT and pharmaceuticals. India's opening of a consulate in Kazan underscores the growing bilateral cooperation and potential for expanded trade and academic exchange.\n\nIndia's trade reliance on the US grew slightly. Global trade remains strong, driven by developing nations, even with US policy changes. Electronics and electric vehicles are boosting trade. While global trade is projected to hit new records, ongoing geopolitical tensions and US policy uncertainty pose risks to the outlook.\n\nBritain welcomes 64 Indian investment projects totaling 1.3 billion pounds. These deals, announced during PM Keir Starmer's Mumbai visit, will create 6,900 new jobs across the UK. Investments span electric vehicles, semiconductors, agri-tech, and AI. The UK-India trade deal is already boosting investor confidence and unlocking growth. This collaboration marks a new era for bilateral economic partnership.\n\nPrime Minister Narendra Modi announced that India and the UK are set to exceed their $112 billion bilateral trade target before 2030. Speaking at the India-UK CEO Forum, Modi highlighted the newly signed trade pact as a vision for shared progress and prosperity, reflecting growing economic convergence between the two nations.",
  "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade",
  "scraped_timestamp": "2025-10-11T23:45:44.544143",
  "content_length": 5728,
  "word_count": 817,
  "source_domain": "economictimes.indiatimes.com"
}