{
  "title": "Foreign Trade",
  "content": "Canada is seeking to diversify its trade and strategic partnerships, particularly with India, to mitigate economic pressures from the United States and China. Foreign Minister Anita Anand is leading efforts to strengthen ties with India, focusing on trade, technology, energy, and security, aiming for a more stable economic future.\n\nIndian textile exporters are diversifying to the EU market and offering discounts to U.S. customers to counter steep tariffs. With trade talks between India and the EU in a decisive phase, exporters are upgrading facilities to meet EU standards and reduce reliance on the U.S., their largest market. Some companies face potential job losses and consider relocating production if U.S.\n\nThe Reserve Bank of India has amended FEMA regulations, allowing exporters to hold foreign exchange proceeds in Gujarat's Gift City for up to three months. This move provides operational relief and greater flexibility in repatriating funds, aligning with USD-INR trends. Previously, funds had to be repatriated by the end of the following month.\n\nIndian trade negotiators are heading to the US this week for talks on a bilateral trade agreement, with both sides hopeful of concluding the first phase by year-end. Discussions are progressing positively, and New Delhi may also increase natural gas purchases from the US to address the trade gap.\n\nIn New Delhi, External Affairs Minister Dr. S. Jaishankar and Canadian Foreign Minister Anita Anand held a landmark meeting, signalling a major reset in India–Canada relations. Both leaders agreed to “rebuild trust” and strengthen cooperation across key areas including trade, critical minerals, AI, energy, and security dialogue. Jaishankar said the two nations seek to ‘de-risk the international economy by forging strong partnerships of growing range and depth.’ The talks mark a constructive new chapter after months of diplomatic strain.\n\nIndia and Canada have agreed on a new roadmap for bilateral relations following talks between their foreign ministers in New Delhi. Canadian Foreign Minister Anita Anand's visit aims to reset ties, with discussions focusing on enhanced cooperation in trade, energy, technology, agriculture, and people-to-people connections.\n\nIndia and the US are nearing a trade deal, with optimism high for a fall conclusion. A delegation heads to Washington this week to finalize market access, energy, and tech trade. Simultaneously, India's Free Trade Agreement talks with the EU are progressing, though carbon adjustment and sector-specific issues remain. These efforts bolster India's global economic strategy.\n\nAn Indian delegation is in the US for crucial trade talks this week. The visit aims to finalise a bilateral trade agreement, with both nations expressing satisfaction with progress. Discussions will focus on trade matters, excluding non-trade issues. This move signals a renewed push towards a mutually beneficial conclusion, potentially boosting trade to $500 billion by 2030.\n\nUS ambassador-designate Sergio Gor met with Commerce Secretary Rajesh Agrawal to discuss strengthening India-US economic ties and firming up a trade deal. The discussions followed Gor's meetings with top Indian officials, aiming to improve relations strained by recent US trade actions and visa policies.\n\nIndia is actively addressing over 65 non-tariff barriers impacting its marine and agricultural exports to Russia, aiming to reduce a significant trade deficit. Key concerns include obtaining approval for Indian marine product units for shrimp exports, a crucial step for diversifying shipments after US tariffs.\n\nAfghanistan's Foreign Minister Amir Khan Muttaqi has invited India to invest in the country's minerals, agriculture, and sports sectors. He also requested India to facilitate trade by opening the Wagah border, calling it the fastest trade route.\n\nIndia's merchandise trade deficit is projected to widen to $28.0 billion in September 2025, primarily due to a surge in gold imports driven by the festive season. A delay in the US-India trade deal also impacts exports. The deficit is expected to remain elevated, with ongoing trade talks offering a potential for future improvement.\n\nSwitzerland's Ambassador to India, Maya Tissafi, hailed the India-EFTA free trade agreement as a \"very important step\" after 16 years of negotiations. The Trade and Economic Partnership Agreement (TEPA), effective October 1, 2025, commits EFTA countries to invest $100 billion and create 1 million jobs in India over 15 years, marking a significant deepening of bilateral economic ties and cooperation.\n\nIndia and the UK have signed a free trade agreement. Experts believe this pact will significantly boost India's exports and attract British investments. The agreement is expected to provide duty-free market access for almost all Indian exports. It will also create wider opportunities for Indian service providers in the UK.\n\nIndia and Canada are discussing ways to boost economic ties. Ministers Piyush Goyal and Maninder Sidhu explored new trade opportunities in clean technology, AI, agriculture, and critical minerals. This comes after past trade agreement negotiations were paused. Discussions aim to build on mutual respect and trust. India's exports to Canada saw an increase in the last fiscal year.\n\nIndia's historic trade milestone with the EFTA nations, including Switzerland, Norway, Iceland, and Liechtenstein, officially commenced on October 1, 2025. This landmark agreement promises USD 100 billion in investments and one million jobs over fifteen years, fostering growth in key sectors and facilitating skilled worker mobility.",
  "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade",
  "scraped_timestamp": "2025-10-14T15:51:43.106692",
  "content_length": 5638,
  "word_count": 842,
  "source_domain": "economictimes.indiatimes.com"
}