{
  "title": "Former president Kovind to be chief guest at NHRC's 32nd anniversary function",
  "content": "New Delhi, The National Human Rights Commission has handled over 23 lakh cases, including 2,981 through suo motu cognisance in the last 32 years, the rights panel said on Tuesday.\n\nFormer president Ram Nath Kovind will be the chief guest at a function to be held at Vigyan Bhawan here on October 16 to mark the NHRC's 32nd anniversary.\n\nSince its inception on October 12, 1993, the NHRC has been advocating necessary policy reforms, people-centric governance and implementation and regular monitoring on the ground to ensure fairness, transparency and accountability in law enforcement, investigations and welfare schemes and programmes, the rights panel said.\n\nIn the last 32 years, the Commission has handled 23,79,043 cases, including 2,981 cases of suo motu cognisance . It has recommended monetary relief of more than₹263 crore in 8,924 cases to the victims of human rights violations. These cases include 73,849 complaints and 108 suo motu registered during the last one year October 1, 2024, to September 30, 2025, it said in a statement.\n\nFormer president Kovind will also deliver the inaugural address in the presence of NHRC Chairperson Justice V Ramasubramanian. NHRC members Justice Bidyut Ranjan Sarangi, Vijaya Bharathi Sayani and Priyank Kanoongo, and its Secretary General Bharat Lal and other senior officers of the Commission will also attend the ceremony.\n\nThe foundation day celebration provides an opportunity to reflect upon the Commission's journey and renew its commitment to protect and promote human rights, officials said.\n\nThe Commission will also organise a day-long national conference on 'Human Rights of Prison Inmates'. Various issues related to human rights and the well-being of prison inmates will be deliberated in different sessions.\n\nA range of stakeholders, including representatives from the relevant Union ministries and state governments, diplomats, academicians, researchers, legal luminaries, distinguished experts and members of civil society and human rights defenders, will participate in these sessions, it said.\n\nThe Commission has issued 31 advisories so far. These inter alia include on issues such as child sexual abuse material , rights of widows, people involved in begging, the Right to Food, Right to Health and mental health, rights of informal workers, upholding dignity of the dead, rights of truck drivers, environmental pollution and degradation, and ensuring welfare of transgender Persons.\n\nSome of the other important interventions of the Commission include recommending amendments to 97 laws that discriminate against persons with Hansen's disease, it said.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/former-president-kovind-to-be-chief-guest-at-nhrc-s-32nd-anniversary-function-101760436004255.html",
  "scraped_timestamp": "2025-10-14T15:52:51.097740",
  "content_length": 2717,
  "word_count": 410,
  "source_domain": "www.hindustantimes.com"
}