{
  "title": "From Akbar’s 'Septic Tank' remark to Lakshmi’s homophobic slur: A look at the major controversies of Bigg Boss Malayalam 7 so far",
  "content": "Halfway through its run, Bigg Boss Malayalam Season 7 has already become a hotbed of controversies. From personal attacks to socially sensitive remarks, several incidents inside the house have sparked heated debates both among housemates and viewers online. Here’s a roundup of the major controversies that have rocked the show in its first 50 days.\n\nDuring a task where contestants were asked to assign nicknames to each other, Akbar Khan called Renu Sudhi a “Septic Tank.” The comment visibly upset Renu, who openly expressed her disappointment. The incident triggered outrage on social media, with many viewers slamming Akbar for the offensive remark. In the weekend episode, host Mohanlal addressed the issue and instructed Akbar to seek Renu's forgiveness as a form of punishment.\n\nAryan came under fire for laughing during the emotional Oridathoridathu task while fellow contestant Shaitya shared a deeply personal story. He also stirred further controversy by throwing a slipper at co-contestant Abhilash. Mohanlal reprimanded Aryan for his conduct and directly nominated him for eviction as punishment.\n\nAryan again drew criticism during a weekend episode when he appeared irritated after being handed an egg-shaped cap reading “I am not a tiger, but a silly rat.” When Mohanlal asked contestants to continue wearing their assigned caps, Aryan mockingly asked, “Should I wear it while bathing?” followed by, “What about when we sleep?”The remarks irked Mohanlal, who asked sternly, “Are you trying to mock me? Is this a genuine question or are you mocking me?” The tension was palpable, and other contestants quickly attempted to defuse the situation. The clip went viral, with fans slamming Aryan for his perceived arrogance and disrespect.\n\nAnumol sparked controversy by accusing Aryan and Gizele of inappropriate behavior in bed. However, what drew more criticism was Anumol and Mastani’s decision to demonstrate the alleged behavior in the living area. The act was widely condemned, and Mohanlal publicly criticized both during the weekend episode for crossing the line.\n\nOne of the most talked-about moments this season was when contestant Lakshmi made homophobic remarks about fellow housemates Adhila and Noora, saying such people are not accepted in society or welcomed into homes. Mohanlal took a strong stand against the statement, saying:“I will welcome them into my home. Let them come to my home.”His response earned applause from both the housemates and the audience. Adhila and Noora were visibly moved, and Mohanlal praised them for their independence and courage, calling out Lakshmi’s prejudiced view.\n\nAnother serious allegation surfaced when Lakshmi accused Oneal of inappropriately touching Mastani during a task. Oneal vehemently denied the accusation. In the weekend episode, Mohanlal played the video footage of the incident, which proved Oneal’s innocence. Lakshmi subsequently apologized to Oneal for the false allegation.\n\nNavratri 2025: How to make Kaju Makhana Curry for fasting\n\nFrom bulldog to boxer: 10 dog breeds that make perfect pets\n\nWorld Tourism Day 2025: India’s top 10 eco-friendly escapes\n\n10 habits of graceful people that makes them naturally attractive\n\nFrom Maharashtra to Madhya Pradesh: Indian states starting with the letter ‘M’\n\nNavratri 2025: Bollywood-inspired ethnic looks in green for day 5\n\nAvneet Kaur’s Top 10 Gorgeous Looks to Take Style Inspiration From",
  "url": "https://timesofindia.indiatimes.com/tv/news/malayalam/from-akbars-septic-tank-remark-to-lakshmis-homophobic-slur-a-look-at-the-major-controversies-of-bigg-boss-malayalam-7-so-far/photostory/124158804.cms",
  "scraped_timestamp": "2025-09-26T18:04:10.888329",
  "content_length": 3419,
  "word_count": 524,
  "source_domain": "timesofindia.indiatimes.com"
}