{
  "title": "From ‘Hridayapoorvam’ to ‘Son of Sardaar 2’: Movies and series to watch on OTT this Friday",
  "content": "This Friday, OTT platforms are serving up a variety of new movies and web series. From emotional dramas to thrilling crime stories and fun comedies, there’s something for everyone. Whether you’re planning a weekend binge or a quiet movie night, these releases promise fresh stories and entertainment. Here’s a look at what’s coming to OTT.\n\n'Hridayapoorvam' is a Malayalam romantic drama starring Mohanlal, Malavika Mohanan, Sangita Madhavan Nair, and Sangeeth Prathap. The story follows Sandeep, a heart-transplant survivor, who attends his donor’s daughter Haritha’s engagement. An unexpected stay brings him closer to the family, and he slowly falls for Haritha. With its emotional story and strong performances, it’s a must-watch for romance fans. Streaming on JioCinema.\n\n'Sarkeet' is a Malayalam family drama about the challenges of work, marriage, and raising an ADHD child. A chance encounter with a weary stranger over 24 hours brings unexpected changes to the family. With relatable characters and heartfelt storytelling, the series beautifully captures family dynamics. Streaming on Manorama Max.\n\nThis crime drama follows Sub-Inspector Hemant Kumar as he investigates a headless corpse and missing gold in a jungle town in Chhattisgarh. The case grows more dangerous as a string of murders points to a possible serial killer. Starring Bhuvan Arora, Bhagwan Tiwari, Atul Kale, Amit Sharma, and others, the series keeps viewers on edge with its dark and thrilling story. Streaming on ZEE5.\n\nThe sequel to the 2018 hit 'Dhadak' continues the story of young love and societal challenges. Starring Siddhant Chaturvedi and Triptii Dimri, the film explores identity, power, and the cost of love. Directed by Shazia Iqbal, 'Dhadak 2' promises an emotional and gripping romantic drama. Streaming on Netflix.\n\nThe sequel to the comedy-action hit 'Son of Sardaar' returns with a fun new adventure. Jassi travels to Scotland to reconcile with his wife but gets caught in a mob conflict and a chaotic Sikh wedding. Starring Ajay Devgn, Mrunal Thakur, Ravi Kishan, and Sanjay Mishra, the film is packed with humor, action, and entertainment for a fun movie night. Streaming on Netflix.\n\nJamdani to Banarasi: New brides, celebrate your first Durga Puja in these Bengal fabrics\n\n8 legendary Durga temples to explore in India this Navratri\n\nSurvival of the fittest: 8 animals with the most bizarre defense mechanisms!​\n\nFalguni Pathak’s evergreen Navratri hits: From 'Payal chanake' to 'Kesariya rang'\n\nNavratri 2025: How to make Amaranth and Lauki ka Kofta for dinner",
  "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/from-hridayapoorvam-to-son-of-sardaar-2-movies-and-series-to-watch-on-ott-this-friday/photostory/124129524.cms",
  "scraped_timestamp": "2025-09-26T00:14:22.241667",
  "content_length": 2563,
  "word_count": 399,
  "source_domain": "timesofindia.indiatimes.com"
}