{
  "title": "From a mansion worth Rs 70 crore to a lavish farmhouse in Dehradun – Archana Puran Singh’s expensive properties and purchases",
  "content": "Archana Puran Singh, who won many hearts with her time on The Great Indian Kapil Show, is currently enjoying quality time with her family in Dehradun. She gave a glimpse of her 75-year-old farmhouse in Dehradun that left fans stunned. She also owns a mansion in Madh Island. Here’s a look at her expensive properties and purchases:\n\nArchana Puran Singh recently shared a vlog on her YouTube channel giving a glimpse of her 75-year-old ancestral home in Dehradun. Built by her late father, criminal lawyer Puran Singh, the house exudes a vintage vibe. With Kashmiri woodwork, a combined living-dining room furnished with decades-old items, and a 300-year-old tree planted by her great-grandfather, the house truly has character. Archana expressed her gratitude while giving a glimpse of the house.\n\nArchana and her husband, Parmeet Sethi, own a luxurious property comprising two massive bungalows in Madh Island, where they live with their family. The combined value of these bungalows is approximately Rs 70 crore. The interiors boast natural textures, wooden accents, and metallic details, blending luxury with nature. The property also features a lush garden adjoining their son Aaryamann’s residence.\n\nArchana Puran Singh boasts an impressive car collection featuring high-end models such as the Mercedes-Benz E-Class, Audi A8, BMW X5, Jaguar F-Pace, Range Rover Evoque, and Porsche Panamera. Her love for luxury vehicles is well-known, and she frequently showcases her rides on social media.\n\nArchana Puran Singh is known for her impeccable fashion sense, often donning luxurious clothing items from top designers. She frequently showcases her outfits on social media platforms, highlighting her preference for elegant and stylish attire. Her wardrobe includes a variety of ensembles suitable for different occasions, reflecting her sophisticated taste.\n\nArchana and Parmeet’s son, Aaryamann, recently got engaged to actress Yogita Bihani and is preparing to move into a new house in Madh Island. The couple shared glimpses of their soon-to-be home, showcasing its elegant white-and-gold-themed living room, a lush garden, and a spacious balcony offering serene views. Plans include renovating the space to create a larger workspace for music and content creation, incorporating areas like a vanity for Yogita, a studio, and leisure zones with games.\n\nBeyond her Madh Island bungalows, Archana and Parmeet have invested in other residential properties within Mumbai’s prime areas. These investments offer both high rental yields and long-term capital appreciation, allowing them to diversify their asset base while staying connected to the heart of India’s entertainment industry.\n\n7 things kids learn from parents without you realising\n\nKriti Sanon channels vibrant charm through her outfit\n\nJamdani to Banarasi: New brides, celebrate your first Durga Puja in these Bengal fabrics\n\n8 legendary Durga temples to explore in India this Navratri\n\nSurvival of the fittest: 8 animals with the most bizarre defense mechanisms!​",
  "url": "https://timesofindia.indiatimes.com/tv/news/hindi/from-a-mansion-worth-rs-70-crore-to-a-lavish-farmhouse-in-dehradun-archana-puran-singhs-expensive-properties-and-purchases/photostory/124112859.cms",
  "scraped_timestamp": "2025-09-26T16:42:20.049719",
  "content_length": 3025,
  "word_count": 458,
  "source_domain": "timesofindia.indiatimes.com"
}