{
  "title": "From hunger strike to FCRA cancellation: What led to Sonam Wangchuk's arrest",
  "content": "Two days after protests demanding sixth schedule inclusion for Ladakh turned violent, climate activist Sonam Wangchuk was arrested on Friday ahead of his reported press conference, which was scheduled for 2.30 pm.\n\nWangchuk, who has long been the face of non-violent activism in Ladakh, was previously detained during his \"Delhi Chalo\" protest in late 2024 but was later released.\n\nAlso Read |Internet suspended in Leh after activist Sonam Wangchuk's arrest\n\nHowever, Wangchuk's arrest today marks a dramatic escalation in the region's ongoing political standoff with the Centre. Here's a detailed timeline of Sonam Wangchuk's Ladakh movement, up until his arrest.\n\nClimate activist Sonam Wangchuk, along with 120 other activists from Ladakh, was detained at the Delhi border on September 30, 2024, as they attempted to march into the capital.\n\nAlso Read |Sonam Wangchuk, HIAL under scanner over alleged financial irregularities amid Ladakh 'Gen Z' protests\n\nHe was detained during his \"Delhi Chalo Padyatra\" march from Leh to New Delhi. Wangchuk was later released by the Delhi Police and allowed to visit Rajghat on October 2, 2024.\n\nSonam Wangchuk and other protesters from Ladakh, who were detained during their Padyatra, planned to sit on an indefinite fast from October 5 if they don't receive any response from the central government regarding their request to meet the President, the Prime Minister or the Union Home Minister.\n\nWangchuk ended his 16-day hunger strike on October 21, 2024, when the Home Ministry assured him of talks on his demands in December.\n\nHe described the fast as part of a \"peaceful Gandhian protest\" and said he would wait to meet with leaders.\n\nOn September 10, Sonam Wangchuk began a 35-day hunger strike at Shaheed Park in Leh. During this time, people from social organisations across the country arrived in Ladakh to support him, which led to protests across the Union Territory.\n\nThe protest in Ladakh turned violent on Wednesday, where protesters, primarily youth, pelted stones at the BJP office and the Hill Council in Leh and set a CRPF vehicle on fire.The central government blamed Wangchukfor this violence.\n\nLadakh activist Sonam Wangchuk announced on Thursday that he would quit his 15-day hunger strike in Leh soon after violent protests broke out over the statehood demand for Ladakh.\n\nSoon after the protest broke out, Wangchuk called for peace and urged people to stop the violence, saying that it damaged the cause.\n\nThe Union Home Ministry on Thursday also cancelled the FCRA licence of Students' Educational and Cultural Movement of Ladakh (SECMOL), founded by climate activist Sonam Wangchuk, with \"immediate effect\", a government order said.\n\nAfter the government's statement, Sonam Wangchuk was arrested on Friday. Wangchuck was supposed to address a press conference at 2:30 p.m. on Friday, but was arrested before he could talk to the media.\n\nHowever, the exact reason behind Wangchuk's arrest is yet to be confirmed by the authorities.",
  "url": "https://www.hindustantimes.com/india-news/from-hunger-strike-to-fcra-cancellation-what-led-to-sonam-wangchuks-arrest-after-ladakh-violence-a-timeline-101758884056494.html",
  "scraped_timestamp": "2025-09-26T18:03:31.131422",
  "content_length": 2995,
  "word_count": 476,
  "source_domain": "www.hindustantimes.com"
}