{
  "title": "From Anaya Bangar’s surrogacy plans to Anupam Mittal’s bold take on H1-B visa regulations: Top TV news",
  "content": "This week in the telly industry was filled with dramatic moments and shocking news. From Kiku Sharda’s emotional outburst to Anaya Bangar’s surrogacy plans, and Anupam Mittal reacting to the new H1-B visa regulations, the list of news is long. Here’s a look at the top TV news:\n\nA recent episode of Rise and Fall made headlines after a major argument between Aditya Narayan and Kiku Sharda. The fight left Kiku in tears, with fellow contestants concerned about the duo’s bond. The argument began when Aditya confronted Kiku about his repeated remarks on the show. He said, “Aap kya mujhe ye pagal wagal bolte rehte ho, aap har baar red room mein mujhe target karte rehte ho” (Why do you keep calling me crazy and targeting me every time in the red room?). However, the comedian confirmed that he only meant it as a joke and was not serious about what he said.\n\nAwez Darbar has been making headlines after being accused of cheating on Nagma Mirajkar by fellow contestant Baseer Ali and Splitsvilla fame Shubhi Joshi. Nagma has now reacted to the claims and said, “I don’t want to comment on anyone right now. I just want to make it clear that I’m with Awez, and we stand together. Our journey spans nine years, we have seen each other grow both personally and professionally. In these nine years, sometimes we were not on talking terms, that’s normal. Right now, we have made a huge decision to get married, and there’s a lot of clarity between us. We have discussed everything, and our bond is strong. So whatever comments are being made, especially inside the show, won’t affect me, because if this relationship weren’t built on trust and understanding, it wouldn’t even exist.”\n\nShark Tank India’s Anupam Mittal is known for sharing his bold opinions. He recently reacted to the new H1-B visa and US Green Card regulations by Donald Trump and shared a tweet. He revealed that while obtaining an H1-B visa and a US Green Card is often considered the pinnacle of professional achievement, real success may lie in giving up these opportunities to return home and contribute to one’s own country. The tweet read, “I thought my H1-B & Green Card was a success. Turns out, giving it up was. If you can, come back home & build  >=  >= .”\n\nNehal Chudasama was evicted from the Bigg Boss house last weekend, leaving fans surprised and curious about her next move. However, she was later sent to the secret room, keeping her presence in the game alive. In the latest episode, Nehal made a dramatic re-entry into the house, much to the excitement of her fellow contestants and viewers, setting the stage for new twists and interactions.\n\nAnaya Bangar, daughter of Indian cricketer and coach Sanjay Bangar, is currently a part of OTT show Rise and Fall. She recently opened up about her surrogacy plans in the show. Talking about it, she said, “I have two options: I can either adopt or go for sperm freezing before the hormone treatment. I can become a mother, but through surrogacy. I had my sperm frozen before my transition. That is why I will become a surrogate mother. I cannot conceive.”\n\nParag Tyagi recently shared a podcast on his YouTube channel, opening up about the sudden death of his wife, Shefali Jariwala, in June this year. He reacted to rumours of Shefali using anti-aging medicines and said, “This is half-baked information. I want to ask, which of these were anti-aging medicines? Shefali didn’t want to take multivitamins daily as she would forget them, so she took them through an IV drip once a month. These included multivitamins, Vitamin C, collagen, and glutathione, which is one of the best antioxidants.”\n\nArchana recently visited her hometown in Dehradun, where she enjoyed spending time with her family members. The actress met some of her fans and broke down emotionally recalling her journey. She shared, “People are so sweet and they have given me so much love. I feel so touched when people from my own hometown remember me. For them I’m the same young Archana and now they feel proud that I’m from their hometown. I can still remember when I left this place and went to Mumbai to fulfil my dreams.”\n\nNatalia Janoszek, who recently got evicted from Bigg Boss 19, shared her experience on the show and her bond with fellow stars. In an interview with Hungama Studio, Natalia revealed details about meeting Baseer’s friends and even shared his mother’s reaction to his connection with Farhana Bhatt. Natalia said, “Yes, I did get a chance to speak to some of Baseer’s friends. They were very nice and supportive. In fact, Baseer himself told me to connect with them before I left. He knew I was looking for a new place and wasn’t very familiar with things outside, so he guided me a bit. I told him I was definitely leaving, and he gave me the names of people I could reach out to. I haven’t had a chance to speak with her personally. But from what I’ve gathered, just bits and pieces shared by his friends, I think she had a strong reaction after one of his fights with Farhana.”\n\nWorld Tourism Day 2025: India’s top 10 eco-friendly escapes\n\n10 habits of graceful people that makes them naturally attractive\n\nFrom Maharashtra to Madhya Pradesh: Indian states starting with the letter ‘M’\n\nNavratri 2025: Bollywood-inspired ethnic looks in green for day 5\n\nAvneet Kaur’s Top 10 Gorgeous Looks to Take Style Inspiration From\n\n7 things kids learn from parents without you realising\n\nKriti Sanon channels vibrant charm through her outfit",
  "url": "https://timesofindia.indiatimes.com/tv/news/hindi/from-anaya-bangars-surrogacy-plans-to-anupam-mittals-bold-take-on-h1-b-visa-regulations-top-tv-news/photostory/124155149.cms",
  "scraped_timestamp": "2025-09-26T15:50:10.808622",
  "content_length": 5457,
  "word_count": 948,
  "source_domain": "timesofindia.indiatimes.com"
}