{
  "title": "Gainers",
  "content": "The Enforcement Directorate is conducting searches in a bank fraud case, covering four premises, one each in Delhi, Hyderabad, Jaipur, and Mumbai. The premises covered in the search action belong to the entities and persons closely associated with one Yashdeep Sharma.\n\nBreaking News Live Updates: Lalu Prasad's elder son Tej Pratap Yadav to contest Bihar polls from Mahua as his Janshakti Janta Dal announces candidates for 21 seats.\n\nOn NDA announcing seat-sharing formula for Bihar assembly elections 2025, RJD leader Mrityunjay Tiwari said,  \"It's clear that all is not well within the NDA. We've been saying that the BJP will eliminate the JDU. Until now, the JDU used to be in the role of the elder brother, but now it has been brought to the same level. Chirag Paswan and the BJP have taken 130 seats. Now, after the elections, the BJP will eliminate the JDU and take the Chief Minister's seat. Jitan Babu Manjhi was pleading for fifteen seats. He has been given six seats. Upendra Kushwaha was also making big demands, but he too met the same fate. The BJP devised a formula to eliminate smaller parties. It now appears that the BJP will force the merger of JDU...\"On Mahagathbandhan, he said, \"Our seat-sharing formula has almost been finalised, and we believe it will be announced very soon... All is well in the alliance. The alliance is extremely strong and poised for a grand victory. It's not about seats, but about victory.\"\n\nGaza Ceasefire Deal Highlights News Updates: Hamas to skip formal signing of Gaza peace deal, warns of upcoming 'difficulties' in negotiations\n\nMoon Rise Time Today Live: Devotees across India prepare to sight the moon and break their fasts, marking one of the most significant fasting rituals for married women.\n\nUS-Gaza Highlights News Updates: Trump plans summit on Gaza during Egypt visit next week, Axios reports\n\nIsrael-Gaza War Highlights News Updates: We ended war in Gaza; hostages to be released by Monday or Tuesday, says Trump\n\nBreaking News Highlights: Six people are injured after a blast from two parked scooters in Kanpur’s Mishri Bazaar area. Forensic teams are investigating, with police yet to determine whether it was accidental or deliberate.\n\nBreaking News Highlights: Former Prime Minister HD Deve Gowda was hospitalised following infection. In a bulletin, the Manipal Hospital said, “Honourable Former PM Mr HD Deve Gowda was admitted to Manipal Hospital at Old Airport Road with an infection. He is currently undergoing medical management for the same and his progress is being monitored by a team of medical experts.\"\n\nUS Highlights News Updates: We want to move very quickly on Gaza plan, says White House\n\nCuttack Violence Highlights News Updates: Prohibitory orders imposed in 13 police station areas of Odisha's Cuttack after fresh group clash\n\nIsrael-Hamas War Highlights News: Israel's Netanyahu says hopes to announce release of all hostages from Gaza 'in the coming days,' as talks move to Egypt\n\nZubeen Garg Highlights News Updates: Assam government to set up judicial commission under Justice Soumitra Saikia to probe singer Zubeen Garg’s death\n\nRussian President Vladimir Putin today said that a mutually acceptable solution to Ukraine war is possible. However, he said that Russia will quickly respond should Europe provoke Moscow amid what he cast as a hysterial militarisation of the continent, but said he had no intention of attacking the U.S.-led NATO alliance.\n\nWorld News Highlights Updates: Donald Trump, Xi Jinping to meet in four weeks, US president says\n\nRBI Policy Meeting Highlights:The Reserve Bank of India’s Monetary Policy Committee (MPC) has maintained its monetary policy stance at “neutral” and kept the policy repo rate unchanged at 5.50%.\n\nHamas-Gaza War Highlights News Updates: If Hamas rejects Trump Gaza plan, Israel will 'finish the job,' envoy says\n\nIsrael-Hamas War Highlights News Updates: White House releases Trump plan for ending Israel-Hamas war and Gaza governance; no word on Israel or Hamas acceptance\n\nIndia News Highlights Updates: TVK leader Vijay received bomb threat on Sunday, a day after a stampede at this Karur rally killed 36 people, including children. A squad has arrived with sniffer dogs for thorough search at his Neelankarai residence, reported PTI.\n\nTVK Rally Stampede in Karur Live: At least 36 persons, including children, feared dead due to stampede-like situation in Vijay's rally in Karur, TN.\n\nGaza War Highlights News Updates: Medical charity Doctors without Borders suspends Gaza City activity due to Israeli offensive\n\nIndia news live updates: Indian government drafts proposal to relax foreign investment rules for e-commerce exports.\n\nUN General Assembly Highlights News Updates: For first time in nearly 60 years, Syrian president addresses UN\n\nGaza War Highlights News Updates: Hamas rejects Trump accusation of obstructing Gaza ceasefire\n\nWorld news live updates: Trump to slam 'globalist institutions' in UN speech, the White House says\n\nPalestine Highlights News Updates: Israel's Benjamin Netanyahu tells Western leaders there will be no Palestinian state\n\nBreaking News Live Updates: Australia beat India by 43 runs, win Women's ODI series 2-1.\n\nUS Highlights News Updates: Stopgap spending bill to avert shutdown falls short in US Senate\n\nUS-India Highlights News Updates: US President Donald Trump says he is 'very close' to India, PM Narendra Modi\n\nBreaking News Live Updates: Former Hurriyat Conference chief Abdul Gani Bhat dies at his Sopore residence.\n\nDehradun Cloudburst Live News Updates: Uttarakhand's Dehradun experienced cloudbursts at several places in Sahastradhara, causing water level in rivers and water streams to swell sharply in the intervening night of Monday and Tuesday.\n\nIndia-US Highlights News: US President Donald Trump calls PM Modi, extends birthday greetings on his 75th, signals push to reset US-India ties\n\nDhaula Kuan BMW Accident Case Highlights News: Court sends accused Gaganpreet to a two-day judicial custody\n\nBreaking News Live Updates: Two persons were killed and another sustained serious injuries when two motorcycles collided head-on in Uttar Pradesh's Chandauli on Sunday, police said.\n\nNepal Highlights News Updates: Nepal to hold polls on March 5, says President Ramchandra Paudel\n\nWorld News Highlights Updates: Strike by 3,200 Boeing defense workers began August 4\n\nDelhi-Noida Metro News Highlights: Noida, Delhi Metro apps enable single QR ticketing system & 'Bhim vega' next-gen UPI solutions\n\nThe National Investigation Agency (NIA) searched multiple locations in 05 states and 01 UT across India in a terror conspiracy case linked with ISIS and other terrorist organisations. A total of 21 locations was extensively searched in the states of Bihar, Uttar Pradesh, Maharashtra, Karnataka and Tamil Nadu and in the UT of Jammu and Kashmir, said NIA.\n\nAFG vs HK Asia Cup 2025: Afghanistan won against Hong Kong in Abu Dhabi on Tuesday.\n\nNegotiations are scheduled for Wednesday between the Nepalese Army, Nepal's President Ram Chandra Paudel, and representatives of Gen Z youth to determine the leadership of an interim government amid ongoing political unrest, The Himalayan Post reported.\n\nBreaking News Highlights Updates: French President Emmanuel Macron appoints Sebastien Lecornu as new Prime Minister\n\nNepal Gen Z Protest Highlights News Updates: After violent protests, Nepal government lifts ban on social media\n\nUS Highlights News Updates: Donald Trump says ready to move on new Russia sanctions\n\nWorld News Highlights Updates: Unidentified object likely to be a drone falls in Eastern Poland\n\nIndia Highlights News Updates: PM Modi to visit flood-hit states, review damage and relief measures\n\nAfghanistan Earthquake Highlights News Updates: Strong 6.2 magnitude earthquake jolts southeastern Afghanistan, says German Research Centre for Geosciences\n\nGST tax rates on common use items ranging from hair oil to corn flakes, TVs, and personal health and life insurance policies were slashed after the all-powerful GST Council on Wednesday approved a complete overhaul of the tangled Goods and Services Tax regime.\n\nIn a landmark move, the GST Council has simplified the indirect tax system by reducing the four existing slabs to just two. Responding to a long-standing demand from the Indian middle class, the Council has scrapped the 12% and 28% rates, retaining only the 5% and 18% slabs, a change set to ease household budgets and boost consumer sentiment.\n\nUS Highlights News Updates: Trump slams Putin, dismisses concerns over China-Russia axis forming against US\n\nDelhi Rains Highlights News Updates: IMD warns of heavy downpours tomorrow, Gurugram shifts schools, offices online\n\nIndia Highlights News Updates: OMCs cut 19-kg commercial LPG cylinder price by Rs 51.50 from Sept 1\n\nBreaking News Live Updates: Defence Minister Singh stresses drones must be incorporated into India's war policy, calling them critical to modern warfare strategy.\n\nReliance AGM Meeting 2025 Highlights:Reliance announces a new subsidiary to drive AI in India and unveils key products, including JioPC, JioFrames, and more. Additionally, Ambani announced plans to list Jio by the first half of 2026. The stock was down 2%.\n\nUS Highlights News Updates: Federal appeals court blocks Trump's decision to end legal protections for 600,000 Venezuelans\n\nUS Highlights News Updates: Donald Trump to address UN General Assembly on September 23\n\nBreaking Live News Updates: Two children were killed and 14 others injured in a shooting at a Catholic school in Minneapolis on Wednesday, AFP reported citing police.\n\nLarge swathes of land in the northern Indian plains, especially in Punjab, were inundated by snow-fed rivers from the Himalayas and rivulets flowing in spate following incessant showers in their upstream, forcing train cancellations and school closures.\n\nUS Highlights News Updates: Donald Trump says will seek death penalty for murders in US capital\n\nUS Highlights News Updates: Donald Trump floats US taking ownership of military base land in South Korea\n\nDelhi Highlights News Updates: Another accused arrested in Delhi CM Rekha Gupta attack case\n\nIndia News Highlights: Army rescues 500 people stranded in Bundi; flood conditions ease in Kota.\n\n2025 ET World Leaders Forum Highlights: India is going to export EVs to 100 nations, says PM Modi\n\nIndia News Updates: PM Modi to visit Japan and China from August 29 to September 1.\n\nBreaking News Live Updates: 4 workers dead, 2 serious after nitrogen gas leaks at pharma company near Mumbai.\n\nIndia News Highlights Updates: PM Modi to inaugurate, lay foundation of projects worth Rs 5,200 cr during August 22 Kolkata visit\n\nMumbai Rain Live Updates: The India Meteorological Department (IMD) issued an red alert of heavy rains for Mumbai for August 20, reportedTOI. The city's local train services faced widespread cancellations on Wednesday due to severe waterlogging across the city and several trains have been cancelled. Authorities have advised commuters to check schedules and plan travel in advance.\n\nUS Highlights News Updates: White House says US to help coordinate security guarantees for Ukraine\n\nWorld News Live Updates: Trump says would prefer immediate ceasefire in Ukraine while 'we work on lasting peace'\n\nBreaking News Highlights: Ukrainian President Zelenskyy hails 'historic' US decision to offer security guarantees for Ukraine\n\nBreaking News Highlights: Russian President Vladimir Putin holds meeting in Moscow to discuss outcome after returning from the United States.\n\nTrump-Putin Meeting Highlights News Updates: I agree with Trump that Ukraine's security must be ensured, says Putin\n\nPM Modi 79th Independence Day Speech Live: India celebrates its 79th Independence Day with a renewed focus on economic reforms and national security achievements, marked by the announcement of next-generation GST reforms and the success of Operation Sindoor.\n\nIndiGo Highlights News Updates: IndiGo Delhi-Darbhanga flight cancelled after weather delay breaches runway timing limits; passengers stage brief protest\n\nBreaking News highlights: US President Donald Trump said Wednesday he was planning a second meeting with Russian counterpart Vladimir Putin soon after Friday's Alaska summit -- this time with Ukraine leader Volodymyr Zelensky included.\n\nBreaking Highlights News Updates: Ukraine on Tuesday ruled out withdrawing troops from its Donbas region as part of a peace deal with Russia, after US President Donald Trump suggested both sides would have to cede territory.\n\nUS Highlights News Updates: US Steel plant explosion near Pittsburgh kills 1, leaves 2 missing, officials confirm\n\nEarthquake News Highlights Updates: 6.1 magnitude earthquake felt in northwestern Turkey, but there are no immediate reports of casualties\n\nNagpur Highlights News Updates: Koradi Devi temple gate collapse in Nagpur injures 17, three critical; rescue operations underway\n\nDelhi School Education (Transparency in Fixation and Regulation of Fees) 2025 bill passed in Delhi Assembly.\n\nBreaking News Highlights: Delhi High Court allows release of 'Udaipur Files' movie\n\nRussia-Ukraine War Highlights News Updates: Trump hails envoy talks with Putin, but new sanctions still due\n\nRBI Monetary Policy Meeting Live Updates: RBI kept the repo rate unchanged at 5.5%, maintaining a Neutral stance. It also retained its FY26 GDP growth forecast at 6.5% despite US tariffs on Indian imports. CPI headline inflation declined for the eighth consecutive month to a 77-month low of 2.1 per cent in June, RBI Governor said. RBI aspires India to grow at 6.5%+ rate\n\nUttarkashi Cloudburst Live Updates: Schools, Anganwadis shut in Almora and other regions, trains suspended on Haridwar-Dehradun route after landslide.\n\nUS Highlights News Updates: Donald Trump rules out Scott Bessent for Fed chair\n\nCBSE 10th Result 2025 Live Updates results: The Central Board of Secondary Education (CBSE) is set to release the Class 10 supplementary results 2025 shortly on its official website, results.cbse.nic.in.\n\nJ&K Highlights News Updates: Massive air activity reported over Srinagar for last 30 minutes, causes concern among locals\n\nIncessant heavy rainfall has caused a flood situation in Uttar Pradesh's Prayagraj District. Public life in the area remains severely affected due to consistent downpours and resultant waterlogging.On Sunday morning, a man was seen using a boat to commute to his work as the streets got flooded in Prayagraj's Karela Bagh area, following heavy rainfall.\n\nTejashwi Yadav Row Highlights: Tejashwi Yadav’s name in Bihar draft rolls with old EPIC; probe on second number forgery\n\nUS-Russia Highlights News Updates: US deploying nuclear submarines in response to 'provocative' Russian comments, says Trump\n\nBreaking News Live Updates: Commercial LPG cylinder price cut by ₹33.50 from August 1; No change in domestic rates\n\nGSLV-F16 Nisar Satellite Launch Live: ISRO launched on Wednesday a $1.5 billion, first-of-its-kind radar imaging satellite built in collaboration with NASA, deploying it to help enhance global monitoring of climate change and natural disasters.The NASA-ISRO Synthetic Aperture Radar, or NISAR satellite, is the first such collaboration between the Indian Space Research Organisation (ISRO) and U.S. space agency NASA.It took off from India's Satish Dhawan Space Centre at 1210 GMT or 1740 IST atop a medium-lift rocket, marking a milestone in space cooperation and bolstering India's profile in low-cost, high-impact satellite missions.NISAR is the world's first radar imaging satellite to use two radar frequencies - the L-band provided by NASA and the S-band developed by ISRO - to track minute changes in the Earth's surface, including movements as small as a centimetre, the space agencies have said.\n\nTsunami warning Russia Earthquake live: A massive 8.8-magnitude earthquake struck Russia’s Kamchatka Peninsula early Wednesday, triggering tsunami warnings across the Pacific, from Hawaii and Alaska to New Zealand. Though no serious injuries were reported, authorities across multiple countries urged evacuations amid widespread coastal alerts and transport disruptions.\n\nUS Trade Tariffs Highlights News: Trump imposes 50% tariff on Brazil with new executive order, says White House\n\nIndia-US Trade Deal Highlights News Updates: India trade deal not finalized, says Donald Trump\n\nThailand-Cambodia Highlights News Updates: Thailand and Cambodia truce agreement comes into effect\n\nUS-EU trade deal Highlights News Updates: Trump confirms deal sets 15% export tariffs on EU.\n\nCambodia-Thailand Conflict Highlights News Updates: Cambodia, Thailand both looking for an immediate ceasefire and peace, says Donald Trump\n\nIndia Weather News Highlights Updates: IMD issues heavy rains alert for Konkan, hilly areas of Pune, Nashik, Satara\n\nThailand Cambodia War Live Updates: Armed clashes broke out between Thailand and Cambodia in long-disputed border areas, rapidly escalating months-long tensions. Cambodia's attacks on Thailand kill 9 civilians, wound 14\n\nRussia AN 24 Plane Crash live: Russian plane Antonov-24 passenger plane carrying about 40 people went missing near China border.",
  "url": "https://economictimes.indiatimes.com/news/newsblogs",
  "scraped_timestamp": "2025-10-14T14:21:34.349818",
  "content_length": 17169,
  "word_count": 2611,
  "source_domain": "economictimes.indiatimes.com"
}