{
  "title": "German Chancellor Friedrich Merz pushes for frozen Russian assets to be used for Ukraine",
  "content": "German Chancellor Friedrich Merz has called on the European Union to use $160 billion offrozen Russian assetsfor Ukraine’s benefit – particularly the continued supply of weapons – in a major policy U-turn by Berlin.\n\nIn an op-ed for the Financial Times,Merzsaid the moves were necessary so that Ukraine can demonstrate “greater staying power” in the war in the hope of forcing the Kremlin to the negotiating table.\n\nIn the past Berlin has been reluctant to use the funds, citing legal and financial concerns. On Thursday, Merz adopted a more forthright tone. “This must not hold us back,” he said,  urging the EU to consider “circumventing these problems.”\n\nHe added, “I am advocating the mobilization of financial resources on a scale that will secure Ukraine’s military resilience for several years.”\n\nCurrently, around $300 billion of Russian Central Bank assets are frozen internationally, with a large portion – some $229 billion – of those held in the European Union, mostly with the Belgian clearing house, Euroclear.\n\nThe German chancellor is now seeking to use $160 billion in a loan for Kyiv. The sum would be made available to Ukraine as an interest-free loan that would be “repaid once Russia has compensated Ukraine for the damage” the war has caused.\n\nThe Kremlin has long criticized the potential expropriation of Russia’s assets, saying last week that such a move “will not go unanswered.”\n\nNow is the time for Europe to seize Russia’s frozen assets, two former US officials say\n\nUnder Merz’ proposal, Ukraine would only be allowed to use the funds for the procurement of weapons, and not for budgetary purposes.\n\nThe payments to Kyiv would be made in instalments and  EU states, in conjunction with Ukraine, would then determine “which material is procured.”\n\nMerz added that he felt this mechanism would also help to “strengthen and expand”Europe’s own defense industry.\n\nGermany ranks second to the United States in the list of nations who have contributed the most aid, both military and financial, to Ukraine since the war began.\n\nMerz, who won election in February, has been a strong supporter of Kyiv and has made the war in Ukraine a cental focus of his chancellorship.\n\nHe is a key voice in the so-called “coalition of the willing” as well as appearing to have a good relationship with US President Donald Trump.\n\nIn his op-ed, the chancellor added that he would be pushing European leaders to agree to the proposal at an informal meeting of the EU in Copenhagen next week, with the aim of preparing a mandate at the next EU summit at the end of October.\n\nHe added that he hoped the proposal would have “unanimous” approval, or failing that be “adopted by a large majority.” Those comments are likely a message to Hungary’s Prime Minister Viktor Orban and Robert Fico of Slovakia, both EU members with close ties to Russian President Vladimir Putin.",
  "url": "https://edition.cnn.com/2025/09/25/world/merz-european-union-russian-assets-ukraine-intl",
  "scraped_timestamp": "2025-09-26T00:16:10.702777",
  "content_length": 2874,
  "word_count": 481,
  "source_domain": "edition.cnn.com"
}