{
  "title": "Global Trends",
  "content": "The White House raised the stakes in a clash over a possible US government shutdown Thursday, telling federal agencies to prepare for more mass firings by President Donald Trump's administration.said that \"agencies are directed to use this opportunity to consider Reduction in Force (RIF) notices for all employees\" in areas of government bearing the brunt of a shutdown.\n\nThe United States economy showed unexpected growth in the second quarter. Revised data indicates a 3.8% increase, driven by consumer spending and reduced imports. Earlier estimates were lower. First quarter figures were adjusted slightly downward. Trade policy uncertainty is expected to temper growth in the coming months. Economists predict a slower pace for the remainder of the year.\n\nU.S. jobless claims fell by 14,000 to 218,000 last week, below forecasts, though hiring remains weak. Nonfarm payrolls averaged just 29,000 in the past three months versus 82,000 a year earlier, reflecting trade tensions, immigration curbs, and cautious hiring.\n\nPakistan and Saudi Arabia's recent security pact signals a shift in global alliances, highlighting a post-American world characterized by instability. This agreement, rooted in historical cooperation, reflects Saudi Arabia's search for security amidst perceived US apathy. The move has implications for regional players like India and Iran, and raises concerns about future stability.\n\nThe White House is preparing for possible government shutdown. Agencies are told to plan for large-scale firings. This is different from past shutdowns. Earlier, workers were furloughed. Now, positions may be eliminated. The move increases pressure on Democratic leaders Chuck Schumer and Hakeem Jeffries. They oppose a clean funding bill. Democrats demand healthcare improvements.\n\nA controversial statue depicting Donald Trump and Jeffrey Epstein holding hands was removed from the National Mall due to permit violations. The artwork, titled \"Best Friends Forever,\" was created by a group called \"The Secret Handshake.\n\nPresident Trump has unveiled a Presidential Walk of Fame at the White House, honoring past presidents. However, in a controversial move, Trump replaced Joe Biden's portrait with a photo of an autopen, referencing his unsubstantiated claims about Biden's cognitive state.\n\nHong Kong airport resumes flights after a 36-hour suspension due to Typhoon Ragasa. Businesses and transportation services are reopening. The typhoon caused injuries and flooding. Authorities are repairing roads and clearing fallen trees. The airport expects to handle over 1,000 flights. Residents had stockpiled necessities before the storm. The typhoon has now weakened into a tropical storm.\n\nThe U.S. Commerce Department has initiated national security investigations into imports of personal protective equipment, medical items, robotics, and industrial machinery. These \"Section 232\" investigations, initiated on September 2nd, could lead to higher tariffs on a wide range of goods. The probes will assess domestic production capacity, foreign supply chain reliance, and the impact of foreign subsidies on U.S. demand.\n\nIn Dallas, a gunman opened fire on an ICE field office from a rooftop, killing one detainee and critically wounding two others before taking his own life. Authorities found anti-ICE messaging at the scene, and the incident follows another recent shooting targeting a conservative leader. DHS has ordered increased security at ICE facilities nationwide in response to the attack.\n\nU.S. and Japanese officials are reportedly arranging a visit by President Trump to Japan next month, preceding his planned attendance at the Asia-Pacific Economic Cooperation leaders' meeting in South Korea. This trip presents an opportunity to meet the new Japanese Prime Minister and continue trade negotiations, following a framework deal to avoid tariff hikes.\n\nDonald Trump alleges sabotage during his U.N. visit. He cites three incidents. These include an escalator malfunction. He also mentions teleprompter failure. Trump further claims audio issues during his speech. He suspects a conspiracy against him. Trump wants an investigation into these matters. The Secret Service may get involved. The U.N. denies any intentional wrongdoing.\n\nA UN spokesman said the escalator stopped because someone in front of Trump accidentally triggered a safety mechanism. Leavitt cited a Times of London report noting that UN staff had joked about turning off the escalators amid US funding cuts. Several other White House officials and conservative commentators speculated about a plot.\n\nThe United States has lowered tariffs on auto imports from the European Union to 15 percent, retroactive to August 1, following a trade pact. This move significantly reduces the previous 27.5 percent tariff imposed after Washington's additional 25 percent duty. The agreement also includes exemptions for sectors like aircraft and pharmaceuticals, effective September 1, with plans for further expansion.\n\nA sniper, identified as 29-year-old Joshua Jahn, opened fire at a Dallas ICE facility, killing two and wounding others. Jahn was later found dead from a self-inflicted gunshot wound. Authorities are investigating the shooting as an act of targeted violence, with evidence suggesting an anti-ICE motive based on messages found on bullets near the shooter.\n\nA shooting at a Dallas ICE facility left two migrants dead and at least four injured. The shooter, identified as Joshua Jahn, died from a self-inflicted gunshot wound. Evidence suggests an anti-ICE motive, with bullet casings bearing related messages. An eye witness described the horror that unfolded at the Dallas ICE facility and said she heard '20 shots in a row'.",
  "url": "https://economictimes.indiatimes.com/news/international/global-trends",
  "scraped_timestamp": "2025-09-26T00:47:52.321249",
  "content_length": 5724,
  "word_count": 850,
  "source_domain": "economictimes.indiatimes.com"
}