{
  "title": "Global Trends",
  "content": "Amazon will pay $2.5 billion to settle FTC claims of deceptive Prime enrollment practices. The settlement includes $1.5 billion in refunds for customers allegedly tricked into subscriptions and those who faced difficulty canceling. Eligible subscribers could receive up to $51, with automatic payouts for some and claim forms for others, alongside improved cancellation processes.\n\nPete Hegseth calls for an urgent meeting next week. Top military officers, generals, and admirals are summoned to a Virginia base. The sudden meeting sparks speculation in the Pentagon. Donald Trump hails Hegseth's order. Officials raise security concerns about gathering so many high-ranking officers. The purpose of the meeting remains unknown, causing anxiety among the ranks.\n\nShaun Alexander, the former NFL MVP, and his wife Valerie are expecting their fourteenth child. The couple, married since 2002, already has thirteen children. They shared the news during a discussion about their faith-based homeschooling initiative. Shaun met Valerie shortly after being drafted by the Seahawks. The couple's strong faith and family values are central to their life together.\n\nVoddie Baucham, a pastor and president of Founders Ministries, passed away following a medical emergency. The 56-year-old's death was announced by his family and the organization. Baucham is survived by his wife, Bridget, and their children. Recent social media posts by Baucham about Charlie Kirk, who was fatally shot in Utah, have resurfaced.\n\nBrussels affirmed that the EU-US trade agreement safeguards its drug exports from tariffs exceeding 15%, despite President Trump's announcement of new pharmaceutical levies. The July agreement established a tariff ceiling on pharmaceuticals, semiconductors, and lumber. The EU emphasizes ongoing engagement with the US to implement commitments and explore further tariff exemptions.\n\nErika Kirk, widow of Charlie Kirk, faces online rumors linking her to intelligence operations and child trafficking, following her husband's assassination. Claims surfaced about her Romanian charity, Romanian Angels, and a supposed ban from Romania, which fact-check reports have debunked. Wild claims linking Erika Kirk and Donald Trump have also surfaced online.\n\nA recent survey by the American Chamber of Commerce to the European Union reveals a significant shift in sentiment among U.S. companies operating in Europe. While nearly half anticipate worsening transatlantic economic relations, this marks a considerable improvement from earlier in the year. The EU-U.S.\n\nUS President Donald Trump's administration is planning to ask chip industry to make the same no. of semiconductors in US as their customers import in US. As per WSJ, the organizations that do not maintain 1:1 ratio would be taxed with tariffs.\n\nThe Trump administration is considering a regulatory approach to lower U.S. drug prices, potentially aligning them with those of other wealthy nations, sparking industry opposition and possible legal challenges. This move follows previous attempts to address price disparities and demands for voluntary price reductions, with the administration also exploring tariffs and other measures to pressure drugmakers.\n\nA JBS co-owner's private meeting with Donald Trump preceded a shift in Trump's stance toward Brazilian President Lula at the UN. This encounter, following tariff impositions on Brazilian imports, aimed to address concerns about rising beef prices for American consumers. Other Brazilian business leaders are also lobbying the Trump administration for tariff reductions, signaling a broader effort to influence U.S.\n\nDonald Trump, a self-proclaimed \"tariff man,\" is considering imposing heavy tariffs on Russia if it doesn't end the war in Ukraine. He criticized European countries and India for buying Russian oil, which he believes funds Russia's war efforts. Trump also called on NATO and European nations to take stronger action against Russia, particularly regarding oil purchases.\n\nJames Comey was indicted for allegedly lying to Congress, a move celebrated by Trump as \"JUSTICE FOR AMERICA!\" The indictment, focusing on false statements and obstruction, raises concerns about the Justice Department's weaponization under Attorney General Pam Bondi. This action follows Trump's public urging for Comey's prosecution and adds to the turmoil within the Eastern District of Virginia's office.\n\nDonald Trump plans new import taxes from October 1. Taxes include 100% on medicines, 50% on kitchen items, 30% on furniture, and 25% on heavy trucks. Trump believes tariffs boost domestic manufacturing and cut the budget deficit. Experts warn of rising inflation and slower economic growth. The move impacts healthcare costs and home building.\n\nThe White House raised the stakes in a clash over a possible US government shutdown Thursday, telling federal agencies to prepare for more mass firings by President Donald Trump's administration.said that \"agencies are directed to use this opportunity to consider Reduction in Force (RIF) notices for all employees\" in areas of government bearing the brunt of a shutdown.\n\nThe United States economy showed unexpected growth in the second quarter. Revised data indicates a 3.8% increase, driven by consumer spending and reduced imports. Earlier estimates were lower. First quarter figures were adjusted slightly downward. Trade policy uncertainty is expected to temper growth in the coming months. Economists predict a slower pace for the remainder of the year.\n\nU.S. jobless claims fell by 14,000 to 218,000 last week, below forecasts, though hiring remains weak. Nonfarm payrolls averaged just 29,000 in the past three months versus 82,000 a year earlier, reflecting trade tensions, immigration curbs, and cautious hiring.",
  "url": "https://economictimes.indiatimes.com/news/international/global-trends",
  "scraped_timestamp": "2025-09-26T18:03:39.381766",
  "content_length": 5782,
  "word_count": 852,
  "source_domain": "economictimes.indiatimes.com"
}