{
  "title": "Govind Pansare murder: Bombay HC grants bail to key accused, 2 others",
  "content": "Mumbai, The Bombay High Court on Tuesday granted bail to three persons, including prime accused Virendrasinh Tawade, arrested in connection with the killing of rationalist and author Govind Pansare in 2015.\n\nBesides Tawade, Justice S G Dige of the HC's Kolhapur bench also granted bail to two other accused Sharad Kalaskar and Amol Kale.\n\nWhile Tawade and Kale will walk out of prison, Kalaskar will continue to remain in jail as he had been convicted in the 2013 case of rationalist Narendra Dabholkar's murder. His appeal against conviction is pending before the HC.\n\nJustice Dige on Tuesday said he was granting bail to the three accused, and would pass a detailed order later.\n\n\"The applications are allowed. I will pass a detailed order later,\" he said.\n\nThe bench refused to stay its order at the request of a lawyer appearing for Pansare's family.\n\nPansare was shot at on February 16, 2015, in Maharashtra's Kolhapur and succumbed to his injuries a few days later on February 20.\n\nIn January this year, six other accused - Sachin Andure, Ganesh Miskin, Amit Degvekar, Amit Baddi, Bharat Kurane and Vasudev Suryavanshi - were granted bail on the grounds of long incarceration and the fact that the trial is not likely to be completed in the near future.\n\nPansare and his wife were returning home from their morning walk in the Samrat Nagar area of Kolhapur when two motorbike-borne men fired multiple rounds at them before fleeing.\n\nInitially, the Rajarampuri police station in Kolhapur handled the case.\n\nThe investigation was later transferred to a Special Investigation Team under the supervision of the Additional Director General of Police , Maharashtra.\n\nDissatisfied with the lack of progress in tracing the shooters, Pansare's family had sought the case's transfer to the Anti-Terrorism Squad .\n\nOn August 3, 2022, the HC transferred the probe to the ATS, observing there was \"no headway\" or \"breakthrough\" in the case.\n\nOf the 12 accused identified, nine have so far been arrested, and four supplementary chargesheets have been filed. The trial against these nine accused is on.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/govind-pansare-murder-bombay-hc-grants-bail-to-key-accused-2-others-101760436381246.html",
  "scraped_timestamp": "2025-10-14T15:52:48.521129",
  "content_length": 2187,
  "word_count": 358,
  "source_domain": "www.hindustantimes.com"
}