{
  "title": "'Hang my head in shame': Javed Akhtar fumes over India hosting Taliban minister Amir Muttaqi",
  "content": "Lyricist, screenwriter and poet Javed Akhtar on Monday criticised the Taliban MinisterAmir Khan Muttaqi's visit to India, and the \"respect and reception\" he received during his trip. Akhtar called the Taliban the “worst terrorist group” and expressed disappointment over the warm welcome its representative received in a country like India.\n\n\"I hang my head in shame when I see the kind of respect and reception has been given to the representative of the world’s worst terrorists group Taliban by those who beat the pulpit against all kind of terrorists,\" Akhtar wrote on X.\n\nHe also criticised the \"reverent\" welcome Muttaqi received when he visited theDarul Uloom Deoband Islamic seminaryin Uttar Pradesh’s Saharanpur district.\n\n\"Shame on Deoband too for giving such a reverent welcome to their “Islamic Hero” who is one of those who have completely banned girls education. My Indian brothers n sisters!!! what is happening to us,\" Akhtar's tweet further read.\n\nAmir Khan Muttaqi received a rousing welcome in by the Deoband seminary, which had made elaborate arrangements for his visit on Saturday. A list of 15 prominent Ulema (Islamic scholars) was issued to receive the Taliban leader, and tight security measures were in place across the area on the day of his visit.\n\nThe seminary’s rector, Maulana Mufti Abul Qasim Nomani, supervised the welcome ceremony and greeted the Afghan minister along with senior scholars. Besides, flower petals were also showered on the Afghanistan leader as he entered, and many students gathered to take selfies with his entourage.\n\nThe visit to Deoband came a day afterExternal affairs minister S Jaishankar met Muttaqiin New Delhi, as part of the first high-level diplomatic engagement between India and the Taliban regime since it took power in 2021.\n\nAmir Khan Muttaqi, who faces UN sanctions including travel bans and asset freezes, arrived in India for a six-day visit last week after securing a temporary travel exemption from the UN Security Council Committee.\n\nHethanked India for being the first responderin the recent earthquake in Afghanistan, adding that India is seen as a \"close friend\".\n\n\"We want relations based on mutual respect, trade and people-to-people ties. We are ready to create a consultative mechanism to strengthen our relations,” Muttaqi said during the meeting.\n\nHis first news conference in India had also sparked huge backlash over the exclusion of women journalists, and afresh news conferencewas called two days later with over a dozen women journalists. Muttaqi called the absence of women at the earlier conference a \"technical issue\".",
  "url": "https://www.hindustantimes.com/india-news/javed-akhtar-fumes-over-india-hosting-taliban-minister-amir-muttaqi-hang-my-head-in-shame-101760417650218.html",
  "scraped_timestamp": "2025-10-14T14:46:44.728957",
  "content_length": 2610,
  "word_count": 412,
  "source_domain": "www.hindustantimes.com"
}