{
  "title": "Haryana IPS officer's suicide: Gave consent for autopsy after police assured fair probe, says wife",
  "content": "Chandigarh, IAS officer Amneet P Kumar, wife of Haryana IPS officer Y Puran Kumar who allegedly committed suicide here, said on Wednesday that she gave consent for his autopsy after assurance from Chandigarh Police that a fair and impartial probe will be carried out and commitment from Haryana government that action will be against \"erring\" officials.\n\nEnding an impasse over the issue, the family agreed for post-mortem of the senior Dalit police officer, who allegedly shot himself dead at his Chandigarh residence on October 7.\n\nFollowing the family's consent, the autopsy is being carried out at the Post Graduate Institute of Medical Education and Research here.\n\nIn a statement, Amneet Kumar stated, \"In view of the assurance extended by the Union Territory Police for conducting a fair, transparent and impartial investigation, and the commitment conveyed by the Government of Haryana to take appropriate action against any erring officials in due course of law, I have consented to the conduct of the post-mortem examination of Late Y Puran Kumar, IPS.\"\n\n\"Considering the evidentiary importance of a timely post-mortem and in the larger interest of justice, I have agreed for the same to be carried out as per prescribed procedure, by the constituted Board of Doctors, with the presence of a ballistic expert, under the supervision of a magistrate, and with videography of the entire process to ensure complete transparency,\" she said in the statement.\n\n\"I have full faith in the judiciary and the police authorities, and I sincerely hope that the investigation will be conducted in a professional, impartial, and time-bound manner, so that the truth emerges in accordance with law,\" the senior Haryana IAS officer said.\n\nShe said she will continue to extend her full cooperation to the investigating team so that the process is expedited and justice is served at the earliest.\n\n\"In view of the ongoing investigation, no further public statement shall be issued at this stage, and I request the media to respect the sensitivity of the matter,\" Amneet Kumar said.\n\nThe family of the deceased officer, including his wife, arrived at the PGIMER on Wednesday. After they identified the body and completed other formalities, the post-mortem is being conducted at PGIMER, an official said.\n\nOn Tuesday, Chandigarh Police approached a local court seeking direction to Kumar's family to identify the body so that post-mortem can be carried out.\n\nOn police's plea, the court issued a notice to Kumar's wife to file a reply either personally or through counsel on October 15, failing which the application will be decided on merit.\n\nInspector General Y Puran Kumar, 52, allegedly shot himself dead on October 7. However, a post-mortem could not be conducted as his family refused to give consent until action is taken against the Haryana officers who were named in a 'final note' of the deceased officer.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/haryana-ips-officer-s-suicide-gave-consent-for-autopsy-after-police-assured-fair-probe-says-wife-101760505590053.html",
  "scraped_timestamp": "2025-10-15T11:03:08.053516",
  "content_length": 2998,
  "word_count": 484,
  "source_domain": "www.hindustantimes.com"
}