{
  "title": "Haryana IPS officer Puran Kumar's death spotlights caste bias | Case & controversy explained",
  "content": "Haryana-cadre IPS officer Y Puran Kumar's death by suicide has laid bare deep social fault lines, even within the government, exposing caste overtones in both the police and the bureacracy.\n\nThe state government on Saturdaytransferred Rohtak SP Narendra Bijarniya, one of the officers against whom Kumar’s wife was seeking action for allegedly abetting his suicide.\n\nChief MinisterNayab Singh Saini finally reacted, sayingthat anyone found guilty in the ongoing investigation would face action, irrespective of their position.\n\nChandigarh UT police chief Sagar Preet Hooda, who visited Kumar’s residence, said the family has withheld consent for the post-mortem due to certain grievances that are being addressed through ongoing discussions.The Haryana IAS Officers' Associationhas urged the state government and the Chandigarh administration to take up \"utmost seriousness\" the issues raised by Kumar's wife.\n\nHere's more on the suicide case of IGP Y Puran Kumar.\n\nOn October 7, 2025, Y Puran Kumar was found dead at his Chandigarh residence from a gunshot wound. In a “final note”,he named 16 senior officials, including Haryana DGP Shatrujeet Kapoor and Rohtak SP Narendra Bijarniya, accusing them of prolonged harassment, public humiliation, and caste-based discrimination, his wife said in a complaint.\n\nIt alleged years of mental harassment and targeted humiliation that the officer claimed had driven him to take his life.\n\nThe officer’s death comes barely a month after his transfer to the Police Training Centre in Sunaria from his previous posting as Rohtak Range IG, a tenure marred by multiple controversies.\n\nKumar had made serious allegationsagainst senior officials, including filing a formal complaint in May 2021 with the Ambala superintendent of police against the then director general of police Manoj Yadava.\n\nHe accused Yadava of humiliating and harassing him because of his caste, seeking registration of an FIR under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989.\n\nIn his complaint, Kumar alleged that after both he and Ambala SP Abhishek Jorwal visited a temple inside the traffic police station Sahazadpur premises on August 3, 2020, only he was questioned about obtaining prior permission for the temple.\n\nYadava wrote to him on August 17, 2020, seeking an explanation, but no such query was directed at Jorwal, Kumar had claimed.\n\nThe IPS officer had also raised concerns over alleged illegal surveillance, claiming that his mobile phone’s internet protocol detail records, including WhatsApp call details, logs and chats, were unlawfully accessed by certain police and administrative officers in 2021.\n\nHe wrote to the DGP stating he learnt from “reliable sources” that his privacy had been breached in an unethical manner.\n\nAlso Read |Haryana IGP found dead with gunshot wound\n\nKumar’s wife, IAS officer Amneet Puran Kumar, has demanded theimmediate suspension and arrestof all officers named in the suicide note.\n\nShe has sought security for her family and insisted that the FIR be amended to list all accused officers properly and include the correct provisions of the SC/ST (Prevention of Atrocities) Act.\n\nIn a letter to Chandigarh's Senior Superintendent of Police (SSP) on Friday, Amneet, an officer in the Haryana government, said the names of the accused are not \"mentioned clearly\" in the FIR copy which has been provided to her. \"The document lacks the necessary details required for a fair and transparent investigation,\" she said.\n\nShe has called out the inclusion of “diluted” sections in the FIR.\n\nThe family claimed on Saturday that the body was shifted to the PGIMER Chandigarh without consulting them. They have withheld consent for the post-mortem until these demands are met.\n\nA six-member Special Investigation Team (SIT), headed by UT IGP Pushpendra Kumar, is conducting the probe. The team is tasked with collecting evidence, examining witnesses, and preparing a comprehensive report.\n\nChandigarh police have registered an FIR under charges of abetment to suicide and relevant sections of the SC/ST Act, based on the officer’s suicide note. The SIT is expected to investigate thoroughly, and officers may co-opt additional experts as required.\n\nAlso Read |Haryana IGP’s suicide: Six-member SIT set up; no cremation till DGP arrested, say kin\n\nThe Haryana government transferred Rohtak SP Narendra Bijarniya and assured that any official found guilty would face action, irrespective of rank.\n\nChief Minister Nayab Singh Saini has publicly stated that no one is above the law.\n\nChandigarh DGP Sagar Preet Hooda has been in discussions with the family to address their grievances and urged them to allow the post-mortem to proceed.\n\nSeveral officials and ministers have also met the family to offer support.\n\nCongress leader Sonia Gandhihas written to IAS officer Amneet P Kumar, wife of late IPS officer Y Puran Kumar, calling his death a tragic reminder of the “prejudiced and biased” attitude of those in power that denies even senior officials social justice.\n\n“My heartfelt condolences to you and your entire family in this time of immense difficulty,” Gandhi said in her letter dated October 10, “The passing of Mr Y Puran Kumar is a reminder that even today, the prejudiced and biased attitude of those in power deprives even the most senior officials of social justice. I and millions of people of the country stand with you on this path to justice.\"\n\nPunjab Chief Minister Bhagwant Mann also urged the BJP-led governments at the Centre and in Haryana to ensure justice. “The family is demanding justice. You can’t disregard the law to protect one person. No one is above the law. Justice should be done,” he said after visiting the family.\n\nTelangana Chief Minister A Revanth Reddy expressed “deep shock” over the “forced death,” calling it “a stark example of attacks in the name of caste.” He said, “If even an ADGP-level officer faced alleged caste-based harassment, it reflects the pathetic living conditions of common people.”",
  "url": "https://www.hindustantimes.com/india-news/haryana-ips-officer-puran-kumars-death-spotlights-caste-bias-case-controversy-explained-101760197220503.html",
  "scraped_timestamp": "2025-10-11T23:45:38.521822",
  "content_length": 6021,
  "word_count": 944,
  "source_domain": "www.hindustantimes.com"
}