{
  "title": "Himachal HC forbids use of temple funds in public welfare schemes",
  "content": "Himachal Pradesh high court on Tuesday issued an order prohibiting the use of donations made to Hindu temples for government schemes and unrelated public works.\n\nThe court further directed that the funds must be spent strictly for the propagation of Hindu religion and dharmic purposes.\n\n“Every rupee of temple funds must be used for the temple’s religious purpose or dharmic charity. It cannot be treated like general revenue for the State or general public exchequer,” read the order of Division Bench of Justice Vivek Singh Thakur and Justice Rakesh Kainthla while disposing of a petition filed by Kashmir Chand Shadyal, who sought strict compliance with the Himachal Pradesh Hindu Public Religious Institutions and Charitable Endowments Act, 1984, particularly its provisions on budget preparation, maintenance of accounts, and expenditure.\n\n“It cannot be diverted to or transmitted or donated to any welfare schemes of the Government or other similar purpose or activity unrelated to the temple or religion,” the order further stated.\n\nTo promote transparency, the high court directed “Temples should publicly display their Monthly income and expenditure, details of projects funded by donations and audit summaries on notice boards or websites to instil confidence in the devotees that their donations are being utilised for the propagation of the religion and welfare of Hindus”.\n\n“Every temple must maintain proper accounts of income and expenditure, which will be audited annually, and the result of the audit will be published to ensure that the funds are being utilised for the intended purpose,” the court said in its order.\n\nTo fix accountability, the high court directed that “Where it is found that any trustee has misutilised or caused to misutilise the funds of the temple, it will be recovered from him and he will be personally held liable for the misutilisation of such funds”.",
  "url": "https://www.hindustantimes.com/india-news/himachal-hc-forbids-use-of-temple-funds-in-public-welfare-schemes-101760468215977.html",
  "scraped_timestamp": "2025-10-15T10:17:21.264363",
  "content_length": 1897,
  "word_count": 299,
  "source_domain": "www.hindustantimes.com"
}