{
  "title": "Himachal govt announces monthly inspections, grading of PWD rest, circuit houses",
  "content": "Shimla, All PWD rest and circuit houses in Himachal Pradesh will be inspected every month for quality and will be graded accordingly, the state government said in a statement on Thursday.\n\nPWD Secretary Abhishek Jain said that the department has prepared a checklist of all rest houses and their maintenance to provide better guest experiences and facilities in the PWD rest houses.\n\n\"This encompasses the inspection of floors, electrical systems, elevators, maintenance of gardens, parking areas to check any unauthorised parking, lighting systems and much more. Any system that has the potential to wear down or need replacing over time should ideally be included in regular maintenance responsibilities,\" he said.\n\nChief Minister Sukhwinder Sukhu, according to the official statement, said it is a one-of-a-kind initiative and the exercise would be expanded to include other departments as well.\n\n\"Nowhere in any other state has such an initiative been taken, where the rest and circuit houses are monitored on a monthly basis. This will also be extended to other departments' rest houses in a phased manner,\" said the CM.\n\nTalking about the inspections, Jain said that an officer of the rank of junior engineer and SDO will conduct monthly inspections to check the structural items, which include roofs, walls, ceilings, leakages/seepages and conditions of fire extinguishers, etc.\n\n\"At present, there are 275 PWD rest houses having 1,335 rooms and 21 circuit houses of PWD with 222 rooms in the state,\" he added.\n\n\"Besides, they will also grade from very good to poor the quality and condition of electrical appliances, availability of water, sewerage system and water purifiers, etc.\n\n\"The report will be scrutinised by the executive engineer of the section concerned and uploaded online for further scrutiny,\" Jain said.\n\nHe also said that as many as 50 agendas have been incorporated in format prepared for the inspection which will be available with all inspecting officer and also available on the Public Works Department portal.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/himachal-govt-announces-monthly-inspections-grading-of-pwd-rest-circuit-houses-101758817581548.html",
  "scraped_timestamp": "2025-09-26T00:47:45.495070",
  "content_length": 2133,
  "word_count": 336,
  "source_domain": "www.hindustantimes.com"
}