{
  "title": "How West Bengal’s Begunkodar station overcame haunted tag",
  "content": "Begunkodar, a remote town in West Bengal’s Purulia, got a major connectivity boost in 1965 with the opening of a railway station. But the joy for the townspeople was short-lived. The station was abandoned within two years of its inauguration for the next four decades, as rumours of it being “haunted” gained currency. No trains halted even during the day, and railway employees refused to work at the Begunkodar station.\n\n“There were no ghosts. They were all rumours. The situation has changed. Around a dozen trains, including express trains, stop here. The last train stops around 11pm, and villagers get down even at that hour,” said Amulya Mahato, 64, who has been manning the station’s ticket counter since 2009.\n\nNayan Mukherjee, a doctor at Purulia’s Deben Mahata Government Medical College and Hospital, who worked to shed the station’s haunted tag, said rumours about unnatural things and ghosts began within months of the station’s inauguration.\n\n“Some said that a woman clad in a white saree would often be spotted along the tracks. The station closed down within two years as no railway employees were willing to work there,” said Mukherjee, who also heads the Paschim Banga Vigyan Mancha (West Bengal Science Forum)’s Purulia district committee.\n\nIn 2006, the forum and the residents submitted a memorandum to Basudeb Acharia, the then chairman of the parliamentary standing committee on railways, to resume the halt of trains. Trains started halting at Begunkodar in 2009 after the residents submitted another memorandum when Mamata Banerjee, now chief minister, became the railway minister for the second time that year. “But at that time, trains stopped only during the day. No trains would stop at Begunkodar after dark,” said Mukherjee.\n\nNarendranath Mahato, a resident, said at one point it became a stigma for the Begunkodar residents. “People from adjoining villages refused to get married to anyone from Begunkodar, saying that there were ghosts here.”\n\nIn December 2007, on a new moon night, a team of Mukherjee-led volunteers spent a few hours at the station. The police and the railway security force were around a kilometre away. The team found nothing except some men fleeing when challenged, leaving behind some alcohol bottles and cards.\n\nMukherjee said they pasted posters and distributed leaflets offering₹5 lakh for anyone who could prove ghosts. “It is still open,” Mukherjee said.\n\nResidents started confronting outsiders who came to Begunkodar to make videos portraying the station as haunted. At least two volunteers were posted at the station.\n\nGorachand Mahato, a volunteer, said they stop outsiders who try to make any fake videos. “Social media is flooded with such fake videos. Around two years back, a group of young men and women came to the station. One of the women was wearing a white saree and a ghost mask. The villagers soon confronted and chased them away.”\n\nA South Eastern Railway official said major development work over the past two to three years has also helped shed the tag of a haunted station. “Begunkodar had no platforms or electricity. It now has two platforms for up and down trains. Around a dozen trains stop here. The station was connected to the power grid around three years ago. Lights have been installed at the station. A footbridge has been constructed. All this has happened in the last two to three years,” said the official.\n\nAmulya Mahato said ticket sales have also gone up significantly. “Around five years back, we used to sell around 70-80 tickets daily. With the number of trains increasing and running late until night, we now sell around 120-150 tickets every day. People mostly go to Ranchi, Purulia, and Asansol for work,” said Mahato.\n\nLocals said they would get employment if more trains stopped in Begunkodar. “We hope the station undergoes further development and more express trains, including the Shatabdi, which passes through, stop here. This would generate some income for the local youths,” said Dipak Majhi, a hawker selling boiled gram and cucumber at the station.",
  "url": "https://www.hindustantimes.com/india-news/how-west-bengal-s-begunkodar-station-overcame-haunted-tag-101758883030468.html",
  "scraped_timestamp": "2025-09-26T16:41:02.262247",
  "content_length": 4063,
  "word_count": 663,
  "source_domain": "www.hindustantimes.com"
}