{
  "title": "‘I said in 2016…’: Owaisi on India's ties with Taliban, says 'talks not enough'",
  "content": "Amid Afghanistan's Taliban regime's foreign minister Amir Khan Muttaqi's visit to India, AIMIM leader Asaduddin Owaisi on Saturday renewed a call for a robust diplomatic relationship with the group, arguing that merely talking to them is too little.\n\nOwaisi said India must establish full diplomatic relations with Kabul to safeguard its security and strategic interests.\n\nIn an interview with ANI, Owaisi reminded that in his 2016 parliamentary speech, he had predicted the Taliban's return and advocated dialogue long before it became politically fashionable.\n\nOwaisi added that at the time of his speech, he faced backlash, including abuse from some media channels and BJP members, for even suggesting India should keep communication lines open with the group.\n\n\"I stood in Parliament in 2016 and said that the Taliban would come. Talk to them. Many media people and BJP members abused me for talking about the Taliban,\" he said.\n\n\"Their Foreign Minister is here, and the Pakistan Air Force bombed that place. Do you see how it's going? We should establish a full diplomatic relationship. Our presence there is crucial for the country's security and geopolitical interests. We should have a full-fledged diplomatic relationship,\" Owaisi added.\n\nOwaisi also discussed the importance of the Chabahar Port in Iran, adding that Indian could establish a route to Afghanistan from there, which would strengthen Delhi's position over China and Pakistan.\n\nHis stance comes at a moment when India's Afghanistan policy is under intense scrutiny.\n\nTaliban minister Amir Khan Muttaqi is on a six-day visit to India starting Friday. On Saturday, he visited Deoband in Uttar Pradesh's Saharanpur district.\n\nOn Sunday, the Afghan foreign minister will travel to Agra to visit the Taj Mahal.\n\nThe Taliban minister's visit to India assumes greater significance as it comes at a time when both India and Afghanistan are having frosty relations with Pakistan over a range of issues, including cross-border terrorism.\n\nIt is the first visit to India by a senior Taliban minister since the group re-seized power in Kabul four years ago.",
  "url": "https://www.hindustantimes.com/india-news/talk-is-not-enough-what-asaduddin-owaisi-said-on-indias-ties-with-taliban-101760186918861.html",
  "scraped_timestamp": "2025-10-11T23:53:32.164833",
  "content_length": 2118,
  "word_count": 334,
  "source_domain": "www.hindustantimes.com"
}