{
  "title": "‘If someone still steps…’: Kolkata mayor-in-council member's controversial remark on electrocution deaths",
  "content": "Kolkata:Amid heavy rainfall that left Kolkata waterlogged and claimed at least nine lives in the metropolis due to electrocution, a remark by a senior Kolkata Municipal Corporation (KMC) functionary that stepping into flooded streets tantamounts to \"suicide\" triggered a political storm on Thursday.\n\nAt least 11 people have died in the downpour that lashed the city and nearby areas on the morning of September 23. Out of these, nine deaths were reported from Kolkata, and two from adjoining areas.\n\nTMC leader, Tarak Singh, the mayor-in-council member who is in charge of drainage in the KMC, said citizens must exercise caution and refrain from venturing into flooded areas where electric poles pose a risk of short circuits.\n\n\"When we all know that going into flooded streets can cause a short circuit, which can lead to death, if someone still steps in, then it is similar to dying by suicide,\" Singh told reporters.\n\nDeflecting questions of administrative responsibility, Singh said the civic body cannot be blamed for the deaths.\n\n\"CESC supplies power. We maintain the civic infrastructure. Out of 50 lakh electric poles in 144 wards, how many guards can we post? People should also be aware. There is no question of the government's liability. The KMC maintains its own lamp posts, not those of CESC,\" he asserted.\n\nThe comments drew sharp criticism from opposition parties, who accused the ruling TMC of insensitivity and administrative failure.\n\nBJP councillor Sajal Ghosh mocked Singh's remarks, saying, \"By that logic, Mayor Firhad Hakim should be arrested first, because he was seen walking in knee-deep water with an umbrella in hand. Did he attempt suicide too?\"\n\nCPI(M) central committee member Sujan Chakraborty termed the deaths \"murders, not suicides,\" holding the state government, KMC, and the power utility responsible.\n\n\"This is a classic case of man-made disaster. The negligence and incompetence of the administration have cost lives,\" he said.\n\nState Congress spokesperson Suman Raychaudhuri echoed the criticism, calling Singh's remarks \"shameless self-defence.\"\n\nHe said, \"The chief minister has taught her party nothing except how to justify failure. West Bengal is suffering only because this political gang is in power, and their statements prove it.\"",
  "url": "https://www.hindustantimes.com/india-news/if-someone-still-steps-kolkata-mayor-in-council-members-controversial-remark-on-electrocution-deaths-101758819871270.html",
  "scraped_timestamp": "2025-09-26T00:47:34.017748",
  "content_length": 2282,
  "word_count": 357,
  "source_domain": "www.hindustantimes.com"
}