{
  "title": "IMF’s WEO ups India’s 2025-26 growth forecast",
  "content": "India will continue to be the fastest growing major economy in the world and do better than it was expected to in July, the IMF said in its World Economic Outlook (WEO) released on Tuesday. India’s projected GDP growth for 2025-26 is 6.6%, 20 basis points more than what it was in WEO’s July projections. One basis point is one hundredth of a percentage point. To be sure, the 2026-27 GDP growth forecast for India has been brought down by 20 basis points compared to the July projection to 6.2%. The IMF’s latest growth projection for India is slightly lower than the 6.8% forecast by the RBI in its MPC resolution released earlier this month.\n\n“Carryover from a strong first quarter more than offsetting the increase in the US effective tariff rate on imports from India since July”, the WEO report said, while also noting that inflation has surprised on the downside in India. To be sure, the WEO report also shows that the effective tariff rate facing Indian exports to the US stood at 35.8% in October 2025, the second highest among major countries and country groups after China. This is a result of US President Donald Trump imposing an additional 25% tariff on India on account of its Russian oil imports even though he has not imposed any such tariff on China which buys more Russian oil than India.\n\nAmong major economies, the US is expected to grow at 2%, China at 4.8% and the Euro Area at 1.2% in 2025. Growth rate for Emerging Market and Developing Economies is expected to be 4.2%. All of them, except China, have seen an upgrade in growth prospects compared to the July projections. In China, the growth projection is unchanged between the July and October projections.\n\nWEO’s favourable commentary about India’s economic prospects and a small upward revision to global growth prospects from 3% to 3.2% between July and October projections notwithstanding, the report’s central message is one of alarm vis-a-via the state of the global economy with the red flags extending beyond US President Donald Trump’s trade wars. Concluding “that the shock triggered by the tariff surge had no effect on global growth” will be both “premature and incorrect”, Pierre-Olivier Gourinchas, the chief economist of IMF said in a blogpost. Importers may pass the tariffs to consumers in the US leading to higher prices, trade may re-route permanently leading to efficiency losses and economic forces beyond tariffs are simultaneously at play complicating a reading of the impact of tariffs, the post said. His post also lists factors such as an AI boom, growing structural crisis in the Chinese economy, fiscal crisis and threats to institutional credibility posing big downside risks for the global economy going forward.\n\nThe most important task to boost growth prospects going forward according to IMF is to resolve policy uncertainty and “clearer and more stable bilateral and multilateral trade agreements” which alone can boost global output by 0.4% in the very near term. “A return to low tariffs that prevailed before January 2025 based on these agreements adds even more upside, about 0.3 percent”, IMF said. While it has flagged the AI boom as something comparable to the dotcom bubble signifying exuberance, it has also recognised its long-term productivity enhancing capacity.\n\n“The task ahead is to restore confidence through credible, predictable, and sustainable policy actions. Policymakers should establish clear, transparent, and rules-based trade policy road maps to reduce uncertainty and support investment and to reap the productivity and growth benefits that more trade brings”, the WEO report said.",
  "url": "https://www.hindustantimes.com/india-news/imfs-weo-ups-india-s-2025-26-growth-forecast-101760468339220.html",
  "scraped_timestamp": "2025-10-15T09:56:54.165081",
  "content_length": 3621,
  "word_count": 593,
  "source_domain": "www.hindustantimes.com"
}