{
  "title": "Indian Navy commissions India’s first indigenous diving support vessel ‘Nistar’ -All you need to know",
  "content": "TheIndian Navycommissioned INS Nistar, the country’s first indigenously designed and built Diving Support Vessel, at the Naval Dockyard inVisakhapatnamtoday. The warship is significantly enhancing the Indian Navy’s rescue capabilities. Serving as the ‘Mother Ship’ for the Deep Submergence Rescue Vessel (DSRV), Nistar will also help to evacuate Indian Navy personnel in case of any underwater contingency.\n\nAddressing the commissioning ceremony, Navy Chief Admiral Dinesh K Tripathi termed the commissioning of INS Nistar a ‘historic’ achievement. Tripathi further added that he is optimistic that Nistar will carry forward the legacy of the original ‘Nistar’ ship, which played a key role during the 1971 Indo-Pak war, including in detecting the Pakistani submarine Ghazi.\n\nHere are 10 facts about INS Nistar\n\nThe ship, which comes equipped with a combination of Remotely Operated Vehicles (ROVs) to undertake Diver Monitoring and Salvage Operations up to a staggering depth of 1000 m.\n\nDesigned by Hindustan Shipyard Limited (HSL) based in Vishakhapatnam, involved the participation of 120MSMEsin the construction of its 80 per cent indigenous equipment.\n\nMeasuring 118 m with a carrying capacity of nearly 10,000 tons, the latest addition to the Indian Navy fleet comes equipped with state-of-the-art Diving Equipment and can undertake Deep saturation diving up to 300 m depth.\n\nThe earlier version of this ship was launched on March 29, 1971, where it played a pivotal role in the Indo-Pak war. It was based right here in Visakhapatnam and became the first ship to locate the Pakistani submarine Ghazi.\n\nThe ship’s name, ‘Nistar’, originates from Sanskrit and means liberation, rescue or salvation.The warship has been designed and built as per the classification rules of the Indian Register of Shipping (IRS).\n\nThe original version of Nistar, which was the first ship the locate the ship wreck of the Pakistani Ghazi Submarine, was decommissioned after two decades of service in 1989.\n\nWith the endurance ability to last for over 60 days at sea and accommodate 113 sailors, the ship retains the capacity to undertake stages through helicopter operations. Furthermore, the availability of a 15-ton subsea crane makes the ship a reliable and versatile platform that can be accessed to perform a variety of operations.\n\nWith a top speed of 18 knots, which comes out to be approximately 34 kilometres per hour, the ship can undertake gas diving using a side diving stage for undertaking diving operations up to 75 m depth.\n\nThe crest of the ship depicts an anchor and a dolphin, where the anchor symbolises maritime dominance, fearlessness and stability. Meanwhile, the dolphin present in the crust represents the ship’s specialised diving capabilities.\n\nThe ship’s motto of Surakshita Yatharthta Shauryam, which effectively translates to ‘Deliverance with Precision and Bravery’, captures the Indian Navy’s spirit of serving with dedication and excellence.",
  "url": "https://www.financialexpress.com/business/defence/indian-navy-commissions-indias-first-indigenous-diving-support-vessel-nistar-all-you-need-to-know/3919441/",
  "scraped_timestamp": "2025-10-14T14:31:06.561634",
  "content_length": 2960,
  "word_count": 455,
  "source_domain": "www.financialexpress.com"
}