{
  "title": "India",
  "content": "The MSDE has established a data and strategy unit (DSU) to enhance the monitoring of the Skill India Programme. This initiative, prompted by MoSPI, aims to identify skilling gaps and opportunities. The DSU will facilitate data-driven decision-making, strategy formulation, and improved coordination among ministries for a robust skilling ecosystem.\n\nIndia's education system shows improved student retention, with dropout rates declining across all levels in 2024-25. The gross enrollment ratio has also increased at the secondary and middle levels. While health outcomes like infant and under-five mortality rates have improved, stunting remains a concern. Crime against children is rising, with kidnapping and abduction being the most reported cases.\n\nFinance Minister Nirmala Sitharaman urged financial institutions to maintain strong balance sheets to fund infrastructure, industry, and MSMEs, while partnering with NBFCs to reach underserved sectors. She highlighted the increasing demand for credit and innovative financial products as India's economy grows.\n\nThe Ministry of Home Affairs (MHA) has cancelled the FCRA license of SECMOL, an NGO founded by Sonam Wangchuk, after accusing him of instigating Ladakh violence. This decision follows a CBI inquiry into alleged FCRA violations. MHA cited discrepancies in deposited funds, including a ₹3.\n\nLadakh remains tense following violent protests that resulted in four civilian deaths, leading to curfews in Leh and prohibitory orders in Kargil. The unrest stemmed from demands for statehood, Sixth Schedule implementation, and increased political representation.\n\nPrime Minister Narendra Modi addressed the Uttar Pradesh International Trade Show. He stressed boosting the Make in India mission. He assured support to the domestic manufacturing sector. Modi highlighted the strong India-Russia partnership. He criticised the Congress party's past economic policies. He mentioned tax reductions and increased savings under his government. Efforts to strengthen indigenous defence production were also discussed.\n\nIn Gandhinagar's Bahiyal village, approximately 60 individuals were detained after a social media post sparked clashes. The unrest began when a youth's post, intended to counter the 'I Love Muhammad' campaign, allegedly contained derogatory content, leading to protests, vandalism of shops and vehicles, arson, and stone pelting near the village garba venue.\n\nA senior State Department official stated that the US considers Kashmir a direct issue between India and Pakistan, refraining from intervention. While ready to assist if requested, the US, under President Trump, believes India and Pakistan should resolve the matter bilaterally.\n\nNavratri celebrations boost business for private detectives in Gujarat. Traditionally hired to monitor children, especially girls, detectives now address security concerns. Parents worry about narcotics and honey traps. Agencies like RedSpy Detective offer surveillance, shadowing subjects discreetly. Concerns have shifted from location to overall safety. Detectives use gadgets and direct parental intervention to ensure well-being.\n\nIn Satna, Madhya Pradesh, a tragic incident occurred where a sanitation worker lost his life and two others are in critical condition after inhaling toxic gases while cleaning an underground sewer line. The workers fell unconscious inside the sewer near Triveni Palace in Kripalpur area.\n\nExternal Affairs Minister S. Jaishankar criticized tariffs and concerns over India's Russian oil purchases. He highlighted the impact of conflicts in Ukraine and Gaza on global energy, food, and fertilizer security. Jaishankar emphasized dialogue and diplomacy. He also addressed terrorism as a persistent threat to development. He urged the world to show no tolerance towards terrorist activities.\n\nShivraj Singh Chouhan announced a national initiative on water security. A portion of MGNREGA funds will be used for water conservation. The initiative prioritizes water-related works in water-stressed blocks. Amendments were made to the Mahatma Gandhi NREGA Act. The goal is to address depleting groundwater levels. Narendra Modi's commitment to water conservation was highlighted.\n\nFood Safety and Standards Authority of India has started a licensing window for Ayurveda Aahara. Manufacturers can now apply for licenses on the FoSCoS portal. This move aims to standardize traditional Ayurvedic foods. It aligns recipes with food safety standards. FSSAI has published a list of 91 approved recipes. This initiative is in collaboration with the Ministry of Ayush.\n\nV Somanna met Nitin Gadkari to speed up compensation for landowners. This is for the Satellite Town Ring Road project. The project covers the Dobbaspet- Madagapalli section. Somanna also requested early completion of national highway projects in Tumakuru. He asked for a review of the highway alignment from Mallasandra to Vasanthanarasapura.\n\nA Delhi court has granted journalist Paranjoy Guha Thakurta temporary relief, suspending the order to remove alleged defamatory content against Adani Enterprises Limited. This directive remains in effect until a lower court reconsiders the matter after hearing Thakurta's arguments. Previously, similar relief was granted to four other journalists, emphasizing the need for a fair hearing before content removal.\n\nPriya Kapur, widow of Sunjay Kapur, requested the Delhi High Court to keep her late husband's asset details confidential due to security concerns. Karisma Kapoor's children opposed this, seeking full access to verify the assets, alleging discrepancies in bank accounts.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-09-26T00:23:37.658876",
  "content_length": 5625,
  "word_count": 801,
  "source_domain": "economictimes.indiatimes.com"
}