{
  "title": "India",
  "content": "A large group of Antop Hill residents halted a Mumbai CSMT-bound local train on the Harbour Line near Wadala station on Friday afternoon. The protesters, numbering in the hundreds, were demonstrating against the installation of mobile towers on the rooftops of their slums, claiming they were illegal and posed a radiation risk.\n\nDelhi is set to undergo a significant administrative restructuring, increasing to 13 revenue districts and 39 sub-divisions. Chief Minister Rekha Gupta approved the plan to streamline governance by aligning MCD zones with revenue districts, aiming to eliminate jurisdictional overlaps and improve inter-departmental coordination. The realignment seeks to enable quicker redressal of citizens’ grievances and faster delivery of services.\n\nThey Call Him OG released on September 25, 2025 and registered the year’s strongest Day 1 in India. Early estimates suggest day 1 collection earned more than ₹90 crore, highest in 2025.\n\nSri Lanka's envoy highlighted the strengthened ties between India and Sri Lanka, reaching \"unprecedented excellence\" following recent visits by both countries' leaders. With Sri Lanka's economy stabilizing and recovering, significant opportunities for collaboration with India are emerging. The enduring relationship, rooted in history, culture, and trade, positions India as Sri Lanka's closest neighbor and natural business partner.\n\nExternal Affairs Minister S. Jaishankar, speaking at the India–SICA (Sistema de la Integración Centroamericana or Central American Integration System ) Foreign Ministers’ Meeting in New York, stressed India’s deepening engagement with Central American nations. He highlighted opportunities for Indian investments in agriculture, renewable energy, pharmaceuticals, and IT within SICA economies. Dr. Jaishankar also promoted the adoption of India’s UPI digital payments system to strengthen financial ecosystems, reaffirming India’s commitment to South-South cooperaton\n\nRani Mukerji is a timeless style icon whose saree looks are perfect for Durga Puja celebrations. From bold reds to understated whites, her choices combine tradition with glamour. Here are six stunning saree inspirations you can recreate to channel your inner Bollywood diva this festive season. Each look brings its own personality and elegance, making it easy to pick one that suits your style.\n\nThe Delhi High Court has ordered a status quo on the removal of social media posts concerning the Adani Group by Ravish Kumar and Newslaundry. This order came after Adani Enterprises assured the court it wouldn't request further content removal from the journalists or intermediaries beyond what existed on September 26.\n\nThe Supreme Court instructed Chhattisgarh police to preserve Katha Ramchandra Reddy's body. He was a Maoist commander. He died in an alleged fake encounter in Narayanpur district. The court's order came after a plea alleging torture and a fake encounter. The High Court will decide the matter after its vacation. The petitioner seeks an independent investigation into his father's death.\n\nThe Supreme Court has prohibited the sale of all firecrackers, including green crackers, in Delhi-NCR in anticipation of Diwali. However, manufacturers with permits from NEERI and PESO can continue production, provided they pledge not to sell in the Delhi-NCR region. The court acknowledged pollution concerns but refrained from a nationwide ban, as the Union government hasn't proposed one.\n\nPrime Minister Narendra Modi will unveil BSNL’s indigenous 4G stack tomorrow, marking a historic milestone in India’s telecom journey. Communications Minister says, with nearly 98,000 sites ready, the rollout promises seamless nationwide coverage and future-ready upgrades to 5G. Through Digital Bharat Nidhi, around 30,000 villages have been connected under the 4G saturation project. The union minister hailed it as a ‘historic day for India and the world,’ as India joins the global elite in telecom equipment manufacturing. Modi’s 2020 decision to build a domestic 4G stack instead of relying on foreign equipment has now positioned India among the Big Five global leaders.\n\nThe Chhattisgarh High Court validated a divorce, citing mental cruelty after a wife called her husband a \"pet rat\" for obeying his parents. The court upheld the family court's decision, noting the wife's behaviour and prolonged desertion met the criteria for dissolving the marriage. While affirming the divorce, the husband was directed to pay Rs 5 lakh as permanent alimony.\n\nThe 17 Pro Max is positioned as the top-tier offering in Xiaomi's 17 series. It features a Snapdragon 8 Elite Gen 5, a flagship processor, an advanced Leica-tuned imaging system, a high-refresh LTPO OLED display, and a secondary screen embedded within the camera module for quick interactions and as a camera preview for rear-camera selfies.\n\nDelhi is set to make history with its first cloud seeding trial in North Delhi, scheduled for the first week of October. Minister Manjinder Singh Sirsa confirmed the signing of a memorandum to kickstart the project, calling it a long-awaited step finally realised under Chief Minister Rekha Gupta. The move aims to test artificial rain as a solution for pollution and water scarcity\n\nIn a remote UNGA address, Palestinian Authority President Mahmoud Abbas condemned Israel’s Gaza campaign as “genocide” and “war crimes,” while rejecting Hamas’ October 7 attack. Abbas said the PA is ready to govern Gaza, excluding Hamas, and pledged Palestinians will never abandon their land, vowing to rebuild despite the suffering.\n\nA recent study reveals the Ganga River is experiencing its worst drying phase in 1,300 years, impacting over 600 million people. Declining rainfall, driven by monsoon variability and human factors like pollution, coupled with excessive groundwater extraction, are pushing the river beyond sustainable limits. This threatens water security, agriculture, and ecosystems, demanding urgent water management reforms.\n\nThe Supreme Court declined to consider a petition seeking a ban on Salman Rushdie's \"The Satanic Verses.\" This decision followed a plea referencing a Delhi High Court order from November of last year. The High Court had previously closed proceedings challenging the 1988 ban, citing the authorities' failure to produce the relevant notification, leading to the presumption of its non-existence.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-09-26T15:39:46.866735",
  "content_length": 6388,
  "word_count": 950,
  "source_domain": "economictimes.indiatimes.com"
}