{
  "title": "Indicators",
  "content": "India's foreign exchange reserves saw a slight dip. As of October 3, the reserves were $699.96 billion. This follows a figure of $700.24 billion reported the previous week. The Reserve Bank of India actively monitors the foreign exchange market. Interventions are undertaken to ensure stable trading conditions. These actions aim to manage fluctuations in the rupee's exchange rate.\n\nHouse prices across India saw a 3.6 percent rise year-on-year in the first quarter of the current fiscal. This growth is lower than the previous year's 7.6 percent. Nagpur, Chandigarh, Chennai, and Kochi recorded the highest increases quarter-on-quarter. The Reserve Bank of India released this data with a new base year of 2022-23, including eight new cities.\n\nIndia’s manufacturing sector is set for sustained growth in FY2025-26, driven by strong domestic demand, investment optimism, and recent GST cuts, according to FICCI’s Q2 survey. About 87% of firms reported stable or higher production, with 83% expecting increased orders.\n\nIMF Managing Director Kristalina Georgieva highlighted India's emergence as a crucial growth engine amidst shifting global economic trends. She noted that global growth is projected at around 3 percent, a decrease from pre-pandemic levels, with China's deceleration contrasting India's rising economic prominence.\n\nNITI Aayog is launching a major initiative to uplift India's informal workers. A new digital platform, Digital ShramSetu, will use advanced technologies like AI and blockchain. This aims to provide trust, access, and skills to over 490 million workers. The plan focuses on incentivizing technology adoption and creating verifiable credentials.\n\nHeadline inflation is expected to ease further with the Consumer Price Index (CPI) projected at around 1.2 per cent for September 2025, aided by a continued decline in food prices, according to Bank of Baroda's latest Price Picture report. The report attributes the moderation to sustained deflation in essential commodities and a sharp correction in the prices of tomatoes, onions, and potatoes (TOP).\n\nTo be called Shram Shakti Niti 2025, the policy aims at providing universal social security to all workers, ensuring occupational safety and health, empowering women and youth, easing compliance and enhancing formalisation of workforce to help build a fair, inclusive, and future-ready labour ecosystem in the country.\n\nBMI, a Fitch Solutions company, forecasts the Reserve Bank of India will cut its benchmark repo rate by another 25 basis points to 5.25% in December 2025. This projection stems from expectations of inflation and growth falling short of RBI's targets, creating room for further easing despite recent signals from the Governor.\n\nThe World Bank raised India’s FY26 growth forecast to 6.5% from 6.3%, while trimming FY27 to 6.3%, citing higher US tariffs. Despite this, India remains the fastest-growing major economy, driven by strong consumption and GST reforms. South Asia’s growth is projected to slow to 5.8% in 2026, though AI adoption could boost long-term productivity.\n\nIndia's services sector growth cooled in September to 60.9, down from August's 15-year high, primarily due to weaker overseas orders. Despite this moderation, business activity remained robust, and optimism for the year ahead improved to a six-month high. Export orders, however, rose at the slowest pace since March.\n\nThe government's recent MSP hikes for six rabi crops for the 2026-27 marketing season, ranging from 4.0% to 10.1%, are projected to have a limited impact on retail inflation. Despite these increases, good buffer stocks and higher reservoir levels are expected to keep retail food prices stable for the remainder of the year.\n\nRBI Governor Sanjay Malhotra stated gold prices now reflect global uncertainties. He noted crude oil prices remain stable despite tensions. Malhotra cautioned about fiscally stressed economies and trade policy impacts. He also warned of a potential correction in global stock markets. Gold prices reached a record high this week. The Reserve Bank of India kept interest rates unchanged.\n\nIndia's foreign exchange reserves decreased to $700.24 billion as of September 26, down from $702.9 billion on September 12. The Reserve Bank of India routinely intervenes in the foreign exchange market to moderate undue volatility in the rupee, aiming to preserve orderly trading conditions without targeting a fixed exchange rate.\n\nRBI Governor Sanjay Malhotra stated that current global trade policies could inflict long-term harm on growth in certain economies. He highlighted India as an anchor of stability, attributing its resilient growth to strong macroeconomic fundamentals, including low inflation, healthy forex reserves, and robust balance sheets.\n\nIndian households reported easing price pressures. The RBI survey indicated moderation in inflation expectations. Near-term inflation forecasts dropped. One-year ahead expectations also fell. Younger respondents showed a lower current inflation perception. Kolkata recorded the highest current inflation perception among cities. The survey offers insights into household views.\n\nSBI forecasts much lower inflation for the current and next financial years. Domestic factors like monsoon progress and GST rationalisation support this outlook. RBI recently revised its FY26 inflation projection downwards. The central bank also increased its FY26 GDP growth estimate.",
  "url": "https://economictimes.indiatimes.com/news/economy/indicators",
  "scraped_timestamp": "2025-10-11T23:53:37.008709",
  "content_length": 5438,
  "word_count": 805,
  "source_domain": "economictimes.indiatimes.com"
}