{
  "title": "Indicators",
  "content": "India's logistics cost is estimated at 7.97% of GDP in 2023-24, according to a new report. Rail emerges as the most cost-efficient mode of transport, while air is the most expensive. The government initiatives like PM Gati Shakti are contributing to slowing logistics cost growth, with recommendations focusing on infrastructure upgrades and green energy adoption.\n\nAlvarez & Marsal is expanding in India, targeting fast-growing mid-market firms and scaling its global capability centre (GCC), which now employs 700 of its 1,200 India staff. The firm plans to grow to 3,000 employees in 3–4 years. A&M sees India as a talent hub and its GCC as an innovation centre, not just backend support, amid rising global demand for consulting.\n\nThe RBI said the Supervisory Data Quality Index (sDQI) score of scheduled commercial banks improved to 89.9 in June 2025 from 89.3 in March. Covering 87 banks, the index tracks accuracy, timeliness, completeness, and consistency in supervisory returns. No bank scored below 80, reflecting stronger compliance with RBI’s Master Direction on Filing of Supervisory Returns.\n\nThe RBI sold a net $2.54 billion in the spot forex market in July, with no purchases, compared to $3.6 billion sold in June. The Indian rupee fell 2% that month, its largest drop since September 2022. RBI’s net outstanding forward sales stood at $57.85 billion at July-end. The central bank intervenes to curb currency volatility.\n\nThe Reserve Bank of India is expected to hold its key interest rate at 5.50% on October 1 and through year-end, a Reuters poll showed. Strong GDP growth driven by government spending contrasts with weak private investment. Economists cited inflation risks, rupee weakness, and global uncertainties. Most now see no rate cuts until 2026, with a slim majority forecasting stability into 2025.\n\nIndia's private sector activity experienced a slight moderation in September, registering 61.9, down from August's high, but still indicating strong expansion. New business intakes grew at a slower pace, impacting output and employment. Despite this, optimism remains high among private firms, fueled by expectations of benefits from GST rate cuts, even as international orders saw slower growth due to tariffs.\n\nThe OECD raised India’s 2025 GDP forecast to 6.7% from 6.3%, citing strong domestic demand and GST reforms. Monetary and fiscal easing, along with tax cuts and higher public investment, support growth. Food inflation has eased, and GDP hit 7.8% in Q1. Export tariffs from the US pose risks, but resilient domestic consumption cushions the impact on overall activity.\n\nAs per the provisional payroll data for July, released by the ministry of labour and employment on Monday, net formal job creation went up by 5.5% in July compared to 1.99 million in July 2024 but was a tad lower than June 2025 when the Employees’ Provident Fund Organisation record the highest ever net addition of 2.18 million.\n\nS&P Global Ratings projects India's economic growth to remain steady at 6.5% in FY26. Domestic demand will be robust, supported by a good monsoon, tax reductions, and government investment. India's GDP surged to 7.8% in April-June. Private investment remains sluggish. Trade tensions with the US pose a risk.\n\nIndia's private sector experienced slower growth in September, according to a recent survey. The Composite Purchasing Managers' Index dipped from its August high. Both factory output and services growth cooled. New business grew, but at a weaker pace. Job creation also slowed. Input cost inflation eased, but manufacturers hiked selling prices. Business sentiment strengthened, anticipating demand and tax cuts. U.S.\n\nIndia's core sector output surged by 6.3% in August, marking a 15-month high, fueled by a low base and strong performances in coal and steel. While coal output rebounded significantly, steel also demonstrated robust growth, indicating heightened infrastructure activity. However, crude oil and natural gas production experienced contractions during the same period.\n\nIndia's core sector shows promising growth. Output increased by 6.3% in August 2025. The eight core industries contributed significantly. These include coal, crude oil and natural gas. Refinery products and fertilizers also played a key role. Steel, cement and electricity sectors showed growth. The Index of Core Industries holds substantial weight. It constitutes over 40% of India's industrial production.\n\nThe Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) may announce a 25 basis points (bps) cut in its September policy meeting as it is the best possible option at this stage, according to a report by State Bank of India (SBI).\n\nEconomists are closely monitoring the impact of the GST rate cuts, effective Monday, on retail prices and consumer spending this festive season. The focus is on whether companies pass on the benefits, how it influences inflation, and inventory management.\n\nGold prices are likely to stay high next week. This is due to global monetary easing and festive demand in Asia. Central banks are buying gold, and geopolitical risks persist. Traders will watch US-India and US-China trade talks. US economic data will also influence the market. Silver prices have risen sharply because of investment and industrial demand.\n\nRating and Investment Information (R&I) has upgraded India's sovereign rating to 'BBB+' from 'BBB', acknowledging the nation's strong economic growth, fiscal discipline, and external stability. This upgrade, the third in 2025, is expected to lower overseas borrowing costs and boost investor confidence.",
  "url": "https://economictimes.indiatimes.com/news/economy/indicators",
  "scraped_timestamp": "2025-09-26T16:17:14.508632",
  "content_length": 5613,
  "word_count": 869,
  "source_domain": "economictimes.indiatimes.com"
}