{
  "title": "India",
  "content": "The Delhi Police Crime Branch busted a major racket in Burari producing fake consumer goods after a tip-off from Hindustan Unilever about duplicate Closeup toothpaste being sold in the market. Over 25,000 counterfeit tubes, along with raw materials and packaging, were seized in a swift raid exposing the growing menace of fake FMCG products.\n\nIndia has been elected to the United Nations Human Rights Council for a seventh term, commencing January 1, 2026. This three-year tenure reflects India's commitment to human rights and fundamental freedoms. The country will join other newly elected members, including Angola, Chile, and Pakistan, on the Geneva-based body.\n\nA bus fire near Thaiyat village in Jaisalmer claimed 20 lives. Authorities have released helpline numbers for the public to assist in identifying victims and supporting affected families. DNA identification efforts are underway, with an expert team en route to Jodhpur.\n\nThe family of Haryana IPS officer Y Puran Kumar has agreed to a post-mortem examination. Kumar allegedly died by suicide on October 7. His family had initially refused consent, demanding action against named Haryana officers. The body has been kept at PGIMER. The Haryana government had previously sent DGP Shatrujeet Kapur and transferred Rohtak SP Narendra Bijarniya.\n\nThe vibrant youth of India are spearheading a revolution in fintech, as highlighted by Nirmala Sitharaman's announcement of an impressive 87% digital payment adoption rate—well above the global norm of 62%. Through initiatives like Jan Dhan and enhanced digital frameworks, financial inclusion has soared. The fintech landscape now offers instant credit and simplified loan processes.\n\nAnant Goenka, currently the senior vice president of Ficci, has been elected as the president-elect for the upcoming 2025-26 term. He takes the helm from Harsha Vardhan Agarwal during the annual general meeting. Goenka, who also serves as vice chairman of RPG Group—a major conglomerate with wide-ranging business ventures—previously drove CEAT to impressive heights in market capitalization.\n\nThe Supreme Court has praised the Directorate of Enforcement for its work.  The ED successfully returned attached properties to homebuyers.  This action benefits 213 homebuyers who waited over 12 years.  The project can now be completed and units handed over.  This restitution secures the interests of genuine buyers.\n\nThe Supreme Court questioned the Enforcement Directorate's jurisdiction in the TASMAC money laundering probe, raising concerns about encroaching on state police powers and the federal structure. The bench extended a stay on ED proceedings, which are investigating a purported ₹1,000 crore scam.\n\nLadakh's Apex Body Leh and Kargil Democratic Alliance will hold a peace march and blackout to protest alleged administration excesses and the September 24 killings. They demand a judicial probe, release of detainees including Sonam Wangchuk, and compensation for victims.  The groups stated these demands must be met before resuming dialogue with the Union home ministry.\n\nThe Centre is set to roll out an innovative initiative modeled after Beijing's air quality improvements, aiming to significantly reduce pollution in Delhi-NCR. Over the next five years, the plan aspires to halve pollution levels through targeted actions such as managing heavy vehicle access and encouraging the uptake of electric vehicles.\n\nChief Minister Mamata Banerjee visited Mirik, Darjeeling, after devastating landslides. She met affected families and promised financial aid for damaged homes. Relief efforts are underway, including rebuilding houses and bridges. The Chief Minister highlighted the swift distribution of compensation and jobs to victims. Administrative meetings reviewed ongoing work, with all affected areas cleared and relief camps operational.\n\nAmid rising tensions, leaders in Ladakh are set to escalate their campaign for statehood and essential constitutional safeguards. They are calling for a thorough judicial investigation into the recent violence before any further discussions with the Centre can take place.\n\nThe former Vasai-Virar civic chief, Anil Pawar, stands accused of orchestrating a vast illegal construction operation, allegedly receiving over Rs 169 crore in bribes. The Enforcement Directorate unveils a complex narrative in its chargesheet, revealing builders Sitaram and Arun Gupta's involvement in erecting 41 unauthorized buildings on various lands.\n\nDelhi Chief Minister Rekha Gupta announced a Diwali gift for residents. A complete waiver on late payment surcharges for water bills is offered until January 31, 2026. Following this, a 70 percent waiver will be available until March 31, 2026. This scheme aims to help consumers clear outstanding dues and avoid disconnections.\n\nA devastating fire engulfed a private bus travelling from Jaisalmer to Jodhpur. Twenty passengers lost their lives in the tragic incident. Sixteen others sustained critical injuries and are receiving treatment. The bus, carrying 57 passengers, caught fire shortly after departing Jaisalmer. Rescue operations were swift, with locals and army personnel assisting.\n\nUttar Pradesh will provide two free LPG refills to 1.86 crore women under the Pradhan Mantri Ujjwala Yojana. This initiative aims to support underprivileged families and promote clean fuel access. The refills will be distributed in two phases, October-December 2025 and January-March 2026. Beneficiaries will receive subsidies directly into their bank accounts.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-10-15T10:05:46.660524",
  "content_length": 5537,
  "word_count": 810,
  "source_domain": "economictimes.indiatimes.com"
}