{
  "title": "India",
  "content": "The Enforcement Directorate has restored flats, commercial units, and plots worth Rs 175 crore to over 200 homebuyers after a 12-year wait. This action follows a Supreme Court directive to protect the interests of genuine homebuyers caught in prolonged legal proceedings related to a money laundering investigation.\n\nThe Pradhan Mantri Awas Yojana-Urban 2.0 scheme is significantly boosting digital payments among beneficiaries. Home ownership under the scheme leads to increased UPI spending, especially for women. This initiative is also deepening India's digital economy and formal financial ecosystem for lower-income households, demonstrating a positive wealth effect and financial stability.\n\nDelhi launches a relief scheme for unauthorised water connections, offering residents who apply for regularisation a 96% benefit and reducing the previously charged 5% compound interest, announced by Minister Parvesh Verma.\n\nThe Supreme Court has eased Delhi-NCR's firecracker ban for Diwali, allowing green crackers on the day before and Diwali day itself. Residents can burst these crackers only in designated areas and within specific time slots: 6 AM to 7 AM and 8 PM to 10 PM.\n\nThe Delhi Police Crime Branch busted a major racket in Burari producing fake consumer goods after a tip-off from Hindustan Unilever about duplicate Closeup toothpaste being sold in the market. Over 25,000 counterfeit tubes, along with raw materials and packaging, were seized in a swift raid exposing the growing menace of fake FMCG products.\n\nIndia has been elected to the United Nations Human Rights Council for a seventh term, commencing January 1, 2026. This three-year tenure reflects India's commitment to human rights and fundamental freedoms. The country will join other newly elected members, including Angola, Chile, and Pakistan, on the Geneva-based body.\n\nA bus fire near Thaiyat village in Jaisalmer claimed 20 lives. Authorities have released helpline numbers for the public to assist in identifying victims and supporting affected families. DNA identification efforts are underway, with an expert team en route to Jodhpur.\n\nThe family of Haryana IPS officer Y Puran Kumar has agreed to a post-mortem examination. Kumar allegedly died by suicide on October 7. His family had initially refused consent, demanding action against named Haryana officers. The body has been kept at PGIMER. The Haryana government had previously sent DGP Shatrujeet Kapur and transferred Rohtak SP Narendra Bijarniya.\n\nThe vibrant youth of India are spearheading a revolution in fintech, as highlighted by Nirmala Sitharaman's announcement of an impressive 87% digital payment adoption rate—well above the global norm of 62%. Through initiatives like Jan Dhan and enhanced digital frameworks, financial inclusion has soared. The fintech landscape now offers instant credit and simplified loan processes.\n\nAnant Goenka, currently the senior vice president of Ficci, has been elected as the president-elect for the upcoming 2025-26 term. He takes the helm from Harsha Vardhan Agarwal during the annual general meeting. Goenka, who also serves as vice chairman of RPG Group—a major conglomerate with wide-ranging business ventures—previously drove CEAT to impressive heights in market capitalization.\n\nThe Supreme Court has praised the Directorate of Enforcement for its work.  The ED successfully returned attached properties to homebuyers.  This action benefits 213 homebuyers who waited over 12 years.  The project can now be completed and units handed over.  This restitution secures the interests of genuine buyers.\n\nThe Supreme Court questioned the Enforcement Directorate's jurisdiction in the TASMAC money laundering probe, raising concerns about encroaching on state police powers and the federal structure. The bench extended a stay on ED proceedings, which are investigating a purported ₹1,000 crore scam.\n\nLadakh's Apex Body Leh and Kargil Democratic Alliance will hold a peace march and blackout to protest alleged administration excesses and the September 24 killings. They demand a judicial probe, release of detainees including Sonam Wangchuk, and compensation for victims.  The groups stated these demands must be met before resuming dialogue with the Union home ministry.\n\nThe Centre is set to roll out an innovative initiative modeled after Beijing's air quality improvements, aiming to significantly reduce pollution in Delhi-NCR. Over the next five years, the plan aspires to halve pollution levels through targeted actions such as managing heavy vehicle access and encouraging the uptake of electric vehicles.\n\nChief Minister Mamata Banerjee visited Mirik, Darjeeling, after devastating landslides. She met affected families and promised financial aid for damaged homes. Relief efforts are underway, including rebuilding houses and bridges. The Chief Minister highlighted the swift distribution of compensation and jobs to victims. Administrative meetings reviewed ongoing work, with all affected areas cleared and relief camps operational.\n\nAmid rising tensions, leaders in Ladakh are set to escalate their campaign for statehood and essential constitutional safeguards. They are calling for a thorough judicial investigation into the recent violence before any further discussions with the Centre can take place.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-10-15T11:20:57.550742",
  "content_length": 5306,
  "word_count": 780,
  "source_domain": "economictimes.indiatimes.com"
}