{
  "title": "Indian-origin physician Neil K Anand, who treated 9/11 patients, gets 14-year sentence for opioid conspiracy",
  "content": "Indian-origin doctor Neil K Anand, 48, who was convicted earlier this year of US healthcare fraud, has been sentenced to 14 years in prison for administering unnecessary sedatives to patients to claim insurance money. The Pennsylvania physician was also ordered to pay more than $2 million in restitution and an additional $2 million in forfeiture.\n\nThe US Department of Justice’sOffice of Public Affairsreleased a statement on Tuesday confirming that Anand received a 168-month prison sentence for orchestrating conspiracies involving healthcare fraud, wire fraud, unlawful distribution of controlled substances, and money-laundering offences.\n\nAnand claimed that he treated patients at Ground Zero on the day of the 9/11 attacks while he was an intern, The Times of India reported.\n\nCourt documents and trial evidence show that Anand of Bensalem, Pennsylvania, conspired to submit false and fraudulent claims to health plans including Medicare, the US Office of Personnel Management (OPM), Independence Blue Cross (IBC), and Anthem.\n\nThe claims involved “Goody Bags” of medically unnecessary prescription medications dispensed to patients via Anand’s in-house pharmacies, for which the health plans collectively reimbursed over $2.4 million.\n\nTo persuade patients to accept the unwanted Goody Bags, Anand also conspired to distribute oxycodone outside the normal course of medical practice and without a legitimate medical purpose. Unlicensed medical interns wrote prescriptions for controlled substances using blank forms pre-signed by Anand, who ultimately prescribed 20,850 oxycodone tablets for nine patients.\n\nAfter becoming aware of the investigation, Anand attempted to conceal the proceeds by transferring around $1.2 million into an account held in a relative’s name for the benefit of a minor.\n\nIn April 2025, Anand was convicted of conspiracy to commit healthcare and wire fraud, three counts of healthcare fraud, one count of money laundering, four counts of unlawful monetary transactions, and conspiracy to distribute controlled substances.\n\nAfter learning he was under investigation, Anand concealed the proceeds of the fraud by transferring around $1.2 million into an account held in a relative’s name for the benefit of a minor family member. Anand disputed the allegations, saying he treated victims of the 9/11 attacks and served as a physician in the US Navy.\n\nAnand and his family claimed his compassion for patients had been unfairly criminalised, the TOI report added. He treated 9/11 victims in New York City in 2001 before enlisting in the US Navy as a physician.\n\n“The law has spoken for now, but the deeper questions remain: What is healing? What is justice? Where’s the line between mercy and misconduct?” Anand said.\n\nUS District Judge Chad F Kenney said that Anand had been motivated by greed and illicit profits rather than patient care. “For you, their pain was your gain. You were not focused during this period on treating your patients,” Kenney said.\n\nAnand was charged in 2019, and during the lengthy trial, several social media groups claimed he was a victim of government propaganda. \"The government is using artificial intelligence and manipulated data to prosecute me for treating chronic pain patients, turning tools meant to help into weapons against doctors,\" Anand wrote in a blog seeking support.",
  "url": "https://www.hindustantimes.com/india-news/indianorigin-physician-neil-k-anand-who-treated-9-11-patients-gets-14-year-sentence-for-opioid-conspiracy-101758864957620.html",
  "scraped_timestamp": "2025-09-26T15:49:52.063018",
  "content_length": 3344,
  "word_count": 511,
  "source_domain": "www.hindustantimes.com"
}