{
  "title": "India",
  "content": "India's Principal Secretary P K Mishra emphasized disaster risk reduction as a collective investment at the G20 Ministerial Meeting in South Africa. He highlighted India's commitment to early warning systems, anticipatory financing, and public-private partnerships, alongside its leadership in the G20 DRR Working Group and CDRI. The meeting adopted a declaration focused on resilience through solidarity, equality, and sustainability.\n\nAhead of Diwali, the governments of Uttar Pradesh, Rajasthan, and Gujarat have announced bonuses for their state employees. Uttar Pradesh Chief Minister Yogi Adityanath approved a bonus for 14.82 lakh employees, while Rajasthan Chief Minister Bhajanlal Sharma and Gujarat Chief Minister Bhupendra Patel also declared ad hoc bonuses for government staff in their respective states.\n\nIn a recent social media post, Nutritionist Khushi Chhabra revealed that most collagen and biotin supplements are overhyped and don’t truly reach your skin or hair. Collagen powders often break down in the gut, offering little real benefit. Instead, she suggests focusing on natural foods that help your body produce collagen from within.\n\nUttar Pradesh Chief Minister Yogi Adityanath met with the National Statistical Commission chairman and statistics ministry secretary to bolster the state's statistical system for its $1 trillion economy goal. The CM emphasized data-driven planning and real-time monitoring, expressing readiness to collaborate with MoSPI and NSC for robust data in key sectors.\n\nThe Supreme Court questioned the Rajasthan government on the absence of CCTV cameras in police station interrogation rooms, deeming them crucial for human rights. The apex court is hearing a suo motu case concerning the lack of functional CCTVs in police stations, emphasizing the need for an oversight mechanism for monitoring camera feeds.\n\nAt the 41st Raising Day of the National Security Guard (NSG) in Manesar, Union Home Minister Amit Shah announced the foundation stone laying of a ₹141-crore Special Operations Training Centre (SOTC) to boost anti-terror preparedness across India. He said the facility will train NSG and state ATS units using cutting-edge technology. Highlighting the Modi government’s “zero-tolerance policy” towards terrorism, Shah cited measures such as amendments to the UAPA and NIA Acts, the ban on PFI, and enhanced coordination through CCTV and Netgrid systems. He credited the NSG’s legacy from Operation Ashwamedh to Operation Sindoor, saying India’s security is “in capable and committed hands.”\n\nFrom breezy sarees to glamorous lehengas, Bollywood stars are proving that yellow is the ultimate festive color. This sunshine shade radiates warmth, confidence, and joy, perfect for Diwali and other celebratory occasions. Let’s take a closer look at six unforgettable yellow looks that are bound to inspire your festive wardrobe this season.\n\nThis story explains using moringa leaf powder and seed oil for stronger hair: weekly scalp oiling, pre‑wash protection, DIY masks, daily nutrition doses, and safety—plus how to pair moringa with protein, sleep, and gentle styling for visible results in 8–12 weeks.\n\nIndia's Prime Minister Narendra Modi met with Mongolian President Khurelsukh Ukhnaa in New Delhi. Modi announced free e-visas for Mongolian citizens. He highlighted India's role as a steadfast partner in Mongolia's development, citing the USD 1.7 billion oil refinery project. The leaders emphasized the spiritual and diplomatic bonds between the two nations, rooted in Buddhism.\n\nPrime Minister Narendra Modi inaugurated Google's first AI hub in Visakhapatnam, Andhra Pradesh, hailing it as a significant step towards democratizing technology and enabling 'AI for All'. This multi-faceted investment, including gigawatt-scale data center infrastructure and a new international subsea gateway, aligns with India's vision for a developed nation and aims to boost the digital economy.\n\nThe Supreme Court has adjourned the hearing on a plea challenging Sonam Wangchuk's detention under the National Security Act to October 15. His wife, Gitanjali J Angmo, is seeking his immediate release and questioning the NSA's invocation. Wangchuk was detained on September 26 following violent protests in Ladakh.\n\nThe Supreme Court will hear AIMIM leader Asaduddin Owaisi's plea on October 28, seeking an extension for mandatory registration of all waqf properties on the UMEED portal. The six-month registration period is nearing its end, prompting the urgent request for more time. This follows a previous interim order that stayed some provisions of the Waqf (Amendment) Act, 2025.\n\nTwo more Assamese expats, Abhimanyu Talukdar and Tanmoy Phukan, appeared before the Assam Police's CID on Tuesday, who are investigating the death of cultural icon Zubeen Garg in Singapore. They were present on the yacht when Garg died while swimming on September 19. So far, seven Assamese NRIs have deposed, with four more yet to appear.\n\nYour kidneys thrive on steady hydration, low sodium, balanced potassium, and antioxidant‑rich foods. This story highlights five everyday food choices that support filtration, blood pressure, and vascular health as part of a balanced diet.\n\nUnion Home Minister Amit Shah attended the 41st NSG Foundation Day celebration in Haryana. He commended the National Security Guard for its exceptional role in counter-terrorism operations and dedication to national security.\n\nBollywood stars make casual denim look effortlessly stylish. From day outings to brunch dates, these celeb-inspired outfits show how to elevate your everyday denim. Steal their looks to add a chic vibe to your wardrobe.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-10-14T15:58:43.381182",
  "content_length": 5665,
  "word_count": 841,
  "source_domain": "economictimes.indiatimes.com"
}