{
  "title": "Indian-origin US advisor Ashley Tellis arrested for keeping secret documents",
  "content": "Ashley J. Tellis, an India-born US advisor on foreign policy, has been arrested after being charged with illegally retaining classified national defence documents and allegedly meeting with Chinese officials on several occasions.\n\nTellis, who has served as an adviser to the State Department since 2001, was charged in a Virginia district court on October 13,HT reportedearlier.\n\nHe was charged with violating federal law that dictates the retention of national defence information. The 64-year-old, born in India and now a naturalised US citizen, is considered one of America's most prominent experts on India. He played a significant role in the India-US civil nuclear deal talks in the mid-2000s.\n\nOver 1,000 pages of documents marked top secret or secret were found at Tellis's Vienna home in Virginia. The discovery was made by federal investigators during a court-authorised search on October 11.\n\nTellis has allegedly kept these documents in locked filing cabinets in a basement office, on a desk, and in three large black rubbish bags in an unfinished storage room.\n\nHe has top secret security clearance and has access to sensitive compartmented information.\n\nUntil the arrest, he was an unpaid senior adviser at the State Department and worked as a contractor in the department of defence's Office of Net Assessment, where Tellis is considered a subject matter expert on India and South Asian. He also serves as a senior fellow at the Carnegie Endowment for International Peace.\n\nAccording to an FBI affidavit filed in this regard, Tellis was seen accessing classified computer systems at the State Department's Harry S Truman Building on September 25, as captured on video surveillance.\n\nHe also printed several hundred pages from those documents, including a 1,288-page file concerning US Air Force tactics. Tellis reportedly renamed the file \"Econ Reform\" before printing the selected pages and then proceeded to delete the file.\n\nFurther, surveillance footage, dated October 10, from a secure compartmented information facility at the Mark Center in Alexandria, allegedly captured Tellis hiding classified documents, including top secret material, inside notepads before keeping them in his leather briefcase and leaving the facility.\n\nAccording to the federal affidavit, Tellis also met Chinese government officials several times at restaurants in Fairfax between September 2022 and September 2025.\n\n“Tellis entered the restaurant with a manila envelope” during a dinner on September 15, 2022. However, the document \"did not appear\" to be in his possession when he left the restaurant, the document stated.\n\nThe India-born US adviser and Chinese officials were also overheard discussing Iranian-Chinese relations, US-Pakistan ties, among other things.\n\nOn October 11, when the search warrant was executed for Tellis's home, he was supposed to travel to Rome with his family in the evening for a work engagement.",
  "url": "https://www.hindustantimes.com/india-news/indiaborn-us-advisor-ashley-tellis-arrested-after-being-charged-with-keeping-secret-documents-101760492245677.html",
  "scraped_timestamp": "2025-10-15T09:58:16.570866",
  "content_length": 2925,
  "word_count": 449,
  "source_domain": "www.hindustantimes.com"
}