{
  "title": "Indicators",
  "content": "The International Monetary Fund has increased India's economic growth forecast for the fiscal year 2026 to 6.6 percent. This positive outlook comes despite recent US tariffs on Indian goods. India is projected to achieve the highest growth rate among advanced economies, emerging markets, and developing countries for the current and next fiscal years.\n\nInflation has dipped to its lowest point in eight years, opening the door for potential interest rate cuts from the Reserve Bank of India, with analysts suggesting a reduction of 25 to 50 basis points. However, uncertainty looms as the economic growth outlook and trade issues remain in flux.\n\nIndia emerges as a bright spot in a slowing global economy, projected by the IMF to grow at 6.6% in 2025 despite rising US tariffs.  While global output eases due to trade frictions and investment uncertainty, India's resilience is attributed to strong domestic consumption and policy stability.\n\nIndia's Consumer Price Index (CPI) inflation for FY26 is expected to remain at 2.2 per cent, much lower than the Reserve Bank of India's (RBI) forecast of 2.6 per cent, according to a report by the State Bank of India (SBI).\n\nIndia's wholesale inflation decelerated to 0.13% in September, a significant drop from August's 0.52%, driven by falling food and fuel prices. Retail inflation also eased to a multi-year low of 1.5%, remaining below the RBI's target. This indicates a sustained moderation in price pressures across both wholesale and retail segments.\n\nIndia's economic growth is showing signs of recovery, bolstered by strong domestic factors like favorable interest rates, falling crude oil prices, and a normal monsoon. While global trade uncertainties pose a near-term challenge to private investment, a medium-term uptrend is anticipated, driven by government infrastructure spending and a rebound in real estate.  The outlook for Indian equities remains positive.\n\nIndia's statistics ministry pre-tested its National Household Income Survey, a first-ever pan-India initiative to measure household income, set for launch in February 2026. The survey will capture diverse income sources and expenditures, crucial for economic indicators and poverty analysis. Recommendations include building public confidence and ensuring data collection sensitivity.\n\nIndia's retail inflation dropped to a near three-year low of 1.5% in September, primarily due to falling food prices. This easing inflation, below the RBI's target, has economists anticipating a potential rate cut in December, especially if growth momentum falters.\n\nIndia's retail inflation fell to 1.54% in September, the lowest since June 2017. Food prices saw a significant drop, contributing to this easing. This trend provides room for potential interest rate cuts by the Reserve Bank of India. The central bank has lowered its inflation forecast for the fiscal year.  The outlook remains benign, though global factors pose risks.\n\nGeneral government capital spending is projected at 5 percent of GDP in FY26. This figure is slightly lower than FY25 estimates and significantly below the FY24 peak. Public capex growth has been strong in early FY26. States also show healthy momentum in their capital spending. This sustained focus on investment is positive for economic growth.\n\nLondon-based Actis plans to invest over $2 billion in India's infrastructure over the next three to four years, building on its previous investments. The firm sees India as a top global destination for capital due to its stable and transparent market, particularly in infrastructure, despite geopolitical flux.\n\nBroader consumption demand in India is anticipated to fully recover in the next quarter, with some sequential improvement expected in high-frequency economic indicators. Companies may continue inventory adjustments before consumption patterns normalize. The Q2FY26 earnings season is projected to be mixed, with certain sectors showing growth while others face pressure.\n\nIndia's foreign exchange reserves saw a slight dip. As of October 3, the reserves were $699.96 billion. This follows a figure of $700.24 billion reported the previous week. The Reserve Bank of India actively monitors the foreign exchange market. Interventions are undertaken to ensure stable trading conditions. These actions aim to manage fluctuations in the rupee's exchange rate.\n\nHouse prices across India saw a 3.6 percent rise year-on-year in the first quarter of the current fiscal. This growth is lower than the previous year's 7.6 percent. Nagpur, Chandigarh, Chennai, and Kochi recorded the highest increases quarter-on-quarter. The Reserve Bank of India released this data with a new base year of 2022-23, including eight new cities.\n\nIndia’s manufacturing sector is set for sustained growth in FY2025-26, driven by strong domestic demand, investment optimism, and recent GST cuts, according to FICCI’s Q2 survey. About 87% of firms reported stable or higher production, with 83% expecting increased orders.\n\nIMF Managing Director Kristalina Georgieva highlighted India's emergence as a crucial growth engine amidst shifting global economic trends. She noted that global growth is projected at around 3 percent, a decrease from pre-pandemic levels, with China's deceleration contrasting India's rising economic prominence.",
  "url": "https://economictimes.indiatimes.com/news/economy/indicators",
  "scraped_timestamp": "2025-10-15T09:56:43.815944",
  "content_length": 5313,
  "word_count": 796,
  "source_domain": "economictimes.indiatimes.com"
}