{
  "title": "Indian man held for multi-vehicle crash in California; Entered US illegally in 2022",
  "content": "An Indian national, who had arrived in the US illegally, has been arrested for causing a multi-vehicle crash while driving a truck in California last year that critically injured a five-year old child and left her with life-altering injuries.\n\nThe US Immigration and Customs Enforcement (ICE) arrested Partap Singh last month and he will remain in ICE custody pending immigration proceedings.\n\nThe agency said that in June 2024, Singh caused a multi-car pileup while driving a commercial 18-wheeler in California.\n\nSingh had illegally crossed the southern border in October 2022 and was “released” into the country by the Joe Biden administration, the Department of Homeland Security (DHS) said in a statement on Thursday.\n\nThe California Highway Patrol (CHP) Traffic Crash Report states that Singh drove at an unsafe speed and failed to stop for traffic and a construction zone.\n\nSingh had been issued a commercial driver’s license by California Governor Gavin Newsom’s Department of Motor Vehicles.\n\nThe accident left five-year-old Dalilah Coleman with critical, life-altering injuries. The agency added that the collision also resulted in the hospitalisation of Coleman’s stepdad Michael Krause while the child had to be airlifted to a hospital after suffering critical injuries. Several other individuals were also transported to hospitals for injuries.\n\nAccording to Coleman’s father, the crash resulted in her inability to walk, talk, eat orally, or attend kindergarten as planned. She was in a coma for three weeks and required six months of hospital treatment.\n\nWhile in the hospital, she had a craniectomy and was without half of her skull for four months. She experienced a broken femur, skull fractures, and has since been diagnosed with diplegic cerebral palsy, global developmental delay, and will need life-long therapy, the agency said.\n\n“Dalilah Coleman’s life was forever changed when an illegal alien driving an 18-wheeler slammed into her and her family. This tragedy was entirely preventable,” DHS Secretary Kristi Noem said.\n\nThis is “sadly” another example of Newsom’s California Department of Motor Vehicles issuing an illegal individual a commercial driver’s license, she added.\n\n“How many more innocent people must become victims before Gavin Newsom stops playing games with American lives? DHS is working around the clock to remove dangerous aliens—like Singh—who have no right to be in the US,” Noem said.\n\nThis is the second such case involving an Indian, who had been living illegally in the US and was arrested for causing a fatal accident while driving a commercial vehicle.\n\nIn August, Harjinder Singh was arrested on three counts of vehicular homicide. He was also driving an 18-wheeler vehicle on a Florida highway and attempted to make an illegal U-turn.\n\nBy blocking all lanes of the highway with his truck, Harjinder Singh caused a fatal accident, instantly killing three people.\n\nThe DHS had said that Harjinder Singh had obtained a commercial driver’s license in California, despite having no legal right to be in the United States.\n\nIn the wake of the fatal accident, the US said it was immediately pausing all issuance of worker visas for commercial truck drivers.\n\n“The increasing number of foreign drivers operating large tractor-trailer trucks on US roads is endangering American lives and undercutting the livelihoods of American truckers,” Secretary of State Marco Rubio had said.\n\nThe Department of Transportation’s Federal Motor Carrier Safety Administration (FMCSA) had launched an investigation into the crash.\n\nHarjinder Singh failed an English Language Proficiency (ELP) assessment, providing correct responses to just two of 12 verbal questions and only accurately identifying one of four highway traffic signs.",
  "url": "https://www.hindustantimes.com/world-news/us-news/indian-man-held-for-multi-vehicle-crash-in-california-entered-us-illegally-in-2022-101758862691483.html",
  "scraped_timestamp": "2025-09-26T15:50:04.429136",
  "content_length": 3764,
  "word_count": 581,
  "source_domain": "www.hindustantimes.com"
}