{
  "title": "India, US to continue negotiations for early conclusion of trade deal: Govt",
  "content": "India and the US will continue negotiations for an early conclusion of a “mutually beneficial” bilateral trade deal, a statement said after an Indian delegation led by Union commerce minister Piyush Goyal returned after meeting with American officials.\n\nAfter concluding “constructive” meetings with senior officials of the US on Wednesday, India’s chief negotiator and special secretary Rajesh Agrawal returned on Thursday. Delegation leader Goyal returned on Friday.\n\nGoyal held meetings with US trade representative Jamison Greer and Sergio Gor, US ambassador-designate to India, the statement issued by the commerce and industry ministry said. The delegation held discussions with American officials as well as industry from September 22 to 24 .\n\n“Apart from meetings with the US Government representatives on bilateral trade matters, the delegation held discussions with key US-based businesses and investors on promoting trade and investment between India and the United States,” the statement said.\n\nAccording to the statement, the “delegation had constructive meetings with the US Government on various aspects of the deal”. “Both sides exchanged views on possible contours of the deal, and it was decided to continue the engagements with a view to achieving early conclusion of a mutually beneficial Trade Agreement.”\n\nGoyal met corporate honchos, including chief executives of Blackstone, FedEx, IBM, the Carlyle Group, and Warburg Pincus in the US. CEOs showed their keen interest in India as an attractive investment destination. HT reported it on Friday.\n\nThe statement confirmed that Goyal’s meetings with businesses and investors evoked a positive response. “The business leaders reposed confidence in the Indian growth story and expressed their desire to intensify their business activities in India,” it said.",
  "url": "https://www.hindustantimes.com/india-news/india-us-to-continue-negotiations-for-early-conclusion-of-trade-deal-govt-101758884832046.html",
  "scraped_timestamp": "2025-09-26T17:01:53.553258",
  "content_length": 1826,
  "word_count": 270,
  "source_domain": "www.hindustantimes.com"
}