{
  "title": "India",
  "content": "Arunachal Pradesh's Tawang district is developing 150 border villages under the Vibrant Village Programme to boost tourism. Significant infrastructure upgrades, including a new convention center and the Sela tunnel, are enhancing connectivity. This initiative aims to balance development with the region's fragile ecology, attracting increasing tourist numbers to areas like Mago and Chuna.\n\nUS ambassador-designate Sergio Gor met Prime Minister Narendra Modi in New Delhi. The meeting aimed to address challenges and boost India-US ties. Gor also met External Affairs Minister S Jaishankar and Foreign Secretary Vikram Misri. His appointment is seen as significant due to his close ties with President Trump.\n\nCanadian Foreign Minister Anita Anand is set to become the first minister to visit India since diplomatic relations were restored. Her trip aims to advance bilateral cooperation on trade, energy, and security, following recent efforts by both governments to mend strained ties and re-establish dialogue at various levels.\n\nPunjab Police's counter-intelligence wing in Amritsar has busted a cross-border weapon-smuggling module with Pakistan links, arresting three operatives. Eight sophisticated pistols were seized from the accused, who were supplying arms to gangsters in Punjab. Investigations revealed the weapons were dropped from across the border using drones.\n\nThe Centre clarified it had no role in Samajwadi Party chief Akhilesh Yadav's Facebook account suspension, stating Facebook acted independently due to an \"abusive post.\" Yadav questioned the suspension, citing posts on a journalist's death and a woman's suspicious death flagged as \"Adult Sexual Exploitation and Violence.\" His account was later restored.\n\nThe Supreme Court will deliver its verdict on October 13 regarding pleas for an independent investigation into the Karur stampede.  The incident tragically claimed 41 lives. The court previously questioned the Madras High Court's formation of a special investigation team.  Arguments were presented by actor Vijay's political party and the Tamil Nadu government.  The apex court's decision is awaited.\n\nNationalist Congress Party MLA Sangram Jagtap has caused controversy with his Diwali shopping appeal. He urged people to support only Hindu traders. Jagtap later linked his statement to the Pahalgam terror attack. NCP chief Ajit Pawar has strongly disapproved, calling the remarks unacceptable. The party plans to issue a show-cause notice to Jagtap for his comments.\n\nPrime Minister Narendra Modi met with US Ambassador-designate Sergio Gor in New Delhi. Modi expressed confidence that Gor's tenure will further strengthen the India-US Comprehensive Global Strategic Partnership. This meeting follows recent positive interactions between leaders of both nations. Gor is on a six-day visit to India. The visit aims to bolster bilateral relations.\n\nUS Ambassador-designate Sergio Gor met with Prime Minister Narendra Modi, highlighting the US's high regard for its relationship with India. Discussions covered bilateral issues including defense, trade, technology, and the importance of critical minerals. Gor noted President Trump considers PM Modi a great personal friend.\n\nUS Ambassador-designate to India Sergio Gor met Prime Minister Narendra Modi and top Indian officials, including EAM Dr. S. Jaishankar, NSA Ajit Doval, and Foreign Secretary Vikram Misri, during his visit to New Delhi. Gor said discussions focused on defence, trade, technology, and critical minerals, underlining the importance of strengthening strategic ties. He added that President Donald Trump and PM Modi share a great personal friendship.\n\nReliance Power's Chief Financial Officer, Ashok Pal, has resigned immediately. This follows his arrest by the Enforcement Directorate in connection with a fake bank guarantee case. Pal is accused of fund diversion and submitting forged documents. The company states it is a victim of fraud. Pal's custody has been granted to the ED for further investigation into the matter.\n\nAn explosion at a firecracker factory near Sivakasi, Tamil Nadu, on Saturday evening caused panic but was contained by workers. The blast, attributed to chemical mixing friction during fancy firework production, damaged two rooms. While authorities investigate, the incident highlights the risks in India's fireworks hub ahead of Diwali.\n\nAfghan Foreign Minister Mawlawi Amir Khan Muttaqi’s six-day India visit marks a major diplomatic step; the first formal Taliban engagement since 2021. During the visit, Muttaqi addressed students at Darul Uloom Deoband in Uttar Pradesh, emphasizing stronger India–Afghanistan relations. The visit highlights historical religious ties and signals growing cooperation in trade, security, and regional stability as both nations navigate evolving geopolitical realities.\n\nUnder the leadership of Uttar Pradesh Chief Minister Yogi Adityanath, the Uttar Pradesh Agriculture Department is actively running multiple incentive and grant programs for farmers. For the Rabi crop season, the Yogi government plans to distribute over 92,000 mini kits to enhance farmers' prosperity.\n\nThe IMD issued an orange alert for Idukki, Kannur, and Kasaragod in Kerala on Saturday, predicting very heavy rains, while Pathanamthitta, Palakkad, Malappuram, Kozhikode, and Wayanad received yellow alerts for heavy rain. Thunderstorms and gusty winds up to 40 kmph are expected due to a cyclonic circulation over the southeast Arabian Sea between October 11–15.\n\nAfghan Foreign Minister Amir Khan Muttaqi expressed optimism for stronger India-Afghanistan ties during his visit to Darul Uloom Deoband. He thanked the people for their warm reception and announced plans to send new diplomats to India, hoping for frequent future visits and enhanced bilateral relations.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-10-11T23:53:28.570347",
  "content_length": 5817,
  "word_count": 842,
  "source_domain": "economictimes.indiatimes.com"
}