{
  "title": "India",
  "content": "A UNESCO World Heritage Site, Bharatpur is one of the most popular bird sanctuaries in India. It hosts over 370 bird species, including Siberian cranes, making it a true paradise for bird watchers.\n\nThe Ministry of Foreign Affairs refuted NATO Secretary-General Rutte's claim about a conversation between Prime Minister Modi and President Putin, labeling it 'incorrect and baseless.' MEA Spokesperson Randhir Jaiswal clarified that no such conversation occurred as Rutte suggested. India urged NATO leadership to be more responsible and accurate in their public statements.\n\nKnown as the “Yoga Capital of the World,” Rishikesh offers spiritual retreats, Ganga aarti, adventure sports like river rafting, and serene ghats—all at affordable costs. Perfect for backpackers and seekers alike.\n\nThe Ministry of External Affairs holds a weekly media briefing.\n\nThe Supreme Court has temporarily suspended a High Court order that criticized the CBI director for permitting an officer outside the court-appointed SIT to investigate the adulteration of ghee used in Tirupati Temple's 'laddu prasadam'. The court questioned the issue with an officer assisting when the agency head monitors the probe.\n\nShortly after being released on bail in Canada, Khalistan separatist Inderjeet Singh Gosal, linked to the banned Sikhs for Justice (SFJ), threatened India and pledged to support Gurpatwant Singh Pannun's Khalistan referendum. Pannun also released a video challenging India's National Security Advisor Ajit Doval.\n\nUN Resident Coordinator in India, Shombi Sharp, highlights India’s rising role in global peace, development, and climate action. Citing PM Modi’s leadership and EAM Dr. S. Jaishankar’s G20 remarks, Sharp emphasizes India’s contributions to UN peacekeeping, renewable energy innovation, food security, and South-South cooperation. She underlines that peace and development are inseparable and applauds India’s advocacy for equitable solutions for the Global South, calling for a united world under the spirit of Vasudhaiva Kutumbakam.\n\nClimate activist Sonam Wangchuk was arrested by Ladakh Police following violent protests in Leh, where demonstrators demanded statehood and Sixth Schedule inclusion, resulting in four deaths. The arrest, led by DGP S D Singh Jamwal, occurred after the Union Home Ministry revoked SECMOL's FCRA license due to alleged financial discrepancies and accusations of instigating youth with protest references.\n\nTelangana is embarking on an ambitious project, Bharat Future City (BFC), a 30,000-acre greenfield development envisioned as India's first net-zero urban space. Located near Hyderabad, BFC aims to blend sustainability with economic growth, featuring zones for green manufacturing, technology, and education.\n\nMCD is planning to set up Delhi’s first night-life street food market near Salimgarh Fort. It aims to host 50 vendors from 6 pm to 10 pm. Here are seven night markets in India beloved for their late night bites and local cuisine.\n\nA large group of Antop Hill residents halted a Mumbai CSMT-bound local train on the Harbour Line near Wadala station on Friday afternoon. The protesters, numbering in the hundreds, were demonstrating against the installation of mobile towers on the rooftops of their slums, claiming they were illegal and posed a radiation risk.\n\nDelhi is set to undergo a significant administrative restructuring, increasing to 13 revenue districts and 39 sub-divisions. Chief Minister Rekha Gupta approved the plan to streamline governance by aligning MCD zones with revenue districts, aiming to eliminate jurisdictional overlaps and improve inter-departmental coordination. The realignment seeks to enable quicker redressal of citizens’ grievances and faster delivery of services.\n\nSri Lanka's envoy highlighted the strengthened ties between India and Sri Lanka, reaching \"unprecedented excellence\" following recent visits by both countries' leaders. With Sri Lanka's economy stabilizing and recovering, significant opportunities for collaboration with India are emerging. The enduring relationship, rooted in history, culture, and trade, positions India as Sri Lanka's closest neighbor and natural business partner.\n\nThey Call Him OG released on September 25, 2025 and registered the year’s strongest Day 1 in India. Early estimates suggest day 1 collection earned more than ₹90 crore, highest in 2025.\n\nExternal Affairs Minister S. Jaishankar, speaking at the India–SICA (Sistema de la Integración Centroamericana or Central American Integration System ) Foreign Ministers’ Meeting in New York, stressed India’s deepening engagement with Central American nations. He highlighted opportunities for Indian investments in agriculture, renewable energy, pharmaceuticals, and IT within SICA economies. Dr. Jaishankar also promoted the adoption of India’s UPI digital payments system to strengthen financial ecosystems, reaffirming India’s commitment to South-South cooperaton\n\nRani Mukerji is a timeless style icon whose saree looks are perfect for Durga Puja celebrations. From bold reds to understated whites, her choices combine tradition with glamour. Here are six stunning saree inspirations you can recreate to channel your inner Bollywood diva this festive season. Each look brings its own personality and elegance, making it easy to pick one that suits your style.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-09-26T17:01:44.611064",
  "content_length": 5340,
  "word_count": 772,
  "source_domain": "economictimes.indiatimes.com"
}