{
  "title": "India",
  "content": "From breezy sarees to glamorous lehengas, Bollywood stars are proving that yellow is the ultimate festive color. This sunshine shade radiates warmth, confidence, and joy, perfect for Diwali and other celebratory occasions. Let’s take a closer look at six unforgettable yellow looks that are bound to inspire your festive wardrobe this season.\n\nThis story explains using moringa leaf powder and seed oil for stronger hair: weekly scalp oiling, pre‑wash protection, DIY masks, daily nutrition doses, and safety—plus how to pair moringa with protein, sleep, and gentle styling for visible results in 8–12 weeks.\n\nIndia's Prime Minister Narendra Modi met with Mongolian President Khurelsukh Ukhnaa in New Delhi. Modi announced free e-visas for Mongolian citizens. He highlighted India's role as a steadfast partner in Mongolia's development, citing the USD 1.7 billion oil refinery project. The leaders emphasized the spiritual and diplomatic bonds between the two nations, rooted in Buddhism.\n\nPrime Minister Narendra Modi inaugurated Google's first AI hub in Visakhapatnam, Andhra Pradesh, hailing it as a significant step towards democratizing technology and enabling 'AI for All'. This multi-faceted investment, including gigawatt-scale data center infrastructure and a new international subsea gateway, aligns with India's vision for a developed nation and aims to boost the digital economy.\n\nThe Supreme Court has adjourned the hearing on a plea challenging Sonam Wangchuk's detention under the National Security Act to October 15. His wife, Gitanjali J Angmo, is seeking his immediate release and questioning the NSA's invocation. Wangchuk was detained on September 26 following violent protests in Ladakh.\n\nThe Supreme Court will hear AIMIM leader Asaduddin Owaisi's plea on October 28, seeking an extension for mandatory registration of all waqf properties on the UMEED portal. The six-month registration period is nearing its end, prompting the urgent request for more time. This follows a previous interim order that stayed some provisions of the Waqf (Amendment) Act, 2025.\n\nTwo more Assamese expats, Abhimanyu Talukdar and Tanmoy Phukan, appeared before the Assam Police's CID on Tuesday, who are investigating the death of cultural icon Zubeen Garg in Singapore. They were present on the yacht when Garg died while swimming on September 19. So far, seven Assamese NRIs have deposed, with four more yet to appear.\n\nYour kidneys thrive on steady hydration, low sodium, balanced potassium, and antioxidant‑rich foods. This story highlights five everyday food choices that support filtration, blood pressure, and vascular health as part of a balanced diet.\n\nUnion Home Minister Amit Shah attended the 41st NSG Foundation Day celebration in Haryana. He commended the National Security Guard for its exceptional role in counter-terrorism operations and dedication to national security.\n\nBollywood stars make casual denim look effortlessly stylish. From day outings to brunch dates, these celeb-inspired outfits show how to elevate your everyday denim. Steal their looks to add a chic vibe to your wardrobe.\n\nPrime Minister Narendra Modi and Mongolian President Khurelsukh Ukhnaa addressed a joint press meet in New Delhi, reaffirming strong cultural and strategic ties between India and Mongolia. The leaders discussed cooperation in trade, energy, and Buddhism-linked heritage projects.\n\nFive simple, food‑based drinks that align with cardiology‑recommended eating patterns to support healthy blood pressure to the heart and prevent clogging of arteries. This can prevent possible natural heart attacks if complemented with proper diet and exercise.\n\nAt the United Nations Troop Contributing Countries’ (UNTCC) Chiefs’ Conclave, Army Chief General Upendra Dwivedi highlighted India’s contribution of over 3 lakh peacekeepers across 51 UN missions, reaffirming the nation’s role in promoting global peace and cooperation. Addressing emerging challenges like hybrid warfare, disinformation, and non-state actors, he called for unified and resilient responses while praising the “blue helmets” as the glue that holds peacekeeping missions together.\n\nAfghanistan Foreign Minister Amir Khan Muttaqi, during a round-table interaction with FICCI, said that peace has returned to Afghanistan after 45 years and trade with India has crossed $1 billion. He expressed hope for deeper economic and diplomatic ties as both nations explore new connectivity routes, including direct flights to Kabul and Kandahar.\\\n\nIn a recent social media post, Dermatologist Suganya Naidu shared specific seeds for supporting various issues. For hairfall she suggested including pumpkin seeds in your diet, as they help block hormones that trigger hairfall and provide essential nutrients for stronger strands.\n\nIndian Mertrological Department's October 12 bulletin signals persistent rain and thunderstorms over the southern peninsula from Oct 13–18, including Kerala, Tamil Nadu, south interior Karnataka, coastal Andhra, Yanam and Telangana. Gusty winds of 30–40 km/h possible in several coastal and adjoining districts on select days.",
  "url": "https://economictimes.indiatimes.com/news/india",
  "scraped_timestamp": "2025-10-14T15:10:50.169682",
  "content_length": 5114,
  "word_count": 748,
  "source_domain": "economictimes.indiatimes.com"
}