{
  "title": "Infrastructure",
  "content": "The Indian government has opened the PM GatiShakti portal to the private sector. This move aims to help businesses optimize last-mile delivery services and develop infrastructure-based applications. The platform provides access to geospatial data for planning and investment decisions. It covers various infrastructure assets, enabling better project design and coordination.\n\nThe DPIIT launched PM GatiShakti-Offshore, a digital platform for integrated planning of offshore projects like wind farms and marine exploration. This initiative aims to strengthen India's Blue Economy and support sustainable coastal growth. Additionally, the Logistics Excellence, Advancement, and Performance Shield (LEAPS) 2025 was launched to benchmark logistics excellence and enhance India's competitiveness.\n\nThe Indian government has opened its PM Gati Shakti portal to the private sector. This move aims to boost last-mile delivery services and infrastructure development. Private entities can now access crucial data for planning and investment. This initiative supports better project design and coordination. It will also aid informed decisions in healthcare, disaster management, and agriculture sectors.\n\nIndia's cities are growing rapidly, creating economic opportunities and demanding new homes and services.  While government spending on infrastructure is increasing, challenges like traffic, pollution, and housing shortages persist.  Emerging cities and improved connectivity are key to future development.  The next 25 years will shape India's urban future, aiming for livable and inclusive growth.\n\nStarting November 15, vehicles without functional FASTags will incur a 1.25 times user fee if paid via UPI, a significant reduction from the 2 times charge for cash payments. This amendment to the National Highways Fee Rules aims to boost digital transactions and streamline toll collection, enhancing transparency and commuter convenience on national highways.\n\nAssam's first underwater tunnel project, connecting Numaligarh and Gohpur at a cost of ₹6,000 crore, has completed its detailed project report. This strategically vital greenfield initiative, India's first road tunnel beneath a major river, is expected to receive Union cabinet approval shortly. The 33.7 km project, crucial for defence-security, is envisaged for completion in five years.\n\nThe sign boards will have ‘Quick Response (QR) Codes’ and will be installed along the National Highway stretches to provide relevant project specific information and emergency helpline numbers to National Highway commutes, a move aimed at enhancing transparency and provide ‘ease of commuting\n\nIndia is considering a Rs 20,000 crore risk guarantee fund for its infrastructure sector, managed by NCGTC. This initiative aims to attract private investment by covering development and non-commercial risks, crucial for meeting the USD 4.51 trillion infrastructure spending target by 2030. The fund seeks to boost economic growth and the 'Make in India' initiative.\n\nEPC player Ceigall India, in a joint venture with JSP Projects, has secured a Rs 509.20 crore infrastructure project from the Greater Mohali Area Development Authority (GMADA). The contract involves constructing internal roads and associated civil, public health, and electrical works in Mohali, to be completed within 24 months. This project aims to enhance connectivity and sustainable urban development.\n\nPrime Minister Modi reviewed eight infrastructure projects across 15 states, totaling Rs 65,000 crore, via the PRAGATI platform. He stressed result-oriented approaches, urging officials to resolve bottlenecks promptly and improve citizens' quality of life. Modi also emphasized the importance of states institutionalizing project review mechanisms and focusing on reforms to enhance competitiveness and innovation.\n\nCreditors, led by State Bank of India, are poised to receive over ₹5,500 crore this month as the debt resolution of Chenani Nashri Tunnelway (CNTL), a major IL&FS asset, nears completion. Cube Highways and Infrastructure will provide the funds, marking a significant recovery for secured creditors like SBI, Deutsche Bank and Canara Bank.\n\nThe four-lane greenfield project to improve connectivity between Patna and Bettiah. It will link north Bihar districts of Vaishali, Saran, Siwan, Gopalganj, Muzaffarpur, East and West Champaran. It will also link areas along the Nepal-Bihar border.\n\nBitumen demand in India rebounded sharply in August, surging 47% after a monsoon-induced slump in previous months, driven by renewed road construction activity. Consumption reached 0.42 million metric tonnes, with imports increasing significantly to meet about a third of the demand. This recovery signals a positive trend after a period of decline.\n\nIndia requires a substantial $4.5 trillion infrastructure investment by 2030 to maintain its desired growth. Sivasubramanian Ramann highlighted the shift in financing from banks to pension and insurance funds, better suited for long-term projects. Regulatory reforms and wider use of credit enhancement schemes are expected to boost credit flow and bond issuance for infrastructure companies.\n\nIndia's pension regulator considers boosting infrastructure investments. This follows the government's launch of a credit enhancement program for infrastructure bonds. The program, operated by Nabfid, aims to improve bond ratings. This attracts investors like pension and insurance companies. Infrastructure is crucial for Prime Minister Modi's economic goals. The sector needs significant debt financing in the coming years.\n\nICRA projects road monetisation of ₹35,000–40,000 crore in FY26, up from ₹24,399 crore in FY25, if NHAI assets are sold on time. The target surpasses the ₹30,000 crore budget estimate. NHAI has raised ₹92,633 crore since FY19 through TOT and InvIT. With 3,750 km yet to be monetised, total proceeds could reach ₹1.3 lakh crore.",
  "url": "https://economictimes.indiatimes.com/news/economy/infrastructure",
  "scraped_timestamp": "2025-10-15T09:50:57.211883",
  "content_length": 5927,
  "word_count": 843,
  "source_domain": "economictimes.indiatimes.com"
}