{
  "title": "INS Udaygiri and Himgiri: Major defence boost for India as Navy commissions two stealth frigates",
  "content": "In a major boost to India’s ‘Aatmanirbhar‘ dream and country’s defence sector, the Indian Navy on Tuesday commissioned two stealth frigates Udaygiri and Himgiri at Visakhapatnam Naval Base. Defence Minister Rajnath Singh attended the commissioning and was accorded a ceremonial Guard of Honour on his arrival at the Naval Base Visakhapatnam.\n\nThis was also the first occasion when two frontline surface combatants, constructed at two different shipyards, were commissioned simultaneously. The two frigates will join the Eastern Fleet, strengthening India’s ability to safeguard its maritime interests across the Indian Ocean Region.\n\n#WATCH| Visakhapatnam, Andhra Pradesh: Raksha Mantri Rajnath Singh says, \"… The commissioning of INS Udayagir and INS Himgiri is a visual depiction of our dream of a self-reliant India coming true. It is also proof of our vision and commitment. I congratulate the Indian Navy… https://t.co/F9ahTPp8v3pic.twitter.com/NJbjS1KynX\n\nBoth frigates have been named after earlierINSUdaygiri (F35) and INS Himgiri (F34) that served the nation with distinction for over 30 years before being decommissioned, Ministry of Defence said in an official release.\n\nSpeaking on the occasion, Rajnath Singh said that the commissioning is “picture of the dream of Atmanirbhar Bharat coming true. At the same time, it is also proof of our vision and commitment.”\n\nThe MoD said that Udaygiri and Himgiri are follow on ships of the Project 17 (Shivalik) class frigates. Both these vessels incorporate significant improvements in design, stealth, weapon and sensors systems and are capable of executing full spectrum of maritime missions in Blue Water conditions.\n\nUdaygiri has been built by Mazagon Dock Shipbuilders Ltd. (MDL), Mumbai, and Himgiri by Garden Reach Shipbuilders & Engineers (GRSE), Kolkata. They “showcase the nation’s growing shipbuilding prowess, as well as, the synergy between India’s premier defence shipyards,” the ministry said.\n\nAs for Udaygiri, it also holds the distinction of being the fastest ship of her class to be delivered post-launch, a result of the modular construction methodology adopted by Indian shipyards.\n\nThe commissioning of the new Udaygiri and Himgiri thus honours the legacy of their forebearers while ushering in a new era of capability, the ministry said. Both ships were designed in-house by the Indian Navy’s Warship Design Bureau (WDB), and notably, Udaygiri is the 100th ship designed by the WDB.\n\nThe ships feature modern Combined Diesel or Gas (CODOG) propulsion plants, state of the art Integrated Platform Management System and a suite of advanced weapons and sensors developed by Indian manufacturers. The ships, with about 75% indigenous content, supported by hundreds of indigenous MSMEs, align with the Government’s vision of Aatmanirbhar Bharat in defence manufacturing, it added.",
  "url": "https://www.financialexpress.com/business/defence/ins-udaygiri-and-himgiri-major-defence-boost-for-india-as-navy-commissions-two-stealth-frigates/3958192/",
  "scraped_timestamp": "2025-10-15T10:37:49.052323",
  "content_length": 2852,
  "word_count": 427,
  "source_domain": "www.financialexpress.com"
}