{
  "title": "Internet suspended in Leh after activist Sonam Wangchuk's arrest",
  "content": "Internet services have been suspended in Leh after activistSonam Wangchuk was arrestedon Friday. The internet blockade comes two days after Leh witnessed violent clashes between police and protesters demanding statehood for Ladakh.\n\nFour people were killed and at least 80 others suffered injuries in the clashes on Wednesday. Headquarters of the Bharatiya Janata Party (BJP) was also set ablaze.\n\nAlso Read:From hunger strike to FCRA cancellation: What led to Sonam Wangchuk's arrest\n\nMeanwhile, the Apex Body Leh, which is leading the agitation for statehood for Ladakh, has distanced itself from the violence of September 24 saying that their protest is peaceful and that the violence was triggered when a section of the youth got out of control.\n\nThe organisation denied activist Sonam Wangchuk's role in the violence in Leh during his ongoing hunger strike.\n\n\"Our movement will be peaceful and nonviolent to disseminate this, we started prayers of all the religions. When Sonam Wangchuk started the Hunger Strike, a few people were there. We used to call people from villages. We called for a Leh Bandh on September 24.\"\n\nAlso Read:What is FCRA? Explained as MHA revokes license of Sonam Wangchuck's NGO\n\nThe Apex Body Leh member said that despite senior leaders' attempts to control protestors, they vandalised the BJP's office.\n\nA home ministry team held a series of meetings in Leh to review the overall security situation. Meanwhile, the curfew remained in force for the third consecutive day in Leh town on Friday. Officials said that no untoward incident was reported in Ladakh two days after violent protests.\n\nThe curfew was clamped in the town on Wednesday evening after widespread violence resulted in the death of four persons and injuries to 90 others.",
  "url": "https://www.hindustantimes.com/india-news/internet-snapped-in-leh-after-activist-sonam-wangchuks-arrest-101758881784353.html",
  "scraped_timestamp": "2025-09-26T18:03:40.761711",
  "content_length": 1769,
  "word_count": 284,
  "source_domain": "www.hindustantimes.com"
}