{
  "title": "Iran slams Trump for contradictory actions after ‘cooperation’ remark in Knesset speech",
  "content": "Iran said on Tuesday that US President Donald Trump's call for a peace deal with Tehran was inconsistent with Washington's actions, referring to its strikes on Iranian nuclear sites in June.\n\n\"The desire for peace and dialogue expressed by the US president is at odds with the hostile and criminal behaviour of the United States towards the Iranian people,\" the foreign ministry said in a statement.\n\nIn mid-June, Israel launched an unprecedented bombing campaign on Iran, striking nuclear and military facilities as well as residential areas and killing more than 1,000 people.\n\nThe 12-day war with Israel, during which the US struck the key nuclear facilities in Iran, derailed high-level nuclear talks between Tehran and Washington.\n\nIran retaliated with missile and drone attacks that killed dozens in Israel. A ceasefire between Iran and Israel has been in place since June 24.\n\nDuring a Monday speech at the Israeli Knesset, Trump said he wanted a peace deal with Iran and that the ball was in Tehran's court for any agreement to come to pass.\n\n\"How can one attack the residential areas and nuclear facilities of a country in the midst of political negotiations, kill more than 1,000 people including innocent women and children, and then demand peace and friendship?\" the foreign ministry asked.\n\nTrump also said \"nothing would do more good\" for the region than for Iran's leaders \"to renounce terrorists, stop threatening their neighbours, quit funding their militant proxies, and finally recognise Israel's right to exist\".\n\nTehran struck back, calling the remarks \"irresponsible and shameful\" and accusing the United States of being \"a leading producer of terrorism and a supporter of the terrorist and genocidal Zionist regime\".\n\n\"The United States... has no moral authority to accuse others,\" Iran's foreign ministry said.",
  "url": "https://www.hindustantimes.com/world-news/iran-slams-trump-for-contradictory-actions-after-cooperation-remark-in-knesset-speech-101760421175943.html",
  "scraped_timestamp": "2025-10-14T15:45:32.046634",
  "content_length": 1834,
  "word_count": 291,
  "source_domain": "www.hindustantimes.com"
}