{
  "title": "Israeli hostages and Palestinian detainees released as mediators sign Trump’s Gaza ceasefire deal",
  "content": "• US President Donald Trump and Gaza ceasefire mediators havesigned a dealat a summit in Egypt attended by world leaders. Trumphailed a “historic dawn of a new Middle East”in remarks before the Israeli parliament.\n\n• The signing came after Hamas returned the 20 remaining living hostages in Gazato Israeland handed overthe remainsof four dead hostages. 250 Palestinian prisoners andover 1,700 detainees from Gaza,held by Israel for two years without charge, have now been released.\n\n• The freed hostages tearfully reunited with their familiesin hospitals across Israel, while releasedPalestinian prisoners embraced relativesin the West Bank and detaineesarrived in buses to large crowds in Gaza.\n\nOur live coverage has ended for the day.You can read here for Tuesday’s live coverage from the Middle East .\n\nCNN’s Brett McGurk analyzes the complicated questions facing Israel and Gaza after the ceasefire signing.\n\nClick here to watchMcGurk’s analysis on TikTok.\n\nPresident Donald Trump declined to directly address whether he supports recognizing a Palestinian state after he and several other world leaders signeda Gaza ceasefire dealduring a summit in Egypt earlier today.\n\n“I’m not talking about single state or double state or two state, we’re talking about the rebuilding of Gaza,” Trump told reporters aboard Air Force One during his return flight from the Middle East.\n\n“A lot of people like the one-state solution. Some people like the two-state solutions. We’ll have to see,” he said, adding, “I haven’t commented on that.”\n\nEgyptian President Abdel Fattah el-Sisi, speaking at the summit ahead of Trump, emphasized the urgency of the moment, calling it a “unique, perhaps last, historic opportunity to achieve a Middle East free of anything that threatens its stability and progress.” He reaffirmed that a two-state solution “must be achieved in a manner that ensures ensures our shared vision of embodying joint cooperation among the peoples of the region, and cooperation among all countries.”\n\nTrump’s reluctance to weigh in comes just weeks after he criticized growing international support for Palestinian statehood.\n\nLast month during a speech at the United Nations General Assembly, the US president referred to the momentum behind a two-state solution as a “reward” for Hamas.\n\nUS President Donald Trump on Monday welcomed formerPresident Bill Clinton’s praisefor his role in brokering the Gaza ceasefire deal, calling it “very nice” while speaking to reporters aboard Air Force One.\n\n“I thought it was very nice, actually. And what is he doing? He’s telling the truth,” Trump said on his way back to Washington, DC, from the Middle East.\n\nTrump quickly reflected on his past relationship with Clinton, saying, “I’ve always gotten along with him. He used to be a friend of mine, came to my wedding, you know, so did she,” in an apparent reference to the former first lady and his 2016 Democratic rival,Hillary Clinton. “People don’t know that, but I’ve always liked him,” he added.\n\n“President Trump and his administration, Qatar, and other regional actors deserve great credit for keeping everyone engaged until the agreement was reached,” Bill Clinton wrote in a statementposted on Xearlier in the day.\n\nClinton also said that Israel and Hamas “must try to turn this fragile moment into lasting peace that provides for the dignity and security of both Palestinians and Israelis.”\n\nThe former president’s comments are notable as he attempted to negotiate peace in the region, but ultimately failed to, during his time in office.\n\nFor a few fleeting moments as the world’s attention turned to a global summit in the small Egyptian resort town of Sharm el-Sheikh, there was hope that US President Donald Trump might give clarity to his plan for “peace in the Middle East.”\n\nBut the US leader left the region with the same unanswered questions as when he arrived.\n\nThe first phase of Trump’s Gaza plan succeeded on Monday, securing the release of hostages, freeing Palestinian prisoners and stopping the fighting in Gaza. The more complex second phase, dismantling Hamas and determining Gaza’s governance – has yet to be negotiated.\n\nAmong the pressing issues: what the next phase of negotiations on Gaza will look like; who will make up the multinational force to keep the peace and what its mandate is; and whether a Palestinian state will ever be formed.\n\nThat such a large summit could even be organized as quickly as it was underlined the eagerness of key Arab countries to keep up the momentum for diplomacy and keep Trump engaged.\n\nBut amid the haste, the summit was clouded by vagueness. Vagueness about the conference’s agenda, about what Trump planned to announce, and even as to who the participants would be.\n\nOne of the biggest surprises was Palestinian Authority President Mahmoud Abbas shaking hands with Trump – the same man who just weeks ago revoked his US visa, preventing him from physically attending the UN General Assembly in New York.\n\nBut perhaps the most striking outcome was the document signed by Trump and the mediators in which the US president guaranteed his commitment to the end of war in Gaza.\n\nThe details may yet be vague, but at least now that commitment is in writing.\n\nFormer President Joe Biden issued a statement Monday expressing deep relief and gratitude following the release of the last 20 living hostages and the announcement of a renewed ceasefire in Gaza.\n\n“I am deeply grateful and relieved that this day has come – for the last living 20 hostages who have been through unimaginable hell and are finally reunited with their families and loved ones, and for the civilians in Gaza who have experienced immeasurable loss and will finally get the chance to rebuild their lives,” Biden wrote ina post on X.\n\nIn a rare show of acknowledgment, Biden commended President Donald Trump for helping broker the agreement, while noting his own administration’s efforts to end the war.\n\n“The road to this deal was not easy. My Administration worked relentlessly to bring hostages home, get relief to Palestinian civilians, and end the war. I commend President Trump and his team for their work to get a renewed ceasefire deal over the finish line,” he said.\n\n“Now, with the backing of the United States and the world, the Middle East is on a path to peace that I hope endures and a future for Israelis and Palestinians alike with equal measures of peace, dignity, and safety,” Biden concluded.\n\nOn October 7, 2023, 251 people from Israel were kidnapped during a Hamas-led attack. The last 20 hostages who were still alive were released today.\n\nFour deceased hostages were also returned to Israel. They have yet to be formally identified although Hamashad named four Israelisit was returning to Israel.\n\nLearn more about these freed hostages here.\n\nScenes of celebration and heartfelt reunions took place Monday across Israel, Gaza, and the occupied West Bank as Israeli hostages held by Hamas and Palestinian prisoners and detainees jailed in Israel were released as part of the historic ceasefire agreement.\n\nWatch CNN’s Jeremy Diamond’s full report:\n\nEmotional reunions took place as Israeli hostages returned to their families and loved ones on Monday.\n\nMeanwhile, in Gaza and the West Bank, Palestinian prisoners and detainees were greeted by jubilant crowds after being released from Israeli prisons.\n\nThe White Housereleased the agreementsigned in Egypt earlier Monday aimed at reaching peace in the Middle East, titling it the “Trump Peace Agreement.”\n\nThe declaration, signed by US President Donald Trump alongside regional leaders President Abdel Fattah el-Sisi of Egypt, Emir Tamim bin Hamad Al-Thani of Qatar and President Recep Tayyip Erdoğan of Turkey, celebrates what it calls a “truly historic commitment” by all parties to implement the agreement.\n\nThe document emphasizes a commitment to ending over two years of conflict and lays out a vision of the region defined by “hope, security, and a shared vision for peace and prosperity,” but it is scant on details.\n\n“We understand that lasting peace will be one in which both Palestinians and Israelis can prosper with their fundamental human rights protected, their security guaranteed, and their dignity upheld,” the agreement reads.\n\nThe deal reaffirms a desire to resolve future disputes through diplomacy rather than prolonged conflict, saying: “This is a new chapter for the region.”\n\nUS President Donald Trump made bold statements about the future of the Middle East during the consequential summit in Sharm el-Sheikh, Egypt, where the papers for a ceasefire agreement were signed.\n\nBut he offered scant specifics on how the agreement would deal with the region’s thornier issues.\n\nIt remains unclear who will deploy the troops that make up Trump’s proposed “international stabilization force” or what their mandate and rules of engagement will be.\n\nInstead, Trump largely focused on the rebuilding of Gaza in his remarks on Monday.\n\nSome world leaders in attendance heaped fulsome praise on Trump during the summit, but did not appear to get the momentum they sought to quickly transition the ceasefire to a lasting peace.\n\nHowever, it was perhaps more notable who was absent.\n\nMohamed bin Zayed, the president of the United Arab Emirates, and Crown Prince Mohammed bin Salman of Saudi Arabia – two of the most prominent regional players – did not attend the summit but instead dispatched senior officials.\n\nBoth have dug in deeply on the issue of a Palestinian state and have become increasingly disenchanted with working with Israeli Prime Minister Benjamin Netanyahu.\n\nA convoy of vehicles carrying the remains of four hostages has arrived at the National Institute for Forensic Medicine in Tel Aviv.\n\nFormer President Bill Clinton gave credit to President Donald Trump and regional actors in a statement released after the signing of the Gaza ceasefire agreement.\n\n“President Trump and his administration, Qatar, and other regional actors deserve great credit for keeping everyone engaged until the agreement was reached,” Clinton wrote in a statementposted on X.\n\nClinton also said that Israel and Hamas “must try to turn this fragile moment into lasting peace that provides for the dignity and security of both Palestinians and Israelis.”\n\nThe former president’s comments are notable as he attempted to negotiate peace in the region, but ultimately failed to, during his time in office.\n\nFormer Presidents George W. Bush and Joe Biden have yet to publicly comment on the agreement. Barack Obamasaid last weekafter the deal was announced that “we should all be encouraged and relieved that an end to the conflict is within sight,” but did not mention Trump.\n\nPalestinian American Hani Almadhoun said his parents who live in Gaza got some fruits for the first time.\n\n“And that was a big deal. You know, the bar is so low now. It doesn’t take much to make the Palestinians smile,” Almadhoun, senior director of philanthropy at UNRWA USA,  told CNN after speaking to his parents today.\n\nAbout 50% of their family home is livable, he shared, saying his family feels lucky.\n\n“Basically the walls are gone, but the roof is still standing. So they’re going to figure out how to engineer the heck out of it. So they could survive in the winter, in the cold,” he said.\n\nAlmadhoun, who is also the co-founder of Gaza Soup Kitchen, and said he knows that while his crews in Gaza are smiling, singing and celebrating, their homes are lost.\n\nHe also lost two siblings in the war.\n\n“They have not had a proper burial because of the bombs and all that. And we don’t know where my brother is buried anymore because everything is ashes,” he said.\n\nAs the Gaza ceasefire deal continues to take hold, he said fear and uncertainty remain.\n\n“There is a lot of emotions to process. I hope the Palestinians and the Israelis find a way forward. And I, and I appreciate the US, my adopted home, that pushed for this deal,” he said. “The Israelis are happy, and the Palestinians can catch their breath.”\n\nUS President Donald Trump emphasized the historic nature of the Gaza ceasefire deal on Monday as he anda host of other world leaderswere in the Egyptian resort city Sharm el-Sheikh to sign an agreement.\n\nEarlier in the day, Trump hailed the “dawn of a new Middle East” duringhis addressbefore the Knesset, the Israeli parliament.\n\nIt comes as all the living Israeli hostages held in Gaza were released and reunited with their loved ones. Crowds in Gaza, meanwhile, celebrated the release ofmore than 1,700 Palestinian detaineesfreed as part of the deal.\n\nIf you’re just joining us, here’s what to know to get up to speed:\n\nCNN’s Caitlin Danaher, Ivana Kottasová, Becky Anderson, Mostafa Salem, Tim Lister, Dana Karni, Kara Fox, Alayna Treene, Kit Maher and Samantha Waldenberg contributed reporting to this post.\n\nMore than two dozen countries were represented at the Gaza summit in Egypt on Monday, as US President Donald Trump and other world leaders signeda ceasefire deal.\n\nAccording to a list obtained by CNN from a White House official, the summit drew participation from key global and regional players, including the Arab League secretary general, the UN secretary general, the European Union and other major countries.\n\nDuring his address, the president acknowledged the broad turnout,calling out the namesof world leaders and senior diplomats in the crowd, at times asking them to stand if he couldn’t spot them immediately.\n\nWrapping up his remarks, the president thanked all attendees for their swift response in coming together. “The greatest deals happen that way,” he said.\n\nHere is the list of nations and others represented:Armenia, Azerbaijan, Bahrain, Canada, Cyprus, Egypt, the European Union, France, Germany, Greece, Hungary, India, Indonesia, Iraq, Italy, Japan, Jordan, Kuwait, the Netherlands, Norway, Oman, Pakistan, the Palestinian Authority, Paraguay, Qatar, Saudi Arabia, Spain, Turkey, the United Arab Emirates and the United Kingdom.\n\nAlso in attendance:Arab League Secretary General Ahmed Aboul Gheit, UN Secretary General António Guterres, FIFA President Gianni Infantino and former British Prime Minister Tony Blair.\n\nUS President Donald Trump marked the signing of the Gaza ceasefire deal bypraising partnersinvolved during remarks from Sharm el-Sheikh, Egypt, while also laying out a vision of hope for the Middle East.\n\n“This is the day people across the region and around the world have been working, striving, hoping and praying for,” Trump said. “They have done things over the last month that I think were really unthinkable. Nobody thought this could happen.”\n\nThe US presidentis now on his way backto the United States.\n\nIf you’re just joining us, here are key moments from his remarks following today’s signing:\n\nCongratulating partners:“I want to congratulate everybody sitting in these first few rows and standing behind me,” Trump said. He spent a considerable amount of timepersonally thanking leadersfrom countries such as Egypt, Pakistan, Hungary and the European Union.\n\nPlans for Gaza:“And for the people of Gaza, the focus now must be on restoring the basics of a good life. We’re going to have a lot of money coming into Gaza and a lot of rebuilding and building,” Trump said, noting that numerous countries of “great wealth and power and dignity” have come forward and said, “they want to help in the reconstruction of Gaza.” Trump also addressed the caveat that “Gaza’s reconstruction requires that it be demilitarized and that a new honest civilian police force must be allowed to create a safe condition for the people in Gaza.”\n\nBoard of Peace:The US president also touched on the creation of the supervisoryBoard of Peace, which is part of his ceasefire plan. “We’re going to put some of you on the Board of Peace. Everybody wants to be on the Board of Peace,” Trump said. The plan calls for a temporary transitional government to be established in Gaza and supervised by “a new international transitional body” called the Board of Peace.\n\nIsraeli hostages:Trump described witnessing hostages reuniting with their families. “The level of love and sorrow. I’ve never seen anything like it,” he said. Trump said it was “amazing” to see hostages reuniting with their mothers and fathers, who they haven’t seen “in such a long time.”\n\nCNN’s Christian Edwards, Elise Hammond and Kit Maher contributed to this report.\n\nAfter the agreement for a Gaza ceasefire was signed in the Red Sea resort of Sharm el-Sheikh, Egypt’s leader Abdel Fattah el-Sisi called on the Israeli people to make “this historic moment” a new beginning for a better future in the region.\n\n“As I seize this opportunity, I address a call to the people of Israel, saying: Let us make this historic moment a new beginning for a life governed by justice and peaceful coexistence. Let us look forward to a better future for our children together,” Sisi said.\n\nThe Egyptian president was addressing world leaders attending Monday’s summit with US President Donald Trump, shortly after signing a document formalizing the Gaza ceasefire, also brokered the previous week in Sharm el-Sheikh.\n\n“Mr. President, let the Gaza war be the last war in the Middle East,” Sisi said, addressing Trump.\n\nSisi told Trump during a meeting earlier on Monday that the United States plays an “essential” role in achieving peace in the region, according to the Egyptian president’s office.\n\nThe Egyptian leader also said that making peace “requires exceptional figures capable of taking and implementing courageous initiatives similar to President Trump.”\n\nThe coffins of the four deceased hostages are now in Israel, according to police, and being escorted by the Israel Defense Forces (IDF) and the Israel Security Agency (ISA) to be formally identified at the National Institute of Forensic Medicine in Tel Aviv.\n\nAfter identification, their families will be notified immediately, the IDF and ISA said in a joint statement Monday.\n\nHamas said earlier that it wouldreturn the bodiesof hostages Daniel Peretz, Yossi Sharabi, Guy Illouz, and Bipin Joshi on Monday.\n\nBefore crossing into Israeli territory, the IDF soldiers staged a ceremony in which they draped the hostages’ coffins with Israeli flags, saluted them, and recited a chapter from the Book of Psalms, according to their statement.\n\nReleased hostage Avinatan Or wrapped his arms around his parents, Yaron and Ditsa, at the Rei’m military facility, southern Israel, in footage published by the Israeli military on Monday.\n\n“How much I hoped I would get the chance to tell you that I love you and to see you one more time in this life,” said the 29-year-old man, who was released by Hamas on Monday.\n\nVideo published by the Israeli military also showed Or hugging his girlfriend, Noa Argamani, who was also captured at the Nova music festival during Hamas’s October 7, 2023, attacks.\n\nWidely circulated footage of her kidnapping showed her being hoisted onto the back of a motorcycle and driven away as Or was apprehended and made to walk with his hands behind his back.\n\nArgamani wasrescuedin an Israeli military operation in central Gaza inJune, 2024.\n\nEarlier this month, Argamani recalled the “last time” she saw her partner, in a poston X.\n\n“I miss Avinatan more with every passing day,” she said. “I hold onto hope, every single day, that this nightmare will end soon, and we’ll finally get to live the life we’ve dreamed of.”",
  "url": "https://edition.cnn.com/world/live-news/israel-hamas-gaza-hostages-ceasefire-10-13-25",
  "scraped_timestamp": "2025-10-14T15:46:46.431540",
  "content_length": 19397,
  "word_count": 3147,
  "source_domain": "edition.cnn.com"
}