{
  "title": "Israelis await release of hostages as Palestinians start to return home in Gaza",
  "content": "•Happening now:Israelis arerallying in Tel Avivasfamilies of hostagesheld in Gaza await the return of their loved ones. US special envoy Steve Witkoff, Trump’s son-in-law Jared Kushner and daughter Ivanka Trump made remarks to the crowd, which broke out at times in chants of“Thank you, Trump.”The US president is expected to be in the region on Monday.\n\n•The timing:Asourcesaid the release of hostages could come as early as overnight Sunday into Monday local time. Nearly 2,000 Palestinian prisoners and detainees in Israel will also be freed.\n\n• In Gaza:Tens of thousands of Palestinians are returning home in Gaza as a ceasefire between Israel and Hamas entered a second day. Many foundonly ruinswhile local authorities sayscores of bodieshave been pulled from rubble. Someaidhas begun entering the territory under the terms of the agreement.\n\nIvanka Trump, President Donald Trump’s daughter, recognized the families of hostages and applauded their strength as she spoke to crowd in Tel Aviv’s Hostage Square.\n\n“Tonight, as we stand here together in Tel Aviv, we honor the strength of every family waiting, praying and believing,” Trump said, later added: “I am in awe by their strength and conviction in spite of such suffering.”\n\nHer husband,Jared Kushner, worked alongside special envoy Steve Witkoff to help finalize the first phase of an Israel-Hamas ceasefire plan.\n\nTrump went on to say that the return of hostages is a “triumph of faith, of courage and of our shared humanity.”\n\nShe also delivered a message from the president: “He sees you, he hears you, he stands with you always.”\n\nIn response, the crowd chanted, “Thank you, Trump.”\n\nPresident Donald Trump’s son-in-lawJared Kushnertook time to praise US special envoy Steve Witkoff and Trump for their efforts in the approved Gaza ceasefire framework.\n\n“It’s been an honor for me to work with such a special man who’s approached this impossible task with a full heart and with a full commitment,” Kushner said of Witkoff.\n\nKushner also highlighted his father-in-law’s “commitment to seeing peace, to seeing the hostages return home, to seeing Israel secure and safe and to seeing the entire Middle East stable and thriving.”\n\nFollowing this comment, the large crowd could be heard chanting “thank you Trump.”\n\nKushner then went on to reflect on the events ofOctober 7. He said his “heart has not been complete” since that day, when Hamas launched its attack in Israel.\n\nSpecial envoy Steve Witkoff gave credit to President Donald Trump for brokering phase one of ceasefire deal between Israel and Hamas, telling a crowd in Tel Aviv’s Hostage Square, “We all owe a debt of deep gratitude to President Trump.”\n\n“In the worst of times, he refused to accept the idea that peace in the Mideast was out of reach,” Witkoff added. “He brought together nations once divided by generations of conflict and showed us that shared peace is stronger than shared pain.”\n\nThe crowd interrupted Witkoff’s remarks a few times with chants of “Thank you, Trump.”\n\nWitkoff also thanked Israel’s Prime Minister Benjamin Netanyahu — which drew boos from the crowd — and Arab leaders for coming together to make the deal possible.\n\nThe special enjoy also recognized the families of hostages.\n\n“Each and every one of you have carried the moral weight of this nation,” Witkoff said. “Your courage has moved the world and has touched me in ways that I have never been touched before in my entire life.”\n\nHe went on to deliver a message to the hostages, saying, “You are coming home.”\n\n“Your faces, your names, your stories have lived in every heart here tonight and in mine since I began this job,” Witkoff added. “Your endurance, your faith, your will to live have been symbols of the human spirit that cannot ever be broken.”\n\nHe continued: “And now, as your return to the embrace of your families and your nation, know that all of Israel and the entire world stands ready to welcome you home with open arms and endless love.”\n\nAs we are hearing from US envoy to the Middle East Steve Witkoff and President Donald Trump’s son-in-law Jared Kushner in Tel Aviv Hostages Square now, theIDF said in a statementthat they earlier toured Gaza with officials from the Israel Defense Forces, US Central Command (CENTCOM) and others.\n\nAUS official earlier today had confirmed to CNNthat Witkoff and CENTCOM visited Gaza.\n\nHere’s who was part of the tour with Witkoff and Kushner:\n\nThe group also visited a hostage center that is being prepared to receive those released from captivity over the next few days, the statement said.\n\nLater, Zamir and Cooper “held a joint panel with senior IDF commanders,” where they discussed the operational situation along the new lines for Israeli troops in Gaza as agreed to in the deal, the statement said. CENTCOM and IDF remain in contact regarding “planning and implementation of the agreement,” the statement added.\n\nFamily membersof hostagesthanked US President Donald Trump for his administration’s role in brokering a ceasefire deal in Gaza that will bring hostages home.\n\n“I would like to thank President Trump, Mr. Steve Witkoff and the entire US administration. You have made history,” Efrat Machikawa, the niece of a hostage, said today.\n\nAhead of the hostage release, the nephew of a hostage who was killed in captivity, said “we finally feel hope.”\n\n“But we cannot and would not stop now. Every single hostage must come home,” Zahiro Shahar Mor said. “The living and the deceased. Every family deserves closure. Every family deserves to bring their loved ones home. Let’s end this.”\n\nEinav Zangauker — who is the mother of hostage Matan Zangauker — expressed her anticipation for her son’s return.\n\n“My excitement is so great, there are no words to describe it,” she said.\n\nUS special envoy Steve Witkoff is making remarks to Israelis who have gathered in Tel Aviv’s Hostages Square.\n\nThe president’s daughter, Ivanka Trump, and his son-in-law, Jared Kushner, are standing behind him.\n\nWitkoff and Kushner helped finalize the ceasefire plan.\n\nPeople could be heard chanting “thank you, Trump” during his remarks.\n\nThousands of Israelis arrived in Tel Aviv at Hostages Square awaiting the release of the hostages following the approved ceasefire deal.\n\nFormer hostages, US President Donald Trump’s son-in-law Jared Kushner as well as special envoy Steve Witkoff are addressing the crowd.\n\nThe exact timing of when the hostages will be released is unknown, but a source familiar with the matter said their releasecould happen overnightlocal time Sunday into Monday. The final agreed-upon deadline is Monday at 12 p.m. local time.\n\nTrump is expected to be in Israel Monday, where he is set to address the Israeli parliament, visit Egypt and hold a summit with various international leaders.\n\nFormer US Secretaries of State Hillary Clinton and Condoleezza Rice praised the Trump administration for its efforts in the Gaza ceasefire deal.\n\nIn aninterview with CBS News, Clinton said she “really commend[s] President Trump and his administration, as well as Arab leaders in the region” for getting the framework to the finish line.\n\nShe said US negotiators “took advantage of an opening that was available and were able to be successful.”\n\nRice added that while “no one can be completely confident” the framework will completely end the war, “given the history of the Middle East,” she is optimistic nonetheless.\n\nThe footage below, from Reuters, shows the extent of destruction in Gaza City as Palestiniansreturn to the north of the enclave.\n\nIt comes asmore aid flows into Gazaas the ceasefire enters its second day, according to the Israeli agency that handles the transfer of humanitarian assistance.\n\nFrance’s President Emmanuel Macron will visit Egypt on Monday to mark the ceasefire plan between Israel and Hamas, the French Presidency said in a statement today.\n\nMacron will show his “full support” for the ceasefire deal and “also consult with his partners on the next steps in implementing the peace plan,” the presidency said.\n\nThe French president is one of several world leaders expected to travel to Egypt at the start of next week. US President Donald Trump is set to convene world leaders for a summit in the country on Monday, two Trump administration officials familiar with the event told CNN yesterday.\n\nWhile in Egypt, Macron will “reaffirm the commitment of France and its partners to prepare for the ‘day after,’ focusing on security, governance, and reconstruction, in order to enable the lasting stabilization of the region based on the two-state solution,” according to the French Presidency.\n\n“Only a political solution based on the existence of two states living peacefully and safely side by side will allow to build a lasting future for all the people of the Middle East,” it added.\n\nIsrael and Hamas have still yet to agree to major sticking points tackled in the Trump administration’s20-point ceasefire planreleased last month, even with thefirst phase now underway.\n\nHere are the key points of contention that might prove more challenging to resolve:\n\nDisarmament:Trump’s plan called for Hamas to “commit to peaceful co-existence” with Israel and lay down its arms. Hamas members who comply will be given amnesty under the plan. Disarmament has long been a red line for the militant group.\n\nPost-war governance:The plan also called for a temporary transitional government to be established in Gaza, comprising a “technocratic, apolitical Palestinian committee” made up of “qualified Palestinians and international experts” and supervised by “a new international transitional body” called the Board of Peace.\n\nTrump appeared to reference this board during an interview with Fox News, saying that his administration was “forming a council of peace” to maintain a lasting end to the conflict in the region.\n\nBut it is not yet known which individuals will be appointed to these bodies, nor how it will exercise authority over Gaza.\n\nIsraeli withdrawal:Trump’s plan also called for the creation of an “International Stabilization Force (ISF)” to be deployed to Gaza and train “vetted Palestinian police forces” in Gaza. With this force in place, the Israel Defense Forces (IDF) would then be expected to withdraw from Gaza. Israel has not yet agreed to these provisions.\n\nSecurity guarantees:Hamas has long sought concrete assurances that Israel will not resume the war once it ends, pointing to how Israelshattered the last ceasefire agreementin March. If Hamas agrees to disarm, it is likely to demand even more robust security guarantees, but it is not clear whether Israel will agree to them.\n\nRead more about what we know - and don’t know - about Trump’s deal to end the war in Gazahere.\n\nThese pictures show Palestinians in Gaza collecting food supplies from aid trucks today amid a ceasefire between Israel and Hamas.\n\nWe reported earlier on how aid isbeginning to move into Gazaas the ceasefire enters its second day, according to the Israeli agency that handles the transfer of humanitarian assistance (COGAT). The scale of the transfer of aid was not immediately clear.\n\nAs part of the ceasefire agreement reached this week, Israel agreed to the daily entry of 600 humanitarian aid trucks operated by the UN and other donors.\n\nMore now from Hostages Square in Tel Aviv, Israel, wherehundreds have gatheredto await the releasethe remaining 48 hostages from Gaza.\n\nThe families of hostages taken on October 7 will also hold a rally later today. We’ll bring you updates from that when it starts.\n\nOne bagel seller who, for more than two years been selling snacks to visitors and demonstrators there says he is ready to retire.\n\n“I would like to notify the public when the hostages are returned, I will retire as a bagel seller,” the worker announced to a crowd of onlookers.\n\nHe explained that with the news of the hostages’ return, he would be moving his cart to a sports stadium, before quipping: “you won’t believe who will replace me in selling bagels…Benjamin Netanyahu.”\n\nHis comment underscores growing support to oust Israeli Prime Minister Benjamin Netanyahu – whose popularity has tanked among the Israeli public over the course of the war.\n\nThe Israeli leader has come under fire from critics who say he has prolonged the war, deflected responsibility for security failures around the October 7, 2023 attacks, and for repeatedly sabotaging negotiations around the hostages’ release and the end to the war.\n\nSome background:US Special Envoy Steve Witkoff and US President Trump’s son-in-law Jared Kushner met with Netanyahu in Jerusalem on Thursday, before his government met to vote on the plan, an Israeli official told CNN.\n\nThe pair praised Netanyahu’s decisions during the war, saying his actions had pressured Hamas into striking a ceasefire deal.\n\nPalestinian prisoners due to be released by Israel as part of the Gaza ceasefire agreement have been transferred to detention facilities in the country’s south.\n\nA spokesperson from Israel’s prison services said the inmates had been taken to deportation complexes in Ofer and Ketziot prisons.\n\nThere, they are awaiting instructions from the “political echelon,” the spokesperson said.\n\nThe Israeli Justice Ministry yesterday published the names of 250 Palestinian prisoners held in Israeli jails and set for release.\n\nThe list states that 142 of the prisoners will be deported. The rest will return either to the occupied West Bank or East Jerusalem.\n\nUkraine’s President Volodymyr Zelensky congratulated US President Donald Trump for his “outstanding achievement” in securing a ceasefire in Gaza during a “very positive and productive” phone call.\n\nZelensky said that “if a war can be stopped in one region, then surely other wars can be stopped as well - including the Russian war.”\n\nThe pair also discussed Russian attacks on Ukraine’s energy system and ways to bolster the country’s air defenses, Zelensky said in apost in X, “as well as concrete agreements that we are working on to ensure this.”\n\n“There needs to be readiness on the Russian side to engage in real diplomacy - this can be achieved through strength. Thank you, Mr. President!” he said.\n\nCNN has reached out to the White House for comment.\n\nUS special envoy Steve Witkoff visited Gaza along with US Central Command (CENTOM) chief Adm. Brad Cooper on Saturday, a US official confirmed to CNN, before both later returned to Israel.\n\nCooper said he visited Gaza to oversee the implementation of a coordination center as a ceasefire took hold in the territory.\n\nAccording to Cooper, the visit was made to monitor progress on the establishment of a “CENTCOM-led” civil-military coordination center, which he said is intended to support “post-conflict stabilization” in the enclave.\n\n“America’s sons and daughters in uniform are answering the call to deliver peace in the Middle East in support of the Commander in Chief’s direction in this historic moment,” he said in a statement posted onX.\n\n“This great effort will be achieved with no US boots on the ground in Gaza,” he added.\n\nFor context:A US official told CNN earlier this week that US service members had begun arriving in Israel as part of an effort to establish the post-ceasefire coordination center. About 200 service members will be involved.\n\nThe troops will be focused on assisting with the flow of humanitarian and logistical aid, as well as security assistance, into Gaza, the official said. The US service members will also be monitoring “the efforts towards achieving civilian governance in Gaza,” the official added.\n\nWe’ve been hearing from former US State Department Middle East negotiator Aaron David Miller. He told CNN earlier that future stability in Gaza is going to require “American leadership, constant pressure as well as providing incentives.”\n\nAsked by CNN’s Victor Blackwell who would be tasked with setting up astabilization forcein Gaza – one part of the Trump administration’s ceasefire plan – Miller said: “It’s going to require presidential leadership.”\n\n“Everyone else’s participation – the Europeans, the Arabs, Muslim countries – (is) important, but Donald Trump got this agreement… Really, it’s going to require American leadership, constant pressure, as well as providing incentives in order to make this thing work,” Miller said.\n\nAs we reported yesterday, US forces havebegun arrivingin Israel as part of an effort to establish a civil-military coordination center, a US official said.\n\nMiller told CNN there would be no “deployment” of American forces in Gaza.\n\nWe’ve recently heard fromUS President Donald Trump, who said the Israeli hostages remaining in Gaza are being retrieved “now.”\n\nTrump also said there is consensus “for the most part” between Israel and Hamas on what the next steps of his ceasefire plan will look like.\n\nBut as the 72-hour period for the release of the hostages progresses, much uncertainty remains about the US proposal to end the war in Gaza.\n\nWhat do we know about the next steps?\n\nFresh details about hostage release:The release of the remaining hostages held in Gazacould happen overnightlocal time Sunday into Monday, according to a source familiar with the matter, and it is likely to happen from different locations.\n\nHowever, the timing of the release is not definite yet and could still change.\n\nHostage families due to speak:The families of hostages taken on October 7, 2023, will deliver astatementin Tel Aviv’s Hostage Square later today. The statement is expected this evening local time. We will be tuning in to bring you the latest developments.\n\nIn return for the Israeli hostages,Israel must free 250 Palestinian prisoners who hold life sentences, as well as 1,700 Palestinians from Gaza detained after October 7, 2023, as part of the ceasefire deal. Yesterday, Israel’s justice ministry published the full list of Palestinian prisoners serving life sentences who are due to be released. See who is on the listhere.\n\nHumanitarian aid:Trump’s ceasefire proposal said that upon acceptance of the agreement, “full aid will be immediately sent into the Gaza Strip.” On Saturday, the Israeli agency that handles the transfer of humanitarian assistance (COGAT)confirmed to CNNthat aid trucks were entering the territory, although the scale of the transfer was not immediately clear.\n\nThe family of released hostage Ofer Kalderon knows what it’s like to wait.\n\nKalderon, who was kidnapped from kibbutz Nir Oz on October 7, 2023, and released in February during the previous ceasefire agreement, spent over 400 days in Hamas captivity. Two of his children were taken hostage alongside him and were released in November 2023.\n\nOfer’s brother Nissan and sister-in-law Sharon told CNN that when Ofer returned, they were supported by other hostage families. Now they are showing up for the relatives of the 48 hostages that are due to be released by Monday morning.\n\n“We got the support of these families when Ofer returned. So we are here for them to help them, to be here, to hug them and be happy with them as they wait,” Sharon said.\n\nThe couple showed up to rallies every week, calling for the release of other hostages even after their own family was released. They have tirelessly advocated for the remaining hostages and their families, despite losing hope for an end to the war months ago.\n\nAs hundreds of people gathered in Tel Aviv’s Hostages Square Saturday morning to celebrate the news of the hostages’ imminent release, inside the adjacent library the couple said their stomachs were in knots.\n\n“We are afraid. We are filled with joy and with concerns,” Sharon said, running through the gambit of emotions they’ve experienced since the ceasefire announcement, adding: “We really hope that everything will go smoothly without problems and everyone will be here.”\n\nSaying that no healing can begin until all of the hostages return, the Kalderons added that they were also ready for a lasting peace – and had faith that the ceasefire would hold.\n\n“There are no winners in war,” Nissan added.\n\nAround 150 bodies have been recovered from the debris of destroyed buildings and infrastructure across the Gaza Strip since the ceasefire between Israel and Hamas began yesterday, Gaza’s Civil Defense has said.\n\nApproximately 10,000 Palestinians are believed to have been buried under rubble across Gaza since October 7, 2023, Mahmoud Basal, a spokesperson for Civil Defense told CNN on Saturday.\n\nYesterday, the bodies ofat least 33 Palestinianswere recovered from Gaza City after the Israeli military withdrew from some areas of the city, Dr. Mohammed Abu Salmiya, the director of Al-Shifa hospital, told CNN.\n\nFor context: At least 67,682 Palestinians have been killed in Gaza during two years of war, according to the Palestinian Ministry of Health. The United Nations and multiple human rights organizations estimate the true death toll is likely to be thousands higher because of the bodies buried under the rubble that are yet to have been recovered.\n\nIn its most recent update on the number of people killed and wounded in Gaza, the Palestinian health ministry noted bodies found under the rubble were being added to the total death toll of the war.",
  "url": "https://edition.cnn.com/world/live-news/israel-hamas-gaza-ceasefire-hostages-10-11-25",
  "scraped_timestamp": "2025-10-11T23:48:27.944665",
  "content_length": 21134,
  "word_count": 3423,
  "source_domain": "edition.cnn.com"
}