{
  "title": "Israel increasingly facing outrage from West; being shielded by Trump, for now",
  "content": "When Israeli Prime Minister Benjamin Netanyahu addresses world leaders at the United Nations on Friday, it will be at the helm of a country that is increasingly being treated as a pariah, even by some of its longtime allies.\n\nWestern countriesare outraged by Israel's intensifying offensive in the Gaza Strip andseveral have recognized Palestinian statehood. The European Unionis weighing tariffs and sanctions. Democratic voters in the United Stateshave expressed disgust in polls, and small cracks are showing in Republican support. The prospect ofsports and cultural boycottsis growing, and Israeli tourists havebeen made to feel unwelcomein some countries.\n\nEven Netanyahu's flight to New York on Thursday was fraught. An unplanned landing in Europe could have exposed him to arrest on charges ofcrimes against humanityfiled by the International Criminal Court, which he denies. The Haaretz news site reported that the flight took a longer, alternate path to avoid some European airspace. An Israeli official, speaking on condition of anonymity because they were not authorized to discuss the matter, confirmed the report.\n\nNetanyahu still seems to have the unwavering support of President Donald Trump, and the U.S.has done muchto shield Israel from censure. But asits latest invasion of Gaza Cityputs Trump's hoped-for ceasefire further out of reach, and as some on the right express outrage, that too could change.\n\n“The concern is that that there’s a tipping point out there,” said Michael Oren, a historian and former Israeli ambassador to the U.S. “We’re not a pariah state yet, but we could be.”\n\nLast month, 28 Western-aligned countries that had rallied around Israel after Hamas' Oct. 7, 2023, attack called on it to end its offensive, which has killed tens of thousands of Palestinians. They also criticized Israel's restrictions on humanitarian aid, whichhave contributed to famine.\n\nTen countries, including Britain, France, Canada and Australia — recognized Palestinian statehood this week, hoping to revive the long-moribund peace process, a move that the U.S. and Israel have vehemently rejected. Germany, one of Israel’s closest allies, has not joined the calls for a ceasefire or the push for Palestinian statehood, but hashalted some military exports.\n\nSeveral Arab states, including some with longstanding relations with Israel, have accused it of committing genocide in Gaza,as have leading genocide scholars, U.N. experts and someIsraeli and international rights groups. The U.N's highest court, the International Court of Justice, is weighing genocide allegations raised by South Africa that Israel vehemently denies.\n\nNetanyahu acknowledged the country's isolation in a speech last week, saying Israel might have to become a self-sufficient, militarized “Super Sparta.” He backtracked the next day after the Tel Aviv Stock Exchange took a dive.\n\n“This is a bitter fact that has begun to spread like a bushfire beyond the sphere of diplomatic relations,” Itamar Eichner wrote in Israel's daily Yediot Ahronot. “Israel is already becoming an ostracized country.”\n\nTrump has stood by Israel through it all, applying no public pressure afterit ended a ceasefirehe had helped broker earlier this year; or when it cut Gaza off from food and medicine for several weeks, or when it invaded Gaza City earlier this month.\n\nTrump aired his displeasure afterIsrael's strike on Hamas leaders in Qatarderailed negotiations aimed at a ceasefire and hostage release. But there was no daylight seen between the two allies when Secretary of State Marco Rubiovisited Israel days later.\n\nThe administration has meanwhileimposed sanctions on ICC judges and prosecutors, cracked down on pro-Palestinian protests on college campuses, shielded Israel from U.N. calls for a ceasefire andprovided billions of dollars worth of arms— continuing the Biden administration's massive military support.\n\nU.S. public opinion polls over the past year raise doubt over how long such support will last.\n\nAbout half of Americanssay Israel's military response in Gaza has “gone too far,” according to a survey fromThe Associated Press-NORC Center for Public Affairs Research. That’s up from November 2023, shortly after the start of the war, when 40% said it had.\n\nA recent poll by the University of Maryland found thatnearly half of Democratic voterssympathize more with the Palestinians, compared to just 6% who sympathize more with Israel. The survey of 1,514 Americans was carried out July 29-Aug. 7 and had a margin of error of 2.9 percentage points.\n\nThe same poll founda growing divide among Republicans, with younger people showing far less support for Israel. While 52% of Republicans aged 35 and older said Israel's actions in Gaza were justified under the right to self-defense, just 22% of Republicans 18 to 34 agreed.\n\nEvangelical Christian Republicans, a bulwark of support for Israel, showed a smaller but significant divide, with 59% of older respondents and 36% of younger respondents saying Israel's actions were justified.\n\n“This is unprecedented, and I say that as someone who’s been doing research on this issue for decades,” said Shibley Telhami, the professor who authored the survey.\n\nHe said the polls indicate a “paradigmatic shift” is underway, comparable to the souring toward foreign intervention after the wars in Vietnam and Iraq.\n\n“We have a Gaza generation, and I think this Gaza generation doesn’t trust Israel, sees Israel as a source of a problem, sees what’s happening in Gaza largely to be genocide. And I don’t think that’s likely to change once the war ends,” he said.\n\nThere's no indication that any of this has chastened Israeli leaders. Netanyahu says Israel is waging a lawful war of self-defense in response to the Oct. 7 attack, chalking up the criticism to antisemitism and Hamas propaganda.\n\nLast month, Israelapproved a major settlement projectthat could split the occupied West Bank in half and that its Western allies — including past U.S. administrations — had long opposed. Netanyahu has hinted he might annex parts of the territory in response to Western countries recognizing a Palestinian state.\n\n“When the Western world is condemning us, our reaction is not to give in, but to dig our heels in deeper,” said Oren, the former ambassador. “There are some things that Israel just cannot do or will not do in order to ameliorate its international standing: For example, creating a Palestinian state which would fall to Hamas within 24 hours.\"\n\nIsrael's increasingly frustrated allies warn of the opposite — that if it continues to rule over millions of Palestinians who are denied basic rights, it will have to choose betweensome form of apartheidor a binational state in which Jews may not be a majority.\n\n“The approach of your government, some ministers especially, is to destroy the possibility of a two-state solution,” French President Emmanuel Macron said last week in an interview with an Israeli TV network. “It's the last minute,” he said, before such a solution becomes “totally impossible.”",
  "url": "https://www.hindustantimes.com/world-news/israel-increasingly-facing-outrage-from-west-being-shielded-by-trump-for-now-101758820944424.html",
  "scraped_timestamp": "2025-09-26T00:56:31.114104",
  "content_length": 7042,
  "word_count": 1102,
  "source_domain": "www.hindustantimes.com"
}