{
  "title": "Israel strikes Yemen's Sanaa after Houthi drone attack on Red Sea town Eilat",
  "content": "The Israeli military said it struck targets linked to Yemen's Houthis in Sanaa on Thursday, a day after the group claimed a drone attack on a hotel in Israel's Red Sea resort of Eilat.\n\nThe Houthi-run health ministry said two people were killed and 48 wounded in the attack, which it said hit civilian and service facilities. Civil defence teams were still working at the scene.\n\nThe Israeli military said in a statement that the Houthi general staff's control headquarters, security and intelligence compounds, and military camps were among the targets attacked by its air force.\n\n\"We have now delivered a powerful strike on numerous terror targets of the Houthi terror organization in Sanaa\", Israeli Defence Minister Israel Katz said in a post on X.\n\nThe strikes are the latest in more than a year of attacks and counterstrikes between Houthi militants inYemenand Israel, part of a spillover from the war inGaza.\n\nThe strikes targeted the Dhahban power station and several residential neighbourhoods, the Houthi-run Al Masirah TV reported.\n\nYemeni residents told Reuters that the strikes were directed at areas in the south and west of Sanaa.\n\n\"It's terrifying,\" one witness told Reuters, saying the area had been covered in dust. \"While passing through the street I saw dozens of women and children smeared with blood.\"\n\nThe strikes came as a pre-recorded speech by Houthi leader Abdul Malik al-Houthi was being aired.\n\nOn Wednesday, at least 20 people were injured after a drone launched from Yemenhit a hotel in Israel's Red Sea resort city of Eilat, the Israeli ambulance service said.\n\nIsrael in August carried out a strike that killed the prime minister of the Houthis' administration and several other ministers, the first such attack to kill senior officials of the group.",
  "url": "https://www.hindustantimes.com/world-news/israel-strikes-yemens-sanaa-after-houthi-drone-attack-on-red-sea-town-eilat-101758820654751.html",
  "scraped_timestamp": "2025-09-26T00:24:09.649121",
  "content_length": 1783,
  "word_count": 292,
  "source_domain": "www.hindustantimes.com"
}