{
  "title": "Italy and Spain deploy ships to help Gaza aid flotilla targeted in drone attack",
  "content": "Italy and Spain say they are sending vessels to help a flotilla that wastargeted by droneswhile trying to deliver aid to Gaza, with activists claiming that Israel was behind the strikes.\n\nVolunteers from theGlobal Sumud Flotilla (GSF)– an organization trying to get aid into the besieged enclave using ships setting sail from ports across the Mediterranean – say that some of their vessels were targeted by drones. The organization claimed the attacks are part of a sustained Israeli campaign of intimidation.\n\nCNN has reached out to the Israel Defense Forces (IDF) for comment.\n\nThe boats were just days from reaching the enclave when the latest reported attacks occurred on Tuesday.\n\n“In the final days before reaching Gaza, the GSF is experiencing an alarmingly dangerous escalation, with multiple boats reporting targeted explosions and unidentified objects being dropped on and near the boats, causing significant damage and widespread obstruction in communication,” the organization said in a statement Tuesday.\n\nThe incident has raised urgent concerns for the safety of the more than 500 unarmed participants aboard the flotillas, the GSF said.\n\nThere are a variety of nationalities aboard the vessels, including citizens of Italy, Sweden and Spain, CNN understands.\n\nSpeaking from one of the vessels following the reported attack, a Spanish lawmaker urged international action to help the activists.\n\n“I think this has to escalate further and further and reach … European Commission levels, because this needs to be tackled, coordinated with all the countries, at least in Europe,” lawmaker Juan Bordera told Reuters.\n\nBordera added that those on the flotilla were “stressed” and lived through a “crazy, crazy nightmare” amid Tuesday night’s explosions.\n\nThe Israeli military has launcheda ground offensivein recent days deep into Gaza City, one of the enclave’s most populated areas, sparking widespread criticism at home and abroad.\n\nNearly 100 people were killed in Gaza throughout Wednesday, according to an update from the enclave’s hospitals, including some 55 people in Gaza City alone.\n\nInside Israel, the families of theremaining hostages held in Gazasay the operation puts their loved ones in even greater danger. About 20 hostages are thought to be still alive. Many European governments, as well as Canada and Australia, have condemned the operation as worsening the humanitarian crisis in the battered enclave.\n\nLast week an independent United Nations inquiryconcluded for the first timethat Israel has committed genocide againstPalestinians in Gaza, an accusation Israel’s government has strongly denied.\n\nOverseas activists have tried to deliver aid in the past to Gaza but have either beenintercepted by Israeli forcesor come under some form of attack.\n\nOn Tuesday, Israel’s foreign ministry said on X that the country would take “necessary measures” to stop the latest flotilla from reaching Gaza. The ministry said it would be willing to transfer the aid from the flotilla to Gaza through the Ashkelon port in Israel, but it accused organizers of refusing such a transfer and “pursuing a violent course of action.”\n\n“If the flotilla continues to reject Israel’s peaceful proposal, Israel will take the necessary measures to prevent its entry into the combat zone and to stop any violation of a lawful naval blockade, while making every possible effort to ensure the safety of its passengers,” the ministry added.\n\nFrancesca Albanese, the United Nations special rapporteur on the occupied Palestinian territories, wrote on X that the flotilla had come under attack 14 times between Tunis and Crete. “Four vessels are now damaged and require urgent repair. As of last night, an unexploded device remains on one of the boats,” she wrote.\n\nUN Human Rights Office spokesperson Thameen Al-Kheetan has called for an “independent, impartial and thorough investigation” into the reported attacks.\n\nItaly authorized the dispatch of two Italian naval vessels, its defense minister, Guido Crosetto, told parliament on Thursday, the Reuters news agency reported. He earlier said in a statement that one vessel was en route to the area for possible rescue operations. The statement added that the drone attack was carried out by “currently unidentified perpetrators.”\n\nWednesday, Italian Prime Minister Giorgia Meloni spoke of her “total condemnation” of the drone strike the night before, adding Italy is “conducting our own investigation to determine who is responsible.”\n\nMeloni also advised those on the flotilla against needlessly risking their safety by continuing the mission.\n\n“All of this is gratuitous, dangerous, and irresponsible. There’s no need to risk one’s safety and enter a war zone to deliver aid to Gaza, which the Italian government could have delivered in a matter of hours.”\n\nShe urged them instead to accept a proposal from Rome to transfer the aid to the Latin Patriarchate of Jerusalem in Cyprus, which would then assume responsibility for the delivery.\n\nThe flotilla’s organizers told CNN on Thursday they had received the Italian proposal and “will not be accepting the offer to give the aid to anyone other than the intended recipients, which are the civilians in Gaza.”\n\nItalian officials say the Gaza-bound vessels are carrying Italian citizens, along with parliamentarians. “To ensure their safety, the foreign ministry had already notified the Israeli authorities that any operation entrusted to Israel’s armed forces be conducted in compliance with international law and the principle of absolute caution,” a statement from Italy’s foreign ministry said.\n\nItalian Foreign Minister Antonio Tajani is working to mediate with the Israeli government to allow the humanitarian supplies transported by the flotilla to enter Gaza, a spokesperson for his office told CNN.\n\n“The minister is in contact with the Israeli government and has identified a credible mediation mechanism. The Italian government is examining all options to avoid further offensive actions against the flotilla’s vessels,” the office added.\n\nSpanish Foreign Minister Jose Manuel Albares told Reuters on Thursday that the flotilla heading to Gaza poses no threat to anyone, including Israel. Spanish Prime Minister Pedro Sanchez said Wednesday his country was also sending a ship to assist the flotilla “in the event of any difficulties” and for potential rescue operations.\n\nIsrael’s Foreign Ministry reiterated Thursday evening the flotilla will not be allowed to reach Gaza. It said it has repeatedly offered alternative routes for the aid to be transferred to Gaza, and that the flotilla’s rejection of the Italian proposal shows its goal is provocation and serving Hamas rather than the genuine delivery of humanitarian aid.\n\nMeanwhile, Sweden’s foreign ministry said it is following the developments very closely, adding that approximately 15 Swedish nationals were aboard the vessels.\n\nIn May, activists on board an aid ship said they were targeted by an Israeli drone in international waters off Malta. The IDF did not deny involvement in the drone attack. An Israeli Air Force cargo plane was picked up on flight trackers circling the waters near Malta for an extended period of time before the attack.\n\nCNN’s Pau Mosquera, Dana Karni and Lauren Said-Moorhouse contributed reporting to this story.",
  "url": "https://edition.cnn.com/2025/09/24/world/italy-gaza-aid-flotilla-latam-intl",
  "scraped_timestamp": "2025-09-26T00:49:56.630661",
  "content_length": 7316,
  "word_count": 1132,
  "source_domain": "edition.cnn.com"
}