{
  "title": "Joe Biden begins five-week radiation treatment for cancer | All we know about his health",
  "content": "Former US President Joe Biden has begun radiation treatments for an aggressive form of prostate cancer, which was diagnosed in May. He also underwent surgery to remove cancerous cells in early September. The treatment will reportedly span five weeks.\n\n“As part of a treatment plan for prostate cancer, PresidentBidenis currently undergoing radiation therapy and hormone treatment,” Bloomberg reported, citing a spokesperson for Biden. NBC News reported earlier that the radiation treatment is expected to span five weeks.\n\nIn early September, Biden also underwent a Mohs surgery to remove cancerous cells from his skin.\n\nWhen Biden’s prostate cancer was first announced in May, his spokesperson, Kelly Scully, said it had metastasised to the bone and was hormone sensitive.\n\nBecause his cancer was hormone sensitive, it could have responded to hormone therapy, which involves stopping testosterone from being made or reaching cancer cells.\n\nAlso read:Donald Trump goes for a second health check-up in six months. Why it matters\n\nRadiation therapy in advanced prostate cancer that has metastasised to the bones can help keep it under control for as long as possible and prevent or relieve symptoms, according to the American Cancer Society.\n\nIn May, the 82-year-old ex-president'soffice announcedthat Biden had been diagnosed with an aggressive form of prostate cancer that spread to his bones after he experienced urinary symptoms and a prostate nodule was found.\n\n\"Cancer touches us all. Like so many of you, Jill and I have learned that we are strongest in the broken places,\" Biden, whose son Beau Biden died of cancer in 2015, said at the time in a post on X.\n\nBiden's health had been in the spotlight due to a new book detailing his declining health as he campaigned last year for a second presidential term against Donald Trump.\n\nIn July 2024, Biden announced he was dropping out of the race after a debate performance against Trump and endorsed Vice President Kamala Harris for the presidency.",
  "url": "https://www.hindustantimes.com/world-news/us-news/joe-biden-begins-five-week-radiation-treatment-for-cancer-all-we-know-about-his-health-101760201553068.html",
  "scraped_timestamp": "2025-10-11T23:46:06.140409",
  "content_length": 2000,
  "word_count": 320,
  "source_domain": "www.hindustantimes.com"
}