{
  "title": "Joshua Jahn's searched ‘Charlie Kirk shot video’; bombshell Tyler Robinson link in ICE Dallas shooting",
  "content": "Joshua Jahn, the suspect who opened fire outside an Immigration and Customs Enforcement facility in Dallas, searched for ‘Charlie Kirk shot video’ days before Wednesday's attack. FBI Director Kash Patel on Thursday revealed that the 29-year-old shooter, who died from a self-inflicted gunshot wound, had a ‘high degree of pre-attack planning’.\n\nPatel further noted that Jahn ‘conducted multiple searches of ballistics and the ’Charlie Kirk Shot Video'. \"The perp downloaded a document titled \"Dallas County Office of Homeland Security & Emergency Management\" containing a list of DHS facilities,\" the FBI chief added on X, platform formerly known as Twitter.\n\nRead More:Joshua Jahn details: 5 shocking things we know about Dallas ICE facility shooting suspect\n\nIt was revealed that Joshua Jahn also ‘searched apps that tracked the presence of ICE agents’.\n\n\"One of the handwritten notes recovered read, \"Hopefully this will give ICE agents real terror, to think, 'is there a sniper with AP rounds on that roof?\"\n\nThe gunman fired upon a Dallas immigration field office from a nearby roof Wednesday morning, killing one detainee and critically wounding two others. Authorities said they found ammunition with anti-ICE messaging at the scene. Kash Patel posted a photo of an unspent bullet casing with ‘ANTI-ICE’ written on it.\n\nRead More:Joshua Jahn's mother's posts on gun laws surface amid Dallas ICE shooting probe; 'anti Ted Cruz, Abbot'\n\nThe attack came only days after Tyler Robinson, 22, fatally shot conservative activist Charlie Kirk at a Utah Valley University event. The assassin has been charged with aggravated murder, and prosecutors are seeking the death penalty in the case.\n\nJahn briefly worked at a Texas-based solar company and in the marijuana industry, including a stint in Washington in 2017, Ryan Sanderson, owner of a legal cannabis farm in that state, said, according to the Associated Press. Jahn slept in his car during that time, he added.\n\n“He was lost, and I didn’t expect him to be crazy,” Sanderson told AP. “Didn’t really seem to have any direction, living out of his car at such a young age.”\n\n“I don’t remember him being that abnormal, he didn’t seem to fight with anyone or cause trouble, he kept his head down and stayed working,” Sanderson said.",
  "url": "https://www.hindustantimes.com/world-news/us-news/joshua-jahns-searched-charlie-kirk-shot-video-bombshell-tyler-robinson-link-in-ice-dallas-shooting-101758813823229.html",
  "scraped_timestamp": "2025-09-26T00:34:21.792690",
  "content_length": 2282,
  "word_count": 368,
  "source_domain": "www.hindustantimes.com"
}