{
  "title": "Joshua Jahn left a handwritten manifesto before Dallas shooting with 'real terror' warning",
  "content": "Anti-ICE shooterJoshua Jahnmeticulously planned his attack on immigration authorities before setting up a sniper position on a rooftop in Dallas, and indicated his intention to inspire “terror” in agents, according to FBI.\n\nThe FBI officials recovered a handwritten note after the Dallas shooting, which stated, “Hopefully this will give ICE agents real terror, to think, ‘is there a sniper with AP rounds on that roof?'”\n\nFBI Director Kash Patel stated in an X post Thursday that Jahn, who fired at a vehicle close to the door of an ICE field office in Dallas on Wednesday morning, had also searched the “Charlie KirkShot Video” several times between September 23 and 24 before to the incident.\n\nAdditionally, Jahn looked for applications that monitored the movements of ICE agents and downloaded a document called “DallasCounty Office of Homeland Security & Emergency Management,” which included a list of DHS locations, as per FBI.\n\nAccording to Patel, the abundance of evidence found so far in the inquiry “indicates a high degree of pre-attack planning.”\n\nJoshua Jahn died of self-inflicted gun woundJoshua Jahn, 29, was the sniper who took lives of at least two people at the Dallas ICE facility early on Wednesday morning, according to FOX News and FOX 4 sources.Jahn allegedly opened fire, killing two inmates and wounding one before shooting himself. According to law authorities, \"anti-ICE messages\" were scribbled on bullets found close to the shooter's body.Jahn was charged with a felony in Texas in 2016 for distributing marijuana in excess of ¼ ounce but less than 5 pounds. On record, he entered a guilty plea. Public records also show that he was a registered independent who cast his final ballot in November 2024.According to state criminal records, Jahn is a 6-foot-tall, 210-pound man with brown hair and brown eyes. He was born in Texas, as per the documents.\n\nJoshua Jahn, 29, was the sniper who took lives of at least two people at the Dallas ICE facility early on Wednesday morning, according to FOX News and FOX 4 sources.\n\nJahn allegedly opened fire, killing two inmates and wounding one before shooting himself. According to law authorities, \"anti-ICE messages\" were scribbled on bullets found close to the shooter's body.\n\nJahn was charged with a felony in Texas in 2016 for distributing marijuana in excess of ¼ ounce but less than 5 pounds. On record, he entered a guilty plea. Public records also show that he was a registered independent who cast his final ballot in November 2024.\n\nAccording to state criminal records, Jahn is a 6-foot-tall, 210-pound man with brown hair and brown eyes. He was born in Texas, as per the documents.",
  "url": "https://www.hindustantimes.com/world-news/us-news/joshua-jahn-left-a-handwritten-manifesto-before-dallas-shooting-with-real-terror-warning-101758814150383.html",
  "scraped_timestamp": "2025-09-26T00:34:22.968530",
  "content_length": 2665,
  "word_count": 440,
  "source_domain": "www.hindustantimes.com"
}