{
  "title": "Keir Starmer left red-faced as he queues up behind world leaders waiting to shake hands with Trump in Egypt",
  "content": "Sir Keir Starmer was seemingly humiliated as he joined a line of world leaders waiting to shake hands with US PresidentDonald Trumpat a summit in Egypt backing the conclusion of theIsrael-Hamasconflict. The UK Prime Minister was left red-faced after he arrived amid extreme desert heat, and then queued behind Egyptian President Abdel Fattah el-Sissi and Qatari Emir Tamim bin Hamad Al Thani. Trump held court after he oversaw the signing of a landmark ceasefire agreement with Hamas.\n\nStarmer was photographed fidgeting in his suit. However,he later insistedthat the summit marked a \"historic first step towards ending the war in the Middle East” as several key nations endorsed Trump's Gaza peace plan. All 20 livingHamas hostageshave finally been released. The release happened in stages, with the hostages being freed in two groups – a group of seven and another group of 13.\n\nRead More |Biden hails Trump after Hamas hostages' release, ‘The road to this deal was not easy’\n\nSpeaking alongside Mr el-Sissi, President Trump said, \"We have a once-in-a-lifetime chance to put the old feuds and bitter hatreds behind us.\"\n\nHe also urged leaders to \"declare that our future will not be ruled by the fights of generations past.\"\n\nStarmer, who had flown in specially, pitched Britain’s involvement. \"What happens tomorrow really matters, and that's why, what I've been discussing with leaders all day is, what part can we play?” he told reporters, according to Express.\n\nRead More |Trump's stern words to Emmanuel Macron during tense handshake at Egypt summit revealed by lip reader, ‘You hurt me’\n\nHe added, \"And we, the United Kingdom in particular I think, can play a part in monitoring the ceasefire, but also decommissioning the capability of Hamas and their weaponry drawing on our experience in Northern Ireland.\"\n\nStarmer also addressed the idea of a formal role for himself or ex-PM Sir Tony Blair on Trump's proposed Gaza peace board. \"There are discussions going on about who should be on the board, but I can be clear with you, I haven't put myself forward for that role,” he said.\n\n\"But what I have put myself forward for, what I put out country forward for, is to ensure that we keep doing what we're best at, which is working, as we have done behind the scenes, to help get this deal to where it is today, and drawing on our experience in relation to decommissioning, monitoring the ceasefire, which is essential,” Starmer added.",
  "url": "https://www.hindustantimes.com/world-news/us-news/keir-starmer-left-red-faced-as-he-queues-up-behind-world-leaders-waiting-to-shake-hands-with-trump-in-egypt-101760425824475.html",
  "scraped_timestamp": "2025-10-14T15:37:14.523213",
  "content_length": 2441,
  "word_count": 407,
  "source_domain": "www.hindustantimes.com"
}