{
  "title": "Kremlin bans fuel exports until the end of the year as Russia’s supply is disrupted by Ukrainian drones",
  "content": "Russia is banning exports of fuel until the end of the year as gas pumps across the country and in the areas under its occupation are increasingly running dry because ofUkrainian drone attacks.\n\nKyiv first stepped up drone attacks on Russian refineries, pumping stations and fuel trains in an attempt to disrupt fuel supply chains over the summer when demand is traditionally high as people drive more during vacation time.\n\nWhile Russian officials initially blamed the shortages on “logistical reasons” and promised gasoline and diesel would begin flowing again, the shortages have only worsened in recent weeks.\n\nThe Ukrainian Air Force said it struck multiple Russian fuel production sites and pumping stations this week, including a major oil refinery in Bashkortostan in southern Russia that is operated by Gazprom.\n\nUkraine is stepping up attacks on Russian energy - and it’s working\n\nThe ban on exports is the latest attempt by the Kremlin to deal with the shortages. Moscow first barred some exports of gasoline in March, then extended the ban to all major producers in July.\n\nThursday, Russia’s Deputy Prime Minister Alexander Novak announced the embargo would be extended again, this time until the end of the year and that some diesel fuel exports would also banned.\n\nAccording to the Russian state news agency TASS, Novak admitted there was “indeed a slight shortage of petroleum products” but said this was “being covered by accumulated reserves.”\n\nRussia is among the world’s biggest producers of diesel fuel, and its exports are a key source of revenue for the government.\n\nThe pro-Kremlin newspaper Izvestia reported that gas stations in several regions have begun to ration gasoline and diesel, allowing each customer to buy only a limited amount.\n\nThe situation seems to be the worst in Crimea, the southern Ukrainian peninsula that Russia illegally annexed in 2014.\n\nRussian privately-owned prominent business news outlet Kommersant reported Wednesday that about half of pumps in Crimea are now out of action because of the shortages.\n\nThe situation is so bad that the Russian-imposed governor of the occupied Crimea went as far as admitting the real reason behind the shortages, blaming it on “reduced production” at Russian oil refineries, albeit without mentioning the real reason for this – the war that Russia has been waging on Ukraine.\n\nVideos and images shared on social media show long lines of cars waiting at the few gas stations that still have supplies.\n\nThe popular Telegram channel sharing on-the-ground updates, Crimean Wind, reported Wednesday that Sevastopol, the largest city in Crimea, was completely out of gasoline.\n\nIt said that when two tankers arrived to one pump in the city, a huge line of cars formed almost immediately. Within a couple of hours, the tankers were empty. The channel said gasoline was being sold for about a third more now compared to last month.\n\n“There are no lines for hay yet, and the prices for horses and donkeys are stable,” the channel added sarcastically.",
  "url": "https://edition.cnn.com/2025/09/25/world/russia-export-fuel-ban-ukranian-drones-intl",
  "scraped_timestamp": "2025-09-26T00:16:12.427888",
  "content_length": 3027,
  "word_count": 491,
  "source_domain": "edition.cnn.com"
}