{
  "title": "Ladakh LG reviews security situation in Leh, calls for heightened vigilance",
  "content": "A day after four people were killed and 90 others injured in clashes amid a shutdown in Ladakh, Lieutenant Governor Kavinder Gupta on Thursday chaired a security review meeting here and called for heightened vigilance to safeguard peace.\n\nReiterating his appeal for unity, Gupta said, “Peace and harmony are the foundation of Ladakh’s identity. Together, we must protect this legacy and ensure the safety and security of every citizen.” The shutdown was called by a constituent of the Leh Apex Body (LAB) in support of their demand to advance the proposed talks with the Centre on the extension of the Sixth Schedule of the Constitution and statehood to Ladakh. “The lieutenant governor chaired a high-level security review meeting to assess the emerging situation across Ladakh, emphasising the need for heightened vigilance, seamless inter-agency coordination, and proactive measures to safeguard peace, security, and public order across the UT,” the LG office said in a post on X.\n\nThe meeting was among others attended by Chief Secretary Pawan Kotwal, DGP S D Singh Jamwal and senior officers of the Army and ITBP.\n\nDuring the meeting, the LG underlined that the safety and well-being of citizens remains the top priority of the administration and directed officials to maintain a robust mechanism for monitoring the ground situation on a continuous basis, a Raj Bhavan spokesman said.\n\nGupta stressed upon close cooperation between civil and security agencies to ensure swift response to any challenge.\n\nHe also called for strengthening intelligence-gathering networks, ensuring community participation in maintaining harmony, and enhancing preparedness to deal with any untoward incident.\n\n“Ladakh has always been known for its peace, harmony, and brotherhood. However, certain anti-social elements are trying to disturb this atmosphere. I urge the people not to fall prey to such attempts. We must maintain peace at all costs,” Gupta said.\n\nHighlighting the developmental journey of the region, the LG said Ladakh has witnessed massive progress under the visionary leadership of Prime Minister Narendra Modi after becoming a Union Territory in 2019.\n\n“Our focus is on building a prosperous, peaceful, and developed Ladakh. No disruptive force will be allowed to derail this progress,” he asserted.\n\nHe appealed to the public to avoid violence and assured full government support. “The government stands firmly with the people of Ladakh. Every life is precious and we are ensuring the best possible medical care for those injured.”\n\nProviding details of the medical response to the people injured in Wednesday's incident, Gupta said a total of 90 patients were brought to SNM Hospital, Leh.\n\nOf these, three were brought dead and one was declared dead on arrival. Seven patients were critically injured, 20 suffered major trauma, and 61 had minor injuries, he said, adding while 50 patients were discharged the same day, seven underwent major surgeries, and 45 blood transfusions were carried out.\n\n“Today, one critically injured patient was airlifted to New Delhi through an Indian Air Force aircraft for advanced treatment. Presently, 18 patients remain admitted while 11 more were discharged today. The bodies of the four deceased have been handed over to their families after completion of all legal formalities,” Gupta said.\n\nOn the directions of the LG, the Leh deputy commissioner also visited SNM Hospital to enquire about the well-being of the injured and ensure that all possible assistance is being extended to the patients and their families, the spokesman said.",
  "url": "https://www.hindustantimes.com/india-news/ladakh-lg-reviews-security-situation-in-leh-calls-for-heightened-vigilance-101758820670668.html",
  "scraped_timestamp": "2025-09-26T00:33:41.113126",
  "content_length": 3580,
  "word_count": 560,
  "source_domain": "www.hindustantimes.com"
}