{
  "title": "Lawyer reveals ‘most shocking’ part about Trump’s new H-1B visa restrictions",
  "content": "Thousands of skilled foreign professionals faced sudden uncertainty after PresidentDonald Trumpunveiled newH-1Bvisa restrictions on September 19. The proclamation required H-1Bvisaholders to return to the U.S. within 24 hours or risk new limitations and a $100,000 fee.\n\nAccording to USA Today, a Seattle-based software engineer, Henry Pan, learned of the restrictions while traveling on a high-speed train in China. He was returning home with his girlfriend for his sister's wedding when emails and headlines flooded in. Pan said they had to rush back, missing important family events.\n\nThe new rules target H-1B holders, a category for professionals like engineers, accountants, and specialized doctors with at least a bachelor's degree. According to FWD.US, more than 730,000 people hold H-1B visas in the United States, with over 1.3 million including their dependents. The visa allows workers to stay for up to six years.\n\nTrump's proclamation cited concerns about the \"replacement of American workers\" and \"systemic abuse\" of the program, particularly in computer and math jobs. The order stated H-1B holders could only enter if their petitions included a $100,000 payment.\n\nThe announcement caused immediate chaos. Videos circulated of travelers trying to avoid flights. Major U.S. tech companies, law firms, and research institutions sent urgent emails advising employees to stay or return quickly. Immigration attorneys described the move as sudden, creating panic in just two days. USA Today quoted Minneapolis attorney John Medeiros, \"The most shocking part is it goes into effect in two days. That's how this administration does things: Ready, fire, aim.\"\n\nAlso read:Melania Trump's reaction to Donald Trump's UN speech sparks social media frenzy; ‘Even she didn’t crack a fake…'\n\nEven days later, questions remain over how the $100,000 fee will be applied. Workers like Jackie Chen, who was vacationing in Japan, described fear and confusion, worried about job loss if they did not comply immediately.\n\nThe sudden proclamation disrupted both professional and personal lives. Many workers had to cut short family visits, vacations, and critical personal engagements. Attorneys and employers continue seeking clarity as uncertainty persists.\n\nAns. A work visa for skilled professionals with at least a bachelor's degree, valid up to six years.\n\nAns. Foreign professionals on H-1B visas and their dependents.",
  "url": "https://www.hindustantimes.com/world-news/us-news/lawyer-reveals-most-shocking-part-about-trump-s-new-h-1b-visa-restrictions-101758821645662.html",
  "scraped_timestamp": "2025-09-26T00:47:59.023798",
  "content_length": 2418,
  "word_count": 363,
  "source_domain": "www.hindustantimes.com"
}