{
  "title": "Lt Gen Pushpendra Singh takes charge as new Vice Chief of Army Staff",
  "content": "Lt General Pushpendra Singh on Friday took over as the Vice Chief of the Army Staff. He succeeds Lt Gen N.S. Raja Subramani, who retired from service on Thursday.\n\nA Para (Special Forces) officer, Lt Gen Singh, during his illustrious career spanning 38 years, has held various command and staff appointments, including a Special Forces Unit in the Kashmir Valley and on the Line of Control. He later commanded an Infantry Brigade and a Mountain Division in ‘Op Snow Leopard’ along the Line of Actual Control.\n\nLt Gen Singh was GOC of a Corps headquartered inHimachal Pradeshand responsible for sensitiveJammu, Samba, andPathankotareas. He has insightful knowledge and a deep understanding of operational dynamics on both the western and northern borders.\n\nIn a solemn ceremony on Friday, he, along with Veer Naris and family members of the brave hearts, who fought under his command during a daring counter-terror operation in Op Pawan in Sri Lanka in 1989, laid a wreath and paid homage at the National War Memorial on Friday.\n\nCommissioned from the 4th Battalion of The Parachute Regiment (Special Forces) in December 1987 after graduating from La Martiniere College, Lucknow, Lucknow University and the Indian Military Academy, Dehradun, Lt Gen Singh, as a young officer, joined his battalion during the Indian Peace Keeping Force (IPKF) operations in Sri Lanka. 4 Para had been inducted into the island nation in October 1987, participating in key operations in Jaffna and later deploying in Kilinochchi.\n\nIn July 1989, while leading a 13-member Quick Reaction Team moving from Iranamadu to Kilinochchi, 2/Lt Pushpendra Singh’s convoy was ambushed. Displaying exemplary courage and leadership, he led a fierce counterassault that resulted in four LTTE terrorists being neutralised and several others injured, despite the team suffering casualties, including five brave hearts who made the supreme sacrifice.\n\nSingh and two others were severely wounded in the operation.\n\nOn the occasion of taking over as the Vice Chief of the Army Staff, he invited the Veer Naris and family members of five fallen soldiers of this gallant action to be part of the solemn event.\n\nAccompanied by the families, he paid homage at the Eternal Flame at the National War Memorial and laid floral tributes at the Tyag Chakra, where the names of the five bravehearts from the ambush have been immortalised.",
  "url": "https://www.financialexpress.com/business/defence/lt-gen-pushpendra-singh-takes-charge-as-new-vice-chief-of-army-staff/3933876/",
  "scraped_timestamp": "2025-09-26T16:16:45.397210",
  "content_length": 2386,
  "word_count": 383,
  "source_domain": "www.financialexpress.com"
}