{
  "title": "Madagascar’s president has left the country after Gen Z protests, officials say",
  "content": "Madagascar’s president has fled the African nation, the head of the opposition and other officials said on Monday, the second time that young protesters have toppled a government in weeks of worldwideGen Z unrest.\n\nSiteny Randrianasoloniaiko, leader of the opposition in parliament, told Reuters that President Andry Rajoelina left Madagascar on Sunday after units of the army defected and joined the protesters.\n\n“We called the staff of the presidency, and they confirmed that he left the country,” Randrianasoloniaiko said, adding that Rajoelina’s current whereabouts were unknown.\n\nThe president’s office did not reply to requests for comment.\n\nIn an address to the nation broadcast on Facebook late Monday, Rajoelina said he had to move to a safe location to protect his life. He did not disclose his whereabouts but appeared defiant, saying that he would not “allow Madagascar to be destroyed.”\n\nThe diplomatic source said after the speech that Rajoelina was refusing to step down.\n\nA military source told Reuters that Rajoelina flew out of Madagascar, a former French colony, on a French military aircraft on Sunday. French radio RFI said he had struck a deal with President Emmanuel Macron.\n\nMacron, speaking in Egypt after a summit on the Gaza ceasefire and hostage deal, said he could not immediately confirm reports that France had helped Rajoelina flee the country. He added that constitutional order must be preserved in Madagascar and that while France understood the grievances of the country’s youth, those grievances should not be exploited by military factions.\n\nThe military source said that a French Army Casa aircraft landed in Madagascar’s Sainte Marie airport on Sunday. “Five minutes later, a helicopter arrived and transferred its passenger into the Casa,” the source said, adding that Rajoelina was the passenger.\n\nDemonstrations had erupted in the former French colony on September 25 over water and power shortages but quickly escalated into an uprising over broader grievances, including corruption, bad governance and lack of basic services.\n\nThe anger mirrors recent protests against ruling elites in countries includingNepal, where the prime minister was forced to resign last month, andMorocco.\n\nRajoelina had appeared increasingly isolated after losing the support of CAPSAT, an elite unit which had helped him seize power in a 2009 coup.\n\nCAPSAT joined the protesters over the weekend, saying it refused to fire on them and escorting thousands of demonstrators in the main square of the capital Antananarivo.\n\nIt then said it was taking charge of the military and appointed a new army chief, prompting Rajoelina towarn on Sundayof an attempt to seize power in the island nation off the coast of southern Africa.\n\nOn Monday, a faction of the paramilitary gendarmerie supporting the protests also took control of the gendarmerie at a formal ceremony in the presence of senior government officials, a Reuters witness said.\n\nThe president of the Senate – a focus of public anger during the protests – was relieved of his functions, the Senate said in a statement, and Jean André Ndremanjary was appointed on a temporary basis.\n\nIn the absence of a president, the leader of the Senate takes the post until elections are held.\n\nOn Monday, thousands of people gathered in a square in the capital, shouting “the president must quit now”.\n\nHotel worker Adrianarivony Fanomegantsoa, 22, told Reuters his 300,000-ariary ($67) monthly salary was barely enough to cover food, explaining his reasons for joining the protests.\n\n“In 16 years the president and his government have done nothing except enrich themselves while the people stay poor. And the youth, the Gen Z, suffer the most,” he said.\n\nAt least 22 people have been killed in clashes between protesters and the security forces since September 25, according to the UN.\n\nMadagascar, where the median age is younger than 20, has a population of about 30 million – three-quarters of whom live in poverty, with GDP per capita plunging 45% between independence in 1960 and 2020, according to the World Bank.\n\nWhile the country is best known for producing most of the world’s vanilla, other exports including nickel, cobalt, textiles and shrimp are also vital to foreign earnings and employment.\n\nIn what appeared to have been one of his last acts before leaving the country, Rajoelina issued pardons to several people on Sunday, including two French nationals, according to an internal document seen by Reuters whose contents were verified by a presidency source.\n\nThe two French nationals, Paul Maillot Rafanoharana and Francois Marc Philippe, were convicted of undermining state security in connection with an attempted coup in 2021.",
  "url": "https://edition.cnn.com/2025/10/13/world/madagascar-president-leaves-country-gen-z-protests-intl",
  "scraped_timestamp": "2025-10-15T11:24:28.943893",
  "content_length": 4710,
  "word_count": 749,
  "source_domain": "edition.cnn.com"
}