{
  "title": "Mallojula Venugopal Rao: Key strategist in Maoist hierarchy who rose through the ranks",
  "content": "Mallojula Venugopal Rao (70), a key member of the banned CPI (Maoist)’s politburo, the highest decision-making body of the party, was born into a Brahmin family in Peddapalli , Karimnagar district, Telangana.\n\nVenugopal was the youngest of three sons of Mallojula Venkataiah and Madhuramma. His parents, both deceased—Venkataiah died in 1997 and Madhuramma in 2022— belonged to a family of freedom fighters.\n\nThe second son Anjanna is a temple priest, while the eldest, Mallojula Koteshwara Rao alias Kishenji rose to become one of the most influential leaders in the Maoist movement before being killed in a police encounter in West Bengal on November 24, 2011.\n\nA commerce graduate from Peddapalli, Venugopal was drawn into left-wing extremism early. He abandoned his home and family to dedicate his life to the Maoist ideology. Within the erstwhile People’s War Group (PWG), he operated under several aliases — Bhupathi, Sonu, Master, and Abhay — and quickly rose through the ranks.\n\nAlso Read:Top Maoist leader Sonu surrenders with 60 cadres in Maharashtra: Officials\n\nHe eventually became the head of the CPI (Maoist)’s Dandakaranya Special Zonal Committee in the Gadchiroli region of Maharashtra. Later, he was assigned to expand the proscribed party’s the Western Ghats — stretching from Goa to Idukki in Kerala — as part of its southern expansion strategy.\n\nVenugopal subsequently became a member of both the politburo and Central Military Commission of the party. He was the ideological head of the party as well as its communication specialist and the thread that connected it to the world outside the forests of Chhattisgarh.\n\nFollowing the death ofspokesperson Cherukuri Rajkumar alias Azad in 2010, Venugopal was appointed as the official spokesperson of the CPI (Maoist) and took charge of the party’s publications division.\n\nIntelligence agencies suspect his strategic involvement in the April 2010 Dantewada massacre, where 76 CRPF personnel were killed — one of the deadliest attacks in the history of anti-Maoist operations.\n\nBoth Andhra Pradesh and Chhattisgarh police had announced substantial cash rewards for information leading to his capture.\n\nVenugopal’s wife,Tarakka, who was also a Maoist commander, made headlines in December 2018 when she surrendered to the Maharashtra police along with 10 other Maoists — including eight women and three men. The surrender took place in the presence of then chief minister Devendra Fadnavis in Gadchiroli.\n\nFollowing his brother Kishenji’s death, Venugopal was believed to have taken charge of Maoist resistance against Operation Green Hunt in West Bengal, particularly during the Lalgarh movement. He continued to be regarded as a key strategist in the Maoist hierarchy, operating mostly from deep forest zones across central India.\n\nHis surrender points to the disarray in the party -- with some keen to surrender and a few insisting on keeping the fight going.",
  "url": "https://www.hindustantimes.com/india-news/mallojula-venugopal-rao-key-strategist-in-maoist-hierarchy-who-rose-through-the-ranks-101760434844265.html",
  "scraped_timestamp": "2025-10-14T15:44:52.187790",
  "content_length": 2927,
  "word_count": 455,
  "source_domain": "www.hindustantimes.com"
}