{
  "title": "Maoists torch mobile tower in Jharkhand's Saranda forest",
  "content": "Chaibasa, A mobile tower of a private telecom company was torched allegedly by outlawed CPI in Saranda Forest area of Jharkhand's West Singhbhum district in the early hours of Tuesday, police said.\n\nA group of Maoists had torched a mobile tower and pasted posters at Bahda village under Chota Nagra Police Station limits in the intervening period between Monday late night and early hours of Tuesday, West Singhbhum Superintendent of Police, Amit Renu said.\n\n\"This act, the second in a few days, shows the desperation of the rebels in the face of continuous combing operation against the Left Wing Extremists . Even in the posters, they have asked for stopping police operations. We will continue with the operation along with paramilitary forces with more vigour,\" the SP said.\n\nA group of Maoists had earlier torched a mobile tower of a private telecom company on Saturday past midnight under Jaraikela police station area in the Saranda forest.\n\nAccording to villagers, about a dozen armed Maoists suddenly arrived in the village well past midnight. They first warned the villagers to stay indoors, then doused the tower's panels and battery equipment with petrol and set them on fire.\n\nVillagers claimed that the equipment of the mobile tower kept exploding throughout the night.\n\nThe Maoists also left several posters at the scene threatening to avenge their slain comrades. The posters call for a \"Vengeance Week\" from October 8 to 14 and a shutdown on October 15 in Jharkhand, Bihar, northern Chhattisgarh, West Bengal, and Assam to protest police operations.\n\nDeputy Superintendent of Police, Manoharpur, Jaideep Lakra, said that such targeting of mobile towers is causing resentment among villagers against rebels.\n\n\"Mobile connectivity is important for villagers, especially in forest terrains, especially during emergencies. Such acts of desperation by Maoists are causing anger amongst villagers against rebels,\" said Lakra.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/maoists-torch-mobile-tower-in-jharkhand-s-saranda-forest-101760425401927.html",
  "scraped_timestamp": "2025-10-14T14:21:59.498685",
  "content_length": 2030,
  "word_count": 318,
  "source_domain": "www.hindustantimes.com"
}