{
  "title": "Maria Corina Machado's Nobel win leaked? Norway probes 'espionage' after online bets sound alarm",
  "content": "Amid the controversy over Maria Corina Machado's Nobel Peace Prize win, Norway has announced probe into the unusual betting surge on this year’s recipient ahead of the announcement.\n\nHours before the announcement of the Nobel Peace Prize 2025 winner on October 10, bets on US-based cryptocurrency-based prediction market,Polymarket, spiked hours before it was revealed that the Venezuelan opposition leader was awarded the winner of the prestigious prize.\n\nAlso Read |Maria Corina Machado wins Nobel Peace Prize 2025: Five facts about Venezuelan opposition leader\n\nDays after her win, the Nobel institute has stated that the investigations into possible espionage is underway. Kristian Berg Harpviken, the director of the institute, said on Monday, that several leads are being investigation but “we haven't conclude the probe.”\n\n“The institute is a target of systematic espionage and has been for a long time. Someone here has most likely managed to steal information and made a lot of money from it,\" he added.\n\nHours before Machado's win, one trader on Polymarket, operating under the usernamedirtycup, wagered around $70,000 on her victory.\n\nThat concerned investor, had also only opened their Polymarket account this month and had made no previous bets. As per Polymarket's website, trader ended up making around $30,000 in profit with his bet on the Venezuelan opposition leader.\n\nFurthermore, three accounts at Polymarket that had mainly placed bets on Machado, and ended up making a combined profit of about $90,000, said local business Finansavisen as per Bloomberg.\n\nFollowing Machado's win, many people took to social media platforms to expresses theirdissatisfaction with the Nobel committee's decision.\n\nVenezuela's opposition leader Maria Corina Machado was awarded the Nobel Peace Prize for her nonviolent struggle to restore democracy in her country.\n\nHowever, many political opponents, leftist commentators, and international rights groups have criticised her win, linked her to conservative political movements in Europe and for being too close to right-wing US interests.\n\nAlso Read|Maria Corina Machado dedicates Nobel Peace Prize to Donald Trump. His 'silent' response\n\nMachado has also been criticised for her support for Israel's Likud Party (led by Benjamin Netanyahu) and anti-Muslim fascism in Europe.\n\n\"Ms Machado is a vocal supporter of Israel's racist Likud Party and earlier this year she delivered remarks at a conference of European fascists, including Geert Wilders and Marie Le Pen, which openly called for a new Reconquista, referencing the ethnic cleansing of Spanish Muslims and Jews in the 1500s,\" said the statement issued by the Council on American-Islamic Relations (CAIR).\n\nformed Spanish politician Pablo Iglesias also criticised her win and accused Machado of trying to stage a coup in her country \"for years.\"\n\nIn other news, Venezuela announced it hasshut its embassy in Norway.While Machado's Nobel win is likely one of the reasons, Venezuela's foreign ministry said that the Maduro government has ordered the closure of its embassy in Oslo due to an internal \"reorganisation\" of its diplomatic missions.\n\nAlong with Norway, Venezuela also shut its embassies in Australia.",
  "url": "https://www.hindustantimes.com/world-news/maria-corina-machado-nobel-peace-prize-win-leaked-norway-probes-espionage-after-online-bets-sound-alarm-101760431278286.html",
  "scraped_timestamp": "2025-10-14T15:51:00.570193",
  "content_length": 3219,
  "word_count": 488,
  "source_domain": "www.hindustantimes.com"
}