{
  "title": "Massive explosion in Hillside, New Jersey, sparks five-alarm fire, shocking video surfaces | Watch",
  "content": "Amassive explosionin Hillside,New Jersey, triggered a five-alarm fire that spread to several businesses on Tuesday, October 14, CBS News reported A shocking video of the fire has surfaced on social media. Residents in the area have been advised to stay indoors to avoid exposure to chemicals and tires burning.\n\nA video doing the rounds on X shows a huge fire burning after the blast. A witness can be heard exclaiming, “Oh my God!”\n\nWhat we know so farHillsideMayor Dahlia Vertreese said that there was a massive explosion inside an autobody shop at the corner of Maple and Conklin avenues just after 7 pm. Vertreese added that the fire spread down the block to Winans Avenue, and damaged six or seven businesses. Multiple homes were damaged too, and around 31 residents have been displaced.\"It started in the automotive shop, so you got multiple chemicals in there,\" Hillside Fire Chief Rashawn Carey said. \"The smoke itself is toxic, so we're trying to keep everyone back, and if it does proceed, we will have to monitor the air for testing.\"Read More |Tennessee bomb factory blast: All 18 missing people presumed dead, officials say ‘we have recovered no survivors’Witness Tanya Cues said, \"When I walked to the corner, the fire was rising up, and they poured water on it to let it go down, then we heard the explosion.”Vertreese said that among the businesses that caught fire was a hair salon. The flames are believed to have spread to chemicals inside the building. The mayor also said that this was the second-worst fire in Hillside in almost two decades.While CBS News and nj.com reported that it was a five-alarm fire, Vertreese said in aFacebook postthat it was a six-alarm fire. “We have an active 6 alarm fire on Maple Avenue. There are no fatalities, but a few families are displaced. If you are or know someone impacted and need assistance please contact OEM at 973-223-1193,” Vertreese wrote.Read More |Tennessee explosion before and after: Harrowing photos reveal aftermath of explosive plant blast that killed 16It could take several hours to bring the blaze under control, officials have said. The mayor said that at least one firefighter was injured, but the extent of the injuries remain unclear. Volunteers are on scene to help those who were displaced, the Red Cross said.\n\nHillsideMayor Dahlia Vertreese said that there was a massive explosion inside an autobody shop at the corner of Maple and Conklin avenues just after 7 pm. Vertreese added that the fire spread down the block to Winans Avenue, and damaged six or seven businesses. Multiple homes were damaged too, and around 31 residents have been displaced.\n\n\"It started in the automotive shop, so you got multiple chemicals in there,\" Hillside Fire Chief Rashawn Carey said. \"The smoke itself is toxic, so we're trying to keep everyone back, and if it does proceed, we will have to monitor the air for testing.\"\n\nRead More |Tennessee bomb factory blast: All 18 missing people presumed dead, officials say ‘we have recovered no survivors’\n\nWitness Tanya Cues said, \"When I walked to the corner, the fire was rising up, and they poured water on it to let it go down, then we heard the explosion.”\n\nVertreese said that among the businesses that caught fire was a hair salon. The flames are believed to have spread to chemicals inside the building. The mayor also said that this was the second-worst fire in Hillside in almost two decades.\n\nWhile CBS News and nj.com reported that it was a five-alarm fire, Vertreese said in aFacebook postthat it was a six-alarm fire. “We have an active 6 alarm fire on Maple Avenue. There are no fatalities, but a few families are displaced. If you are or know someone impacted and need assistance please contact OEM at 973-223-1193,” Vertreese wrote.\n\nRead More |Tennessee explosion before and after: Harrowing photos reveal aftermath of explosive plant blast that killed 16\n\nIt could take several hours to bring the blaze under control, officials have said. The mayor said that at least one firefighter was injured, but the extent of the injuries remain unclear. Volunteers are on scene to help those who were displaced, the Red Cross said.",
  "url": "https://www.hindustantimes.com/world-news/us-news/massive-explosion-in-hillside-new-jersey-sparks-five-alarm-fire-shocking-video-surfaces-watch-101760502719704.html",
  "scraped_timestamp": "2025-10-15T10:30:33.363099",
  "content_length": 4153,
  "word_count": 700,
  "source_domain": "www.hindustantimes.com"
}