{
  "title": "Microsoft disables services for Israeli military amid surveillance allegations",
  "content": "Microsoft on Thursday said that it disabled some services used by an Israeli military unit after preliminary evidence supported media reports of mass surveillance of Palestinian phone calls.\n\nA joint investigation bythe Guardianwith the Israeli-Palestinian publication+972 Magazineand Hebrew-language outletLocal Callrevealed that Microsoft’s Azure cloud platform enables Israel’s military surveillance agency, Unit 8200, to store a giant trove of calls daily for extended periods of time.\n\nUnit 8200 is an elite cyber warfare unit within the Israeli Army responsible for clandestine operations.\n\nArmed withAzure’s near-limitless storage capacity, Unit 8200 began building a powerful new mass surveillance tool: a sweeping and intrusive system that collects and stores recordings of millions of mobile phone calls made each day by Palestinians in Gaza and the West Bank, read the report by The Guardian.\n\nAccording to three Unit 8200 sources, the cloud-based storage platform has facilitated the preparation of deadly airstrikes and has shaped military operations inGazaand theWest Bank.\n\nMicrosoft claims Nadella was unaware of what kind of data Unit 8200 planned to store in Azure. But a cache of leaked Microsoft documents and interviews with 11 sources from the company and Israeli military intelligence reveals how Azure has been used by Unit 8200 to store this expansive archive of everyday Palestinian communications.\n\nThat prompted an internal review byMicrosoft, reported news agency Reuters.\n\n“We do not provide technology to facilitate mass surveillance of civilians. We have applied this principle in every country around the world, and we have insisted on it repeatedly for more than two decades. This is why we explained publicly on August 15 that Microsoft’s standard terms of service prohibit the use of our technology for mass surveillance of civilians,” Microsoft President Brad Smith said in acompany blog.\n\nThe review is ongoing, but details of the Israel Ministry of Defense's (IMOD) consumption of Azure storage capacity in the Netherlands and the use of AI services supported the Guardian's reporting,\n\n“Second, we respect and protect the privacy rights of our customers. This means, among other things, that we do not access our customers’ content in this type of investigation,” Smith said adding that Microsoft will continue to be a company guided by principles and ethics and that the company will hold every decision, statement, and action to this standard. “This is non-negotiable.”\n\nAt the time the media investigation was published, Israel's military told the Guardian its work with firms like Microsoft was based on \"legally supervised agreements.\" The military later added that Microsoft \"is not and has not been working with the (Israeli military) on the storage or processing of data.\"\n\nThe Israeli ministry gave no comment on this announcement, Reuters reported quoting a spokesperson who spoke to NBC News.\n\nMicrosoft has been among the most prominent of companies that have faced protests over ties to Israel as the humanitarian crisis in Gaza from Israel's military assault has mounted and images of starvingPalestinians, including children, have sparked global outrage.\n\nSome recent protests on company premises have led to firings of some employees who took part, including two who joined a sit-in at Smith's office. Microsoft says the terminations followed breaches of company policies and the on-site demonstrations had created what it called significant safety concerns.\n\nPro-Palestinian groups such as the Council on American Islamic Relations (CAIR) and a tech industry worker-led campaign group named No Azure for Apartheid welcomed the decision.\n\n“This is a welcome step and a point of vindication for those brave tech workers who stood up and protested,” Reuters reported quoting executive director of CAIR's Washington state chapter, Imraan Siddiqi as saying. The groups have demanded that Microsoft cut all ties with theIsraeli government.\n\nIsrael's two-year long assault on Gaza has killed tens of thousands of people and internally displaced Gaza's entire population. Multiple rights experts, scholars and a U.N. inquiry say it amounts to genocide.\n\nIsrael calls its actions self-defense after the October 2023 attack led by Palestinian Hamas militants that killed 1,200 people and in which more than 250 were taken hostage.",
  "url": "https://www.hindustantimes.com/world-news/microsoft-disables-services-for-israeli-military-amid-palestinian-surveillance-allegations-101758861670413.html",
  "scraped_timestamp": "2025-09-26T16:26:01.384910",
  "content_length": 4377,
  "word_count": 664,
  "source_domain": "www.hindustantimes.com"
}