{
  "title": "MiG-21 to retire: ‘No trainers when it first came to us’- IAF veterans recall aircraft’s legacy ahead of its last flight",
  "content": "TheIndian Air Force‘sMiG-21, the country’s first supersonic fighter and interceptor aircraft, whose induction in the early 1960s catapulted the force into the jet age, will roar in the Indian skies for one last time on Friday, leaving an enduring legacy and countless stories in its illustrious trail.\n\nBut more than anyone else, the pilots who have flown these Soviet-era machines over the decades will bid this workhorse of the Indian Air Force (IAF) a nostalgic farewell.\n\nVeteran pilot and former IAF chief, Air Chief Marshal A Y Tipnis (retd) says the MiG-21 “taught us how to be innovative and produce results”.\n\nIn a recorded video podcast shared by the IAF on X a day ahead of the high-profile decommissioning ceremony in Chandigarh, he recalled some of the challenges that he and other pilots who flew the MiG-21 aircraft faced when it was inducted.\n\nTipnis began as a fighter pilot in 1960, and, early on he became part of MiG-21 squadrons. In July 1977, he took over as the Commanding Officer of No. 23 Squadron equipped with MiG-21 Bis aircraft, according to the IAF website.\n\n“When the MiG-21 came to us, the first type that came to us was the Type-74, there were no trainers at that time. The first solo was on MiG-21 itself. Difficulty was that not only there was no trainer, no simulator, but also in the entire cockpit, nothing was written in English, it was all in Russian,” he recalls with a whiff of nostalgia.\n\nThe veteran air warrior said the speed measurement unit for them also suddenly changed from “knots to km/hr” and it too was a challenge as pilots were “used to knots”.\n\n“So, in the first solo, you are mostly lost, until you came back, and didn’t know how to manage it,” he said.\n\nThe former top IAF officer, who served as the Chief of the Air Staff from December 1998 to December 2001, also shared that “in MiG-21, we were all flying in spacesuits, believe it or not”.\n\nAstronaut Yuri Gagarin, when he went up in space, had the same pressure suit and pressure helmet for the first solo, he said, recalling, “We could hardly move our neck from one side to another.” According to the tentative programme for the decommissioning event, Tipnis is among the six former IAF chiefs, others being S Krishnaswamy, S P Tyagi, P V Naik, B S Dhanoa and R K S Bhadauria, who will also attend Friday’s ceremony in Chandigarh, where the iconic aircraft was first inducted over six decades ago.\n\nHaving been part of the major share of the aircraft in IAF’s inventory for a long time, several of these Russian-origin fighter jets have been involved in crashes and resulting loss of lives in the past, prompting some to describe these legacy platforms as ‘flying coffins’.\n\nA former IAF pilot, who did not wish to be named, said the use of phrases like ‘flying coffin’ by a section of people to describe any aircraft linked with accidents is not appropriate.\n\n“It also hits the morale of family members of pilots, if such terms are used to describe an aircraft they may be flying,” he said.\n\nThe veteran air warrior also underlined that MiG-21 took part in wars in 1965 and 1971, and the 1999 Kargil conflict, as well as the 2019 Balakot strike.\n\nIn 1999, as the Chief of the Air Staff, Air Chief Marshal Tipnis oversaw Operation Safed Sagar, the IAF’s critical campaign during the conflict.\n\nAnd, as the IAF gears up for Mikoyan-Gurevich MiG-21’s swansong, the veterans and current air warriors agree that these were jets that “defined generations of pilots”.\n\nTipnis says IAF pilots used their agility with adaptability, because it was built for higher altitude flying, “but, we started using it for strike purposes, and I think, it speaks tremendously for the IAF”.\n\n“By no means, the MiG-21 is designed for low-flying, because the visibility forward, sideward is limited. The IAF, the way it adapted to low-level flying at night, was a remarkable achievement. The adaptation for this purpose was outstanding,” he added.\n\nAir Commodore Nitin Sathe (retd) in the podcast says, for over six decades, the MiG-21 has been a “backbone of the IAF”, and “an icon, a trusted companion in war and peace, and a proving ground for generations of fighter pilots”.\n\nThe last of the MiG-21 jets, belonging to Squadron No. 23 and nicknamed “Panthers”, will be given a farewell at the ceremony to be held at the Chandigarh Air Force station.\n\nAs part of the symbolic farewell, IAF Chief Air Chief Marshal A P Singh flew solo sorties of the MiG-21 from Nal air base on August 18-19, marking an emotional moment for the force and for generations of pilots trained on the Russian-origin fighter jet that served the force for 62 years.\n\nGrp Capt Nanda Rajender, Commanding Officer of Squadron No. 23, who has flown MiG-21 and MiG-21 Bison aircraft, says, “From being the most advanced fighter in the 1965 war and 1971 war, it has been in the vanguard of all military actions by India. Even during Operation Sindoor, it was a legacy fighter, however, it was tasked for ORP (Operational Readiness Platform) duties, and we were ready to defend the skies if the demand was raised.” In the podcast, Air Commodore Sathe (retd) quoted the late veteran air warrior P C Lal, later IAF chief, who had said, “The MiG-21 gave the IAF wings, it never had before.” And, on Friday, the last of these machines, carrying the weight of history on their wings, will fly into the sunset.",
  "url": "https://www.financialexpress.com/business/defence/iaf-veterans-recall-legacy-as-mig-21-prepares-for-last-flight/3989969/",
  "scraped_timestamp": "2025-10-14T14:21:26.830632",
  "content_length": 5364,
  "word_count": 934,
  "source_domain": "www.financialexpress.com"
}