{
  "title": "MiG 21 added many proud moments in military aviation journey: Rajnath",
  "content": "Chandigarh, Defence Minister Rajnath Singh on Friday said MiG 21 is not only an aircraft or a machine but a testimony to the deep ties between India and Russia.\n\nSingh was addressing a gathering on the occasion of the decommissioning ceremony of the Russian-origin MiG-21 at the Chandigarh Air Force Station here.\n\nThe iconic Mikoyan-Gurevich MiG-21 fighter jets, which have been the backbone of Indian Air Force's combat fleet for over six decades, flew for the last time in Indian skies here on Friday, bringing the curtain down on a 62-year-long journey.\n\nThe legendary MiG-21 fighter jets have been part of the IAF's combat fleet since the 1960s.\n\nRemembering the valour of the armed forces, Singh said the MiG 21 has a big contribution in their journey of bravery.\n\n\"We gathered here for the final operational sortie of MiG 21. Being amongst you, I have emotions of pride and gratitude,\" Singh said.\n\n\"When we are today giving a send-off to MiG 21 from its operational journey, I feel that we are giving a send-off to a chapter which will be written in golden letters in military aviation history,\" he said.\n\n\"MiG 21 is not only an aircraft or a machine but it is also a proof of deep ties between India and Russia,\" he stated.\n\nThe history of military aviation is incredible, he said, adding that MiG 21 aircraft added many proud moments in the military aviation journey.\n\n\"In the history of the world's military aviation, there has not been any fighter jet which was made in such a big number, he stated.\n\nIn the world, over 11,500 MiG 21 aircraft were made and of them, 850 fighter jets remained part of the IAF, he said and added, \"This number is the testimony of this aircraft's popularity, credibility and multi-dimensional capability\".\n\n\"MiG 21 has been a witness to many brave works. Its contribution has not been limited to one incident or a war,\" he said as he recalled its role in the 1971 war with Pakistan, 1999 Kargil conflict as well as 2019 Balakot air strikes.\n\nIn its history, there have been many occasions when MiG 21 proved its decisive capacity, he said.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/mig-21-added-many-proud-moments-in-military-aviation-journey-rajnath-101758873408052.html",
  "scraped_timestamp": "2025-09-26T16:00:36.891203",
  "content_length": 2175,
  "word_count": 377,
  "source_domain": "www.hindustantimes.com"
}