{
  "title": "Ministers defend Bengaluru’s development amidst Biocon chairperson’s criticism on roads, waste management",
  "content": "Karnataka Deputy Chief Minister DK Shivakumar on Tuesday urged citizens to “build Bengaluru up, not tear it down,” after Biocon Chairperson Kiran Mazumdar-Shaw publicly criticised the city’s poor roads and waste management.\n\nResponding to Mazumdar-Shaw’s post on X about a foreign visitor’s dismay over Bengaluru’s infrastructure, Shivakumar said the government was acting “with focus and urgency” to address civic challenges. “Yes, challenges exist, but we’re addressing them with focus and urgency.₹1,100 crore has been sanctioned for road repairs, 10,000+ potholes identified, and over 5,000 already fixed on priority,” he said.\n\nHe added that under the newly constituted Greater Bengaluru Authority (GBA), the East Corporation would retain₹1,673 crore of its own revenue to improve infrastructure in 50 wards, benefiting key IT corridors. “With major works like the CSB-KR Puram redevelopment and elevated corridors, we are strengthening infrastructure for citizens, employees, and companies alike,” he said, calling for collective effort. “The world sees India through Bengaluru, and we owe it to our city to rise united.”\n\nEarlier, Mazumdar-Shaw had written, “I had an overseas business visitor to Biocon Park who said, ‘Why are the roads so bad and why is there so much garbage around? Doesn’t the government want to support investment? I have just come from China and can’t understand why India can’t get its act together, especially when the winds are favourable?’”\n\nIndustry leaders’ criticism triggered responses from multiple state ministers, who defended the ongoing infrastructure efforts. Minister for IT-BT Priyank Kharge said that while issues persist, “work is in progress” and development is happening “at a rapid pace.” He added, “I am not sure which part of Bengaluru they have seen. We are growing fast, and whatever is necessary for infrastructure improvement, we are doing it.”\n\nKharge acknowledged that every global city faces similar challenges, comparing Bengaluru’s growth trajectory to that of San Francisco and London. “It is the prime responsibility of the government, and we will do it,” he said.\n\nThe minister also defended the government’s openness to public criticism, arguing that prominent citizens feel free to speak up because of the administration’s tolerance. “If you make constructive criticism in Maharashtra or Uttar Pradesh, you will be in jail. If you do it in Madhya Pradesh, you will be trolled. But here, we respond positively and work on it. It’s our responsibility,” he said.\n\nAttributing the surge in potholes to “unprecedented and continuous rains” over the past six weeks, Kharge said repair work was ongoing and that the GBA commissioner was regularly updating data on potholes being filled. “Bengaluru is growing at a very fast pace. We grew at 10.5 percent last year. We are not denying the issues, but we are finding solutions,” he said.\n\nWhen asked why business leaders often resort to social media instead of direct dialogue, Kharge said Mazumdar-Shaw, Mohandas Pai, and other industry figures have long been part of task forces shaping Bengaluru’s policies. “Their suggestions are always taken into account while forming policies. We are just a phone call away to address issues. If everyone works with collective responsibility, such posts will reduce,” he said.\n\nKarnataka Industries Minister M.B. Patil also weighed in, acknowledging Mazumdar-Shaw’s contributions to Bengaluru’s global reputation but urging restraint in public criticism. “Kiran Mazumdar is a big asset to our state and our country. She has created a name for Bengaluru with Biocon, and the city has given back to her -- it is mutual,” he said. “Thousands of crores have been allocated, and the work is ongoing. When development work is underway, tweeting again is not in good taste.”\n\nEarlier this month, Shivakumar had blamed the previous BJP government for the poor state of Bengaluru’s roads, which have drawn mounting criticism from opposition leaders and residents alike. The deputy chief minister, who oversees Bengaluru’s civic affairs, has maintained that road and drainage upgrades remain his government’s top priority.",
  "url": "https://www.hindustantimes.com/india-news/ministers-defend-bengaluru-s-development-amidst-biocon-chairperson-s-criticism-on-roads-waste-management-101760469837644.html",
  "scraped_timestamp": "2025-10-15T11:03:31.649493",
  "content_length": 4160,
  "word_count": 641,
  "source_domain": "www.hindustantimes.com"
}