{
  "title": "‘Mr Prime Minister, you are…’: Trump's handwritten note to Modi on photo | Decoding equation amid tariff tiff",
  "content": "When US ambassador-designate Sergio Gor met PM Narendra Modi on Saturday, October 11, he carried with him a framed combo of photos of PM Modi and President Donald Trump, with the latter's message and signatures on it.\n\n“Mr Prime Minister, you are great,” read Trump's characteristically straightforward message, apparently handwritten with a mega marker pen that Trump often uses.\n\nSergio Gor, part of Trump's inner circle, also mentioned later how the US President considers Modi “a great personal friend” — continuing with the most recent bout of bonhomie between the leaders of the world's biggest economy and the largest democracy, respectively.\n\nThe two men have kept up what's described as a personal equation even as the two countries are at a two-decade ebb in their relations following imposition of massive trade tariffs by Trump.\n\nModi recently spoke to Trump to personally praise his peace plan for Gaza that has all but paused Israel's military action in occupied Palestinian territories. The PM also posted messages of appreciation across social media platforms in multiple languages earlier.\n\nBut Trump has been apparently acerbic and seemingly cozy, changing by the week almost.\n\nMid-September, he called and spoke to Modi when he turned 75, after which the PM said “thank you, my friend” on X, adding: “Like you, I am also fully committed to taking the India-US Comprehensive and Global Partnership to new heights.”\n\nThe same month, at the biggest global stage of diplomacy, at the United Nations General Assembly, Trump then called India and China the “primary funders” of Russia's war in Ukraine.\n\nThis was in keeping with the aggressive line the US has taken on the tariffs, saying half of the 50% levy is for India's purchase of oil from Russia.\n\nJust days before that, Modi had reacted positively on X to Trump's comments saying Modi is “great” and “a friend”. The PM wrote on X: “Deeply appreciate and fully reciprocate President Trump’s sentiments and positive assessment of our ties.\"\n\nThe trade deal talks — which were halted amid angry comments by Trump's commerce secretary Howard Lutnick and adviser Peter Navarro — resumed after this social media bonhomie. Trump's birthday call came after it. And went on to say to reporters the same week that he would want Europe also to put sanctions on Russia — essentially meaning tariffs on its buyers.\n\n“As you know, I'm very close to India. I'm very close to the Prime Minister of India, I spoke to him the other day to wish him a Happy Birthday. We have a very good relationship and he put out a beautiful statement too. But I sanctioned them,” Trump said.\n\nAt the beginning of it, Trump had burst out after Modi's meetings with Russia's Vladimir Putin and China's Xi Jinping in Tianjin during the Shanghai Cooperation Organisation (SCO) summit.\n\nThis was his reaction to the camaraderie between Modi, Putin and Xi, wherein Putin had called Modi a “dear friend” and Xi had slammed the US as a “bully\".\n\nModi had traveled to China in a major diplomatic reset after tariffs on India first went to a flat 25% in early August, and then doubled to 50% by the end of that month, while Trump's administration blasted Delhi for buying Russian oil and weapons.\n\nThe envoy-designate now, Sergio Gor, has spoken with hope that India and the US would soon have a deal. He has also spoken of the need to keep India close with an eye on China. But he hasn't yet formally taken up his India assignment. He is in India ahead of that for some courtesy calls.\n\nGiven the many turns in the last eight to ten weeks alone, it remains to be seen how the Modi-Trump equation plays out further on the ties.\n\nTrade deal talks have resumed but India's foreign minister S Jaishankar clearly stated last week that the country has “red lines” around its farm and dairy sectors. US commerce secretary Lutnick has stuck to “stop buying Russian oil” while adding a condition for a deal: that India must be liberal in opening up its markets if it wants tariffs reduced.\n\nThere is no clarity on when Trump and Modi could meet next.\n\nTrump has announced to hike the tariffs to over 100% on China just this week, and recently had a friendly chat with President Lula De Silva of Brazil, which also faces 50% tariffs like India. In management terms, he remains ever-ready to pivot.\n\nTrump has declared repeatedly that “tariff” is his favourite word in the dictionary, but continues to use the words “great” and “persona” and “friend” for PM Modi too.\n\nThe Opposition in India, meanwhile, regularly posts photos of when Trump and Modi held events for each other — ‘Howdy Modi’ and ‘Namaste Trump’ — during the former's first term as US president.\n\nIn the second term, a lot has moved since that February meeting when Modi went to the US soon after Trump took oath. The photo combo that Sergio Gor gave to Modi is from that meeting.",
  "url": "https://www.hindustantimes.com/india-news/mr-prime-minister-you-are-great-trumps-message-to-modi-signed-on-photo-tracing-their-equation-amid-tariff-tiff-101760192564460.html",
  "scraped_timestamp": "2025-10-11T23:45:44.717894",
  "content_length": 4865,
  "word_count": 837,
  "source_domain": "www.hindustantimes.com"
}