{
  "title": "‘Muslim’s faith is incomplete until…’: Asaduddin Owaisi reacts to 'I Love Muhammad' row",
  "content": "Asaduddin Owaisi of the AIMIM on Friday reacted sharply to the controversy over posters with “I Love Muhammad” written on them in Uttar Pradesh's Kanpur, questioning why such expressions of faith should be seen as provocative.\n\n“If there is an ‘I Love Mahadev’ group then what is the problem? What is anti-national here? What sort of violence does this promote? If the word is ‘love’ then why is anyone having a problem? I think we have to play the ‘Mohabbat Zindabad’ song from Mughal-e-Azam for these people. If there can be a ‘Happy Birthday PM Modi’ poster then why can’t there be an ‘I Love Prophet Muhammad’ poster?” Asaduddin Owaisi told reporters in poll-bound Bihar's Purnea.\n\nOwaisi also cited Article 25 of the Constitution, saying freedom of religion was a fundamental right. “What is anti-national about this? Which part of this promotes violence? … A Muslim’s faith is not complete until he loves Prophet Muhammad more than everything else in the world. What message are you sending to the world by objecting to this?” he said.\n\nThe AIMIM leader also criticised the Uttar Pradesh government, alleging selective restrictions. “In UP, the ADGP is saying that new posters will not be allowed. But ‘Happy Birthday Prime Minister’ or ‘Happy Birthday Chief Minister’ will be allowed. Then make a law that nobody in this country will talk about love,” he added.\n\nThe row began on September 9 when police in Kanpur filed an FIR against nine people and 15 unidentified persons for allegedly putting up “I Love Mohammad” boards on a road during a Barawafat procession on September 4. Hindu groups objected, calling it a “new trend” and a deliberate provocation.\n\nThe matter drew wider attention after Owaisi defended the posters on social media, insisting that “saying I Love Muhammad is not a crime.”\n\nOwaisi's public criticism of the police action comes days after Jammu and Kashmir chief minister Omar Abdullah on Wednesday fiercely defended the right to express love for the Prophet Muhammad, questioning how three simple words — “I Love Muhammad” — could be deemed unlawful and urging the courts to act swiftly.\n\nOmar Abdullah said it must mean someone is truly mentally unwell to file a case over these three words. He said he would like the courts to quickly set this right and asked how writing ‘I Love Muhammad’ could be unlawful.\n\n“Why should anyone object to writing this? Who can have an issue with these three words? I cannot understand how writing these three words can lead to an arrest. It must mean someone is truly mentally unwell to file a case over these three words. I would like the courts to quickly set this right. How is writing ‘I Love Muhammad’ unlawful?” Omar told reporters.\n\nAbdullah said even if linked to a particular religion, writing ‘I Love Muhammad’ should not be an issue, as people of other faiths also express devotion to their gurus or deities.\n\n“Even if you link it to a religion, what is wrong with it? Don’t followers of other religions write about their deities? Don’t our Sikh brothers and sisters write about their gurus? Don’t our Hindu brothers and sisters write about their various gods? They do. Go anywhere outside Jammu and Kashmir, and you will hardly find a vehicle without a picture of a deity. If that is not unlawful, then how is this?” Omar asked.",
  "url": "https://www.hindustantimes.com/india-news/muslims-faith-is-incomplete-until-asaduddin-owaisi-reacts-to-i-love-muhammad-row-101758872712132.html",
  "scraped_timestamp": "2025-09-26T15:49:31.694273",
  "content_length": 3309,
  "word_count": 565,
  "source_domain": "www.hindustantimes.com"
}