{
  "title": "Netanyahu to address UN as Trump vows to block West Bank annexation",
  "content": "• Israeli Prime Minister Benjamin Netanyahu’s speech at the UN today will bebroadcast in Gaza, according to two Israeli officials. Ahead of the address,Israel launched a campaignin New York featuring signs on the October 7 attacks, which a source said is a central theme of the speech.\n\n• Netanyahu will meet Monday with US President Donald Trump, who has vowed to block any attempt by Israel toannex the West Bank— a message that comes on the heels of a US-proposedpeace planrecently discussed with Arab leaders.\n\n• A senior Hamas official hasdefendedcarrying out the October 7 attacks, telling CNN that it created a “golden moment” for the Palestinian cause despite the tens of thousands killed in Gaza.\n\nCNN’s Jeremy Diamond asked Hamas’ Ghazi Hamad about the placement of hostages still in Gaza and why the Red Cross has not been able to access them.\n\nWatch below andread more on the interview here.\n\nCNN’s Jeremy Diamond challenges Hamas senior official, Ghazi Hamad, on the state of the remaining hostages in Gaza, after its military wing announced that hostages had been spread out throughout Gaza City ahead of Israel’s invasion of the city.#CNN#News\n\nFormer British Prime Minister Tony Blair has been in discussions with US authorities about running a transitional authority in Gaza in the event of a ceasefire, the UK’s national broadcaster BBC and the Financial Times have reported.\n\nBlair has previously been in talks with US President Donald Trump regarding post-conflict plans in Gaza. Trump discussed the latest proposals this week in his meeting with Arab leaders at the United Nations, according to British media.\n\nAmong Trump’s proposals was a plan to establish a Palestinian committee to administer the Gaza Strip along with an international supervisory board that would oversee it, according to the Financial Times, citing people briefed on the plans.\n\nTwo Israeli sources told CNN that Trump aims to put Blair in charge of interim governance of Gaza.\n\nThe BBC also reported that it understands the idea of Blair leading a transitional authority has gained support in Washington, DC.\n\nCNN has reached out to Blair’s think tank, the Tony Blair Institute for Global Change, for comment. CNN also asked the US State Department and White House for comment on the proposal.\n\nBlair, who served as British prime minister from 1997 to 2007 and led his country into the war in Iraq, raised eyebrows in August afterattending a White House summiton the future of Gaza.\n\nThe contents of that meeting were not made public, although Trump’s envoy Steve Witkoff told Fox News ahead of the gathering that it would focus on the administration’s “comprehensive plan” for Gaza after the war ends.\n\nCNN’s Riane Lumer contributed to this report.\n\nIn August, the Integrated Food Security Phase Classification confirmed that a famine was taking place in Gaza, but there had already been hundreds of hunger and malnutrition-related deaths before then.\n\nHere’s why the classification took so long when alarm bells had been ringing months in advance:\n\nThe Israeli miliary plans to broadcast Prime Minister Benjamin Netanyahu’s speech at the UN General Assembly to Gaza residents today, using loudspeakers inside and along the strip, according to two Israeli officials.\n\nOne of the sources said the directive came from the Prime Minister’s Office (PMO) and is intended to address Palestinians in Gaza directly, attempting to distinguish them from Hamas.\n\nAccording to a report in the Haaretz daily newspaper, the Israeli military has already prepared an order to transmit the speech using loudspeaker systems mounted on trucks and deployed along the border fence.\n\nCNN has reached out to the PMO and military for comment. It’s unclear if the speech will be translated into Arabic so that more of the Palestinian population in Gaza can understand it.\n\nIn response to the news, Israeli opposition leader Yair Lapid wrote on X: “What’s needed is to place loudspeakers at the UN so that Netanyahu finally hears the cries of the hostages.”\n\nIsraeli Prime Minister Benjamin Netanyahu is set to address the UN General Assembly in New York today in a speech expected to focus heavily on the war in Gaza.\n\nIn advance of his remarks, Israel launched a campaign around UN headquarters and in New York’s Times Square featuring billboards and trucks carrying the slogan “REMEMBER OCTOBER 7,” which a source said is expected to be a central theme of the address.\n\nFrance and several other Western nationsformally declaredtheir recognition of a Palestinian state at the UN earlier in the week in a move that deepens Israel’s international isolation.\n\nWith the backing of the United States, a defiant Netanyahu vowed a response.\n\nOn Sunday, Netanyahu said Israelwill fight at the UNand other international forums “against the slanderous propaganda aimed at us,” as well as the calls to create a Palestinian state that he said “will endanger our existence and constitute an absurd prize for terrorism.”\n\nNetanyahu has not said publicly what he intends to do, but that Israel’s response would come after he meetsUS President Donald Trumpon Monday.\n\nIsraeli attacks across Gaza have killed at least 83 Palestinians and wounded 216 over the past 24 hours, the health ministry in the enclave said.\n\nThis comes as Israel continues its military assault on Gaza City as part of its plan to occupy it, and as the war is a key focus of discussions at the UN General Assembly this week.\n\nAt least 388,400 Palestinians have fled from the north, mostly from Gaza City, heading southward between August 14 and September 23, the UN Office for the Coordination of Humanitarian Affairs (OCHA) said yesterday. Hundreds of thousands remain in the enclave’s largest city.\n\nThe displaced mostly move to Deir Al-Balah and Khan Younis, which are both “projected to face famine by the end of September 2025,” OCHA added.\n\nAfter speaking with Israeli Prime Minister Benjamin Netanyahu yesterday, President Donald Trump said that a Gaza deal was “pretty close.”\n\nThe US president also said he spoke to other leaders in the Middle East.\n\n“We spoke with Bibi Netanyahu today and we spoke to all the leaders in the Middle East, who are great people, and we’re getting pretty close to having a deal on Gaza and maybe even on peace,” Trump said.\n\nEarlier this week, Trump proposed to Arab leaders a21-pointpeace plan to end thewar in Gaza, which led to an exchange of ideas among the leaders over how to agree on a final proposal, according to a senior administration official and regional sources.\n\nMicrosoft hasterminateda set of services for the Israeli military after an investigation suggested Israel was using the company’s cloud computing technology for mass surveillance of Palestinians.\n\nThe move comes after an investigation by The Guardian and Israel’s +972 Magazine reported that Israel’s military intelligence unit, known as 8200, relied on Microsoft Azure to store millions of phone calls made by Palestinians in Gaza and the occupied West Bank.\n\nMicrosoft announced on August 15 that it had begun a review of the allegations. Microsoft President Brad Smith said Microsoft does not provide technology “to facilitate mass surveillance of civilians,” a principle it has applied “in every country around the world.”\n\nThe company said it found evidence that supports elements of the investigation from the news outlets, including Israel’s “consumption of Azure storage capacity in the Netherlands and the use of AI services.”\n\nYesterday, President Donald Trump said hewould not allow Israel to annex the West Bank, and that he had spoken to Israeli Prime Minister Benjamin Netanyahu earlier in the day on the topic.\n\n“It’s been enough. It’s time to stop now,” he said.\n\nNetanyahu, who is in the US to attend theUnited Nations General Assemblyand meet with Trump, signed a controversial West Banksettlement expansion plan this month.\n\nTrump’s public message came two days after the US proposed to Arab leaders a21-pointpeace plan to end thewar in Gaza, which led to an exchange of ideas among the leaders over how to agree on a final proposal, according to a senior administration official and regional sources.\n\nWhile regional leaders endorsed large parts of Trump’s plan, they made a series of points that they wanted to be included, including noannexation of the occupied West Bankby Israel, a regional diplomat told CNN.\n\nSaudi Foreign Minister Prince Faisal bin Farhan Al Saud, who attended the meeting with Trump, said he believes the president understands “very well the risks and dangers of annexation in the West Bank.” Saudi Arabia has said that nonormalization of tieswith Israel would take place until it commits to a pathway to Palestinian statehood.\n\nFrench President Emmanuel Macron also foreshadowed Trump’s stance, saying an annexation would be a “red line” for the US and would mark the end of the Abraham Accords — a Trump-brokered agreement under which Israel normalized relations with three Arab nations.\n\nThe UAE, a signatory to the accords, has previouslysaidannexation would be a “red line” that would “end the pursuit of regional integration.”\n\nPrime Minister Benjamin Netanyahu’s flight to the UStook a circuitous routein an apparent effort to avoid countries that could enforce an outstandingarrest warrantagainst him for alleged war crimes.\n\nNetanyahu left Tel Aviv on Wednesday evening to speak at the UN General Assembly and to meet with President Donald Trump.\n\nBut his flight, which would normally overfly several European countries, instead flew the length of the Mediterranean Sea and over the Strait of Gibraltar, according to flight tracking websites.\n\nThe flight briefly overflew Greece and Italy, according to FlightRadar24, but it entirely avoided French and Spanish airspace, lengthening the duration of the flight.\n\nIsrael has not publicly said why they took the unusual route and CNN has approached the prime minister’s office for comment.\n\nThe International Criminal Court issued an arrest warrant for Netanyahu last November for alleged war crimes and crimes against humanity. If Netanyahu were to overfly European countries that are members of the ICC, he could be forced to land and arrested.\n\nNeither Israel nor the United States are members of the ICC.\n\nA senior Hamas official has defended carrying out the deadlyOctober 7 attackson Israel, telling CNN that it created a “golden moment” for the Palestinian cause despite the tens of thousands of deaths in Gaza.\n\nTwo weeks after surviving an Israeliair-strike on a Hamas compoundin the Qatari capital, Ghazi Hamad highlighted growing international condemnation of Israel’s offensive in Gaza and the spate of countries that have recognized Palestinian statehood.\n\nHe was unapologetic about theconsequences for Palestinian civiliansin Gaza, who have borne the brunt of Israel’s unrelenting attacks on Gaza.\n\n“You know what is the benefit of October 7th now? …If you look to the (United Nations) General Assembly yesterday, when about 194 people opened their eyes and looked to the atrocity, to brutality of Israel and all of them, they condemned Israel. We waited for this moment for 77 years,” he said.\n\n“I think this is a golden moment for the world to change the history,” he said.\n\nChallenged by CNN on whether Hamas shares some culpability – on whether the attacks were worth the thousands who have died in Gaza, the senior Hamas official refused to accept even some responsibility and said:\n\n“I know the price (is) so high, but I’m asking again, what is the option?”\n\nHamas in Gaza has rejected Palestinian Authority (PA) President Mahmoud Abbas’s statement that the group would “not have a role to play” in the governance of a Palestinian state.\n\n“We consider the assertion by the head of the authority that the Hamas movement will have no role in governance as an infringement on the inherent right of our Palestinian people to self-determination and to choose who governs them, as well as an unacceptable submission to external dictates and projects,” Hamas said yesterday.\n\nThe militant group had agreed in the past tocede Gaza governanceto the PA as part of a US-backed proposal for a Gaza ceasefire and hostage deal. But yesterday’s statement says otherwise.\n\nAbbas was forced to address the UN chamber via video yesterday after the White Housedenied visas forPalestinian diplomats prior to the General Assembly.\n\nThe Palestinian politician condemned Israel’s offensive in Gaza, describing it as a “war of genocide,” as well as settler violence against Palestinians in the occupied West Bank.\n\n“Despite all what our people have suffered, we reject what Hamas carried out on the 7th of October, these actions that targeted Israeli civilians and took them hostages,” Abbas said. “These actions do not represent the Palestinian people, nor do they represent their just struggle for freedom and independence.”\n\nThe politician also said the PA is “ready to bear full responsibility for governance and security there. Hamas will not have a role to play in governance.”\n\nCNN’s Max Saltman contributed reporting\n\nPalestinian Envoy to the UN Riyad Mansour speaks with Christiane Amanpour about the wave of European countries recognizing Palestinian statehood, and the US blocking visas for Palestinian leadership for the United Nations General Assembly.",
  "url": "https://edition.cnn.com/world/live-news/israel-netanyahu-gaza-palestine-09-26-25-intl",
  "scraped_timestamp": "2025-09-26T16:20:37.006534",
  "content_length": 13308,
  "word_count": 2138,
  "source_domain": "edition.cnn.com"
}