{
  "title": "NewsNews",
  "content": "The S&P 500 closed down 2.7%, its steepest fall since April, after the US president hit out at China.\n\nBeijing's monopoly over rare earths is a key bargaining chip in its trade negotiations with the US.\n\nIndia's IndiGo airline said that it would restart direct flights between Kolkata and Guangzhou from 26 October.\n\nUK police seized crypto worth over £5bn from Zhimin Qian, who was known as 'the goddess of wealth'.\n\nNathan Law's presence \"would not be in national interests\", Singapore authorities say.\n\nBeijing's monopoly over rare earths is a key bargaining chip in its trade negotiations with the US.\n\nAt least one hiker has died and hundreds are still stranded near the mountain's eastern face.\n\nExperts say the deal seeks to counter Beijing's growing influence, but PNG says it is not about China.\n\nIndia's IndiGo airline said that it would restart direct flights between Kolkata and Guangzhou from 26 October.\n\nChina's aim to attract global talent comes as the US is making it harder to bring in foreign workers.\n\nDonald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nAgricultural brokers tell the BBC there has been a surge of interest from exporters in trade with China.\n\nPresident Xi shows off his power and influence in an open challenge to US supremacy and the world order.\n\nHigh-ranking officials from China and Russia are in Pyongyang to attend the anniversary celebrations.\n\nTwo games in Macau this weekend will be the first since the league was effectively frozen out in 2019.\n\nBeijing's monopoly over rare earths is a key bargaining chip in its trade negotiations with the US.\n\nProsecutors say they were unable to obtain evidence from the government to meet the threshold for prosecution.\n\nHundreds of hikers have been guided to safety in Tibet after becoming trapped over the weekend by heavy snowfall.\n\nBBC News is given access to what the Met Police says is the UK's largest operation against mobile phone thefts.\n\nThe Shenzhen-based electric car maker says the UK is now its biggest market outside China.\n\nDowning Street says the CPS decision to drop charges was made \"entirely independently of government\".\n\nAt least one hiker has died and hundreds are still stranded near the mountain's eastern face.",
  "url": "https://www.bbc.com/news/world/asia/china",
  "scraped_timestamp": "2025-10-11T23:47:28.390392",
  "content_length": 2414,
  "word_count": 403,
  "source_domain": "www.bbc.com"
}