{
  "title": "NewsNews",
  "content": "Sir Menzies led the Liberal Democrats from 2006 to 2007 and was the MP for North East Fife at Westminster for 28 years.\n\nThe former Liberal Democrat leader was one of the UK parliament's most distinctive and authoritative voices.\n\nA new report says 22 out of 24 colleges are expected to spend more than their income this year.\n\nThe tree defeated nine other contenders in a public vote to win the annual prize.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nThe former Liberal Democrat leader was one of the UK parliament's most distinctive and authoritative voices.\n\nDylan Hood was high on cocaine and had been driving at 134mph just before the three-car collision\n\nThe first minister also says he does not want to carry a \"Brit card\" but the UK government says that description is wrong.\n\nA new report says 22 out of 24 colleges are expected to spend more than their income this year.\n\nAllan Marshall died four days after being restrained by prison officers at HMP Edinburgh in March 2015.\n\nOfficers are investigating the former A Milne funeral directors in Glasgow and Dumbarton.\n\nThe needle off the pitch clearly never ends. The needle on it should be quite the sight to behold. Friday's meeting could be a wee bit tasty.\n\nInverness and Cromarty Firth Green Freeport has reached the final stage of a five-year planning process.\n\nRules around bringing animals to the UK from the EU have tightened since Brexit.\n\nAnd can Keir Starmer fight back?\n\nResidents scrutinise long-awaited plans to bypass two villages on the busy A75 in southern Scotland.\n\nHighland woman Eve Graham endured physical, mental and financial abuse during her long marriage.\n\nThe Shout singer discloses her alcohol problem - and the family history that contributed to it.\n\nA husband and wife have devote the last three years to helping the spiky mammals when they are found ill or injured.\n\nAllan Marshall died four days after being restrained by prison officers at HMP Edinburgh in March 2015.\n\nInverness and Cromarty Firth Green Freeport has reached the final stage of a five-year planning process.\n\nA new report says 22 out of 24 colleges are expected to spend more than their income this year.\n\nA council hears calls for stronger action over the self-styled Kingdom of Kubala near Jedburgh.\n\nSir Anton Muscatelli calls for a review of the future funding and shape of higher education.\n\nListen on BBC Radio 5 live and follow live text commentary on the opening foursomes in the Ryder Cup at Bethpage Black in New York.\n\nRussell Martin's unconvincing message wearing thin after another Rangers defeat, writes Amy Canavan.\n\nHow will Edinburgh and Glasgow fare in the new United Rugby Championship season?\n\nJosh Kerr confirms he sustained a \"grade two\" calf tear in the World Championship 1500m final.\n\nThe needle off the pitch clearly never ends. The needle on it should be quite the sight to behold. Friday's meeting could be a wee bit tasty.\n\nBig stories from across the country\n\nThe BBC's Scottish news podcast.\n\nMore from the day’s top stories and communities across Scotland.\n\nThe nation's morning news programme.\n\nSir Menzies led the Liberal Democrats from 2006 to 2007 and was the MP for North East Fife at Westminster for 28 years.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nThe former Liberal Democrat leader was one of the UK parliament's most distinctive and authoritative voices.\n\nA review of the front pages as digital ID card plan announced and court bids to retrieve PPE cash.\n\nSir Anton Muscatelli calls for a review of the future funding and shape of higher education.\n\nThe Scottish broadcaster is seeking £2.5m of savings by next year after announcing a £0.2m loss.\n\nThe closures include four in the Highlands - Nairn, Dingwall, Gairloch and Tain.\n\nCentral midfielder Brooke Paterson spent five hours lying on a cold, damp pitch in Cumbernauld waiting for an ambulance.\n\nThe American who faked his death and fled to Scotland to escape justice was convicted by a Utah jury.",
  "url": "https://www.bbc.com/news/scotland",
  "scraped_timestamp": "2025-09-26T17:44:28.593328",
  "content_length": 4063,
  "word_count": 682,
  "source_domain": "www.bbc.com"
}