{
  "title": "NewsNews",
  "content": "The 18 people unaccounted for after the blast at a Tennessee munitions factory are presume dead, say officials.\n\nVideo from the site of an explosives manufacturer shows buildings flattened and destroyed vehicles.\n\nChaotic scenes have become routine in a federal immigration court in Manhattan.\n\nMore than 4,000 workers across seven agencies will receive notices that their jobs are being cut, the government disclosed in a court filing.\n\nThe 82-year-old former US president - who was diagnosed with an aggressive prostate cancer in May - is also getting hormone treatment.\n\nVideo from the site of an explosives manufacturer shows buildings flattened and destroyed vehicles.\n\nTwelve others were injured in the incident, which happened at around midnight.\n\nThe S&P 500 closed down 2.7%, its steepest fall since April, after the US president hit out at China.\n\nChaotic scenes have become routine in a federal immigration court in Manhattan.\n\nThe deal would see universities cap foreign admissions, restrict protests and adopt a binary definition of gender.\n\nA spokesman says the Nobel Committee placed \"politics over peace\" in awarding the coveted award to Venezuela's opposition leader.\n\nThe US will establish a multinational force in Israel, likely to include troops from Egypt, Qatar, Turkey and the UAE, officials say.\n\nThe US First Lady has been directly engaged in diplomacy in Russia, pleading for the protection of children.\n\nThe facility in Idaho will be used to train Qatari pilots to fly F-15 fighter jets, the US defence secretary says.\n\nThe BBC's Anthony Zurcher breaks down how the US president's connections have brought about a breakthrough moment for the Middle East.\n\nPeople living in a Chicago apartment block targeted in a big immigration raid have described seeing armed agents and a helicopter landing on the roof.\n\nIn a fiery exchange, Democrat Hakeem Jeffries also said Republican Mike Lawler was 'embarrassing' himself during the confrontation over the government shutdown.\n\nBodycam footage shows the officer responding to a call from a man concerned about his wife's whereabouts after she went for a walk.\n\nThe US Attorney General was grilled on the Jeffrey Epstein files and the prosecution of President Donald Trump's \"enemies\".\n\nSome are worried that the rapid rise in the value of AI tech companies may be a bubble waiting to burst.\n\nAlexander Stubb has become a key voice for Europe at the White House amid the Ukraine war.\n\nMail deliveries have been disrupted in Canada as postal workers strike for the second time in two years.\n\nUS President Donald Trump ordered his officials to pursue his political foe, who denies any wrongdoing.\n\nPresident Trump has signed an executive order designating Antifa as a domestic terror group, but legal experts have questioned how this will work.\n\nMore than 4,000 workers across seven agencies will receive notices that their jobs are being cut, the government disclosed in a court filing.\n\nTwelve others were injured in the incident, which happened at around midnight.\n\nThe 82-year-old former US president - who was diagnosed with an aggressive prostate cancer in May - is also getting hormone treatment.\n\n\"There's nothing to describe, it's gone,\" says Humphreys County Sheriff Mike Davis.\n\nThe deal would see universities cap foreign admissions, restrict protests and adopt a binary definition of gender.\n\nChaotic scenes have become routine in a federal immigration court in Manhattan.\n\nFew people are suspected of committing mortgage fraud, and experts say it is very difficult to prove\n\nVideo from the site of an explosives manufacturer shows buildings flattened and destroyed vehicles.\n\nHer courtside presence made her a global celebrity, inspiring a wave of merchandise from bobbleheads to T-shirts bearing her image.",
  "url": "https://www.bbc.com/news/us-canada",
  "scraped_timestamp": "2025-10-11T23:46:43.288555",
  "content_length": 3787,
  "word_count": 597,
  "source_domain": "www.bbc.com"
}