{
  "title": "NewsNews",
  "content": "Speaking at the Ulster Unionist Party conference Mike Nesbitt said he wanted to \"deliver hope through prosperity\".\n\nPolice said they received a report of a collision on the Pomeroy Road shortly after 06:45 BST on Friday.\n\nThe vacant house in the Shankill area was set on fire and daubed with graffiti on Thursday night.\n\nIt will take place on 20 October and determine whether their joint trial can proceed as planned on 3 November at Newry Crown Court.\n\nIt is estimated £1.2bn is needed to implement the 35 actions initially set out in 2021.\n\nPolice said they received a report of a collision on the Pomeroy Road shortly after 06:45 BST on Friday.\n\nOne of Northern Ireland's rarest native mammals have been turning up in some unusual places.\n\nJim Gavin had been chosen to represent Fianna Fáil, the Republic of Ireland's biggest party in the coalition government\n\nThe vacant house in the Shankill area was set on fire and daubed with graffiti on Thursday night.\n\nBriege Begley's family were in a house in North Belfast for just three days before being forced to leave following a sectarian attack.\n\nNorthern Ireland is enjoying a UK-wide renaissance of independent record shops.\n\nDaniel O'Donnell and Taylor Swift have both released their new albums.\n\nThree Northern Irish athletes head to Norway to compete in the European wheelchair basketball championships.\n\nThe singer last played in Belfast more than three years ago, where she performed as part of girl group Little Mix.\n\nGail Cairns started experiencing sight loss, headaches, and eye pain, but did not go to an optician when she first had symptoms.\n\nAn Armagh folk performance group say they \"weren't sure it was real\" when the fashion house called.\n\nIrish fans are disappointed that Boyzone's farewell concert will not include a show in Dublin.\n\nThe assault and other offences took place in Altnagelvin hospital in Derry in March.\n\nThe man sustained a head wound that needed glued together after the attack at his home in Londonderry.\n\nFr Edward Gallagher, 58, from County Donegal, is charged with a number of child sex offences.\n\nA major volume of poetry by Seamus Heaney includes previously unseen works.\n\nA round-up of local news, sport and weather across the north west of Northern Ireland.\n\nEmma Costello McCrory, a mother-of-two, died after her home in Clontarf was set on fire by George Turner in 2022.\n\nThe Dublin-formed group said they will record a fifth and final album before parting ways.\n\nMicheál Martin apologises to his party after its presidential candidate, Jim Gavin, withdrew from the race.\n\nA man in his 40s is charged after a major search operation in five counties in the Republic of Ireland.\n\nThe campaign team of Irish presidential candidate Heather Humphreys has mistaken the Reichstag in Germany for Belfast City Hall.\n\nWake up to Good Morning Ulster and get all the news and analysis from home and abroad.\n\nBreaking news and hard-hitting talk about the big stories of the day.\n\nHighlights from Talkback. William Crawley and guests discuss the news headlines.\n\nAll the day’s news and analysis with Richard Morgan.\n\nThe latest news for Northern Ireland.\n\nTara Mills and Declan Harvey react and reflect on news stories in a BBC NI podcast.\n\nThe back-stop’s here? Bad puns with top political coverage from BBC Northern Ireland.\n\nHard-hitting investigations on the stories that matter in Northern Ireland.\n\nMark Carruthers provides comment and expert analysis on the week's political news\n\nMark Carruthers with the latest political news, interviews and debate.\n\nPolice said they received a report of a collision on the Pomeroy Road shortly after 06:45 BST on Friday.\n\nOne of Northern Ireland's rarest native mammals have been turning up in some unusual places.\n\nA 21-year-old man has died and a woman has been taken to hospital after the crash on the Pomeroy Road.\n\nIt is estimated £1.2bn is needed to implement the 35 actions initially set out in 2021.\n\nThe non-jury trial is taking place at Belfast Crown Court with the former soldier accused of two murders and five attempted murders.\n\nThe man sustained a head wound that needed glued together after the attack at his home in Londonderry.\n\nThe assault and other offences took place in Altnagelvin hospital in Derry in March.\n\nCordons remain in place after a section of the former convent on Pump Street in Derry collapsed at the weekend.\n\nIt will take place on 20 October and determine whether their joint trial can proceed as planned on 3 November at Newry Crown Court.",
  "url": "https://www.bbc.com/news/northern_ireland",
  "scraped_timestamp": "2025-10-11T23:46:49.771432",
  "content_length": 4505,
  "word_count": 749,
  "source_domain": "www.bbc.com"
}