{
  "title": "NewsNews",
  "content": "Masanori Aoki stabbed two women in Nakano city before shooting two policemen with a hunting rifle.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nCanada's foreign minister visits Delhi as the sides restore ties strained by a murder on Canadian soil.\n\nThe move, which is aimed to protect supplies of technology, could raise tensions between the EU and China.\n\nBeijing says it could introduce \"countermeasures\" if the US President imposes an an additional 100% tariff on Chinese imports.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nZion Church, founded by pastor Jin Mingri in 2007, is one of China's largest underground church networks.\n\nCanada's foreign minister visits Delhi as the sides restore ties strained by a murder on Canadian soil.\n\nThe mother and calf were spotted in late September, with the young dolphin’s swimming ability noticeably impeded by a fishing line caught around its tail.\n\nThe attacks came days after Pakistan was accused of bombing a market inside Afghanistan.\n\nThe co-directors of Netflix's most watched film ever say \"there's more we can do with these characters\"\n\nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.\n\nNamed the Hwasong-20, its size suggests that it could carry multiple nuclear warheads.\n\nSmaller Indian towns are becoming centres for training and correcting artificial intelligence models.\n\nUnpredictable, intense and longer monsoons are encroaching into autumn, turning it into a deadly season.\n\nThe maker of Japan's most popular beer, Super Dry, was hit by a major cyber-attack last month.\n\nAmir Khan Muttaqi flies into Delhi from Russia, on a once unimaginable visit being closely watched by Pakistan.\n\nThe South Asian art market has raked in millions in recent months, even as global art sales slump.\n\nMasanori Aoki stabbed two women in Nakano city before shooting two policemen with a hunting rifle.\n\nThousands had earlier in August protested against an increase in housing allowances for MPs.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nZion Church, founded by pastor Jin Mingri in 2007, is one of China's largest underground church networks.\n\nParamjit Singh, an Indian passport holder, has lived in the US on a green card since 1994.\n\nThe attacks came days after Pakistan was accused of bombing a market inside Afghanistan.\n\nUnpredictable, intense and longer monsoons are encroaching into autumn, turning it into a deadly season.\n\nFemale reporters were excluded from an event at the Taliban government's embassy in New Delhi.",
  "url": "https://www.bbc.com/news/world/asia",
  "scraped_timestamp": "2025-10-14T14:32:00.632616",
  "content_length": 2935,
  "word_count": 461,
  "source_domain": "www.bbc.com"
}