{
  "title": "NewsNews",
  "content": "Andry Rajoelina is said to have fled the country by French military jet but his whereabouts are unknown.\n\nThe attack raises questions about security at one of Kenya's most heavily guarded places.\n\nThe boy’s father has been arrested on charges of negligent handling of a firearm and the two are due in court.\n\nLecturers at public universities in Nigeria begin a two-week strike over pay and funding.\n\nPaul Biya, who at 92 is the world's oldest head of state, is being challenged by nine candidates.\n\nThe attack raises questions about security at one of Kenya's most heavily guarded places.\n\nThe dead were nationals of Zimbabwe and Malawi returning home, officials say.\n\nThe boy’s father has been arrested on charges of negligent handling of a firearm and the two are due in court.\n\nBusiness for unregulated healers appears to be thriving in Cape Town, but there are dangers.\n\nSome question whether the 19th Century Afrikaner leader should still be memorialised.\n\nCameroon's Paul Biya promises young voters \"the best is yet to come\" as others hunger for \"young blood\".\n\nCounting the cost of deadly Gen Z protests in Madagascar where most young people are unemployed.\n\nA selection of the week's best photos from across the African continent and beyond.\n\nMore than 300 petrol tankers make it to Bamako under military escort a week after pumps run dry.\n\nNigerian Modernism at the Tate spotlights a compelling period in the West African country's history.\n\nPhotos capture the joy and unity present at this year's Irreecha festival.\n\nFollow live text commentary, score updates and match stats from Somalia vs Algeria in the CAF World Cup Qualifiers\n\nTogo international Samuel Asamoah broke his neck in a freak collision with an advertising board which his club says could leave him paralysed.\n\nA Gen Z leader in Madagascar says he has put his UK university scholarship on hold to help organise the protests.\n\nBotswana's diamond-reliant economy is under strain - the main diamond company saw a 50% drop in sales last year.\n\nYoung protesters in Morocco are protesting against corruption and for better health and education.\n\nSomalia's President Hassan Sheikh Mohamud says he is a prime target of the Islamist group al-Shabab.\n\nThe battle for Kordofan, with a population of eight million, is the latest frontline in Sudan's civil war.\n\nThree essential stories to round off your working day. Explaining the news from Africa.\n\nAndry Rajoelina is said to have fled the country by French military jet but his whereabouts are unknown.\n\nThe attack raises questions about security at one of Kenya's most heavily guarded places.\n\nLecturers at public universities in Nigeria begin a two-week strike over pay and funding.\n\nPaul Biya, who at 92 is the world's oldest head of state, is being challenged by nine candidates.\n\nThe dead were nationals of Zimbabwe and Malawi returning home, officials say.\n\nAn army unit claimed it had taken over leadership of the military command and was now in control of all the armed forces.\n\nThe boy’s father has been arrested on charges of negligent handling of a firearm and the two are due in court.\n\nBusiness for unregulated healers appears to be thriving in Cape Town, but there are dangers.\n\nPatrick Herminie has defeated Wavel Ramkalawan in a runoff, gaining 52.7% of the vote, official results show.",
  "url": "https://www.bbc.com/news/world/africa",
  "scraped_timestamp": "2025-10-14T15:20:44.988130",
  "content_length": 3319,
  "word_count": 548,
  "source_domain": "www.bbc.com"
}