{
  "title": "NewsNews",
  "content": "Zion Church, founded by pastor Jin Mingri in 2007, is one of China's largest underground church networks.\n\nThe move, which is aimed to protect supplies of technology, could raise tensions between the EU and China.\n\nBeijing's monopoly over rare earths is a key bargaining chip in its trade negotiations with the US.\n\nAt least one hiker has died and hundreds are still stranded near the mountain's eastern face.\n\nExperts say the deal seeks to counter Beijing's growing influence, but PNG says it is not about China.\n\nThe move, which is aimed to protect supplies of technology, could raise tensions between the EU and China.\n\nBeijing says it could introduce \"countermeasures\" if the US President imposes an an additional 100% tariff on Chinese imports.\n\nThe S&P 500 closed down 2.7%, its steepest fall since April, after the US president hit out at China.\n\nBeijing's monopoly over rare earths is a key bargaining chip in its trade negotiations with the US.\n\nChina's aim to attract global talent comes as the US is making it harder to bring in foreign workers.\n\nDonald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nAgricultural brokers tell the BBC there has been a surge of interest from exporters in trade with China.\n\nPresident Xi shows off his power and influence in an open challenge to US supremacy and the world order.\n\nBoth the Tories and Liberal Democrats are calling on the government to publish evidence it submitted in the now-collapsed case.\n\nThe Tories have asked the CPS if it would be able to restart prosecutions of two men accused of spying.\n\nTrump's volatile trade policy has thrown the world economy into chaos, and put some US prices up.\n\nThere are concerns the new levies, meant to protect US manufacturers, could raise housing costs.\n\nThe government is facing questions about why the case collapsed just weeks before a trial was due to go ahead.\n\nNew US tariffs on imported timber, kitchen cabinets and upholstered furniture also came into effect on Tuesday.\n\nThe move, which is aimed to protect supplies of technology, could raise tensions between the EU and China.\n\nIn a letter to Starmer, the Tory leader claimed his government's account of the collapsed case had \"changed repeatedly\".\n\nBeijing says it could introduce \"countermeasures\" if the US President imposes an an additional 100% tariff on Chinese imports.",
  "url": "https://www.bbc.com/news/world/asia/china",
  "scraped_timestamp": "2025-10-15T10:47:25.628871",
  "content_length": 2526,
  "word_count": 424,
  "source_domain": "www.bbc.com"
}