{
  "title": "NewsNews",
  "content": "Cameroon's Paul Biya promises young voters \"the best is yet to come\" as others hunger for \"young blood\".\n\nEl-Fasher has been surrounded by the RSF for 17 months, as residents face hunger and starvation.\n\nThe West African nation's foreign minister asks if the decision led to the US suspending issuing visas.\n\nCounting the cost of deadly Gen Z protests in Madagascar where most young people are unemployed.\n\nDesire Moyo died a day before his 46th birthday - the four other MPs in the car have been taken to hospital.\n\nEl-Fasher has been surrounded by the RSF for 17 months, as residents face hunger and starvation.\n\nEsther Njoki says her family has been denied justice for 13 years after her aunt Agnes Wanjiru's body was found in a septic tank.\n\nThe West African nation's foreign minister asks if the decision led to the US suspending issuing visas.\n\nA selection of the week's best photos from across the African continent and beyond.\n\nMore than 300 petrol tankers make it to Bamako under military escort a week after pumps run dry.\n\nNigerian Modernism at the Tate spotlights a compelling period in the West African country's history.\n\nPhotos capture the joy and unity present at this year's Irreecha festival.\n\nThe BBC challenges the scammers targeting teenagers like Evan Boettler, who took his own life just 90 minutes after being contacted.\n\nMorocco will soon have the world's largest football stadium but this has angered many young people who want better services.\n\nThe group, Gafcon, says that its followers believe \"the Bible requires a male-only episcopacy\".\n\nPresident Rajoelina's move fails to quell the protest movement that is now threatening his own position.\n\nFollow live text commentary, score updates and match stats from Somalia vs Algeria in the CAF World Cup Qualifiers\n\nTogo international Samuel Asamoah broke his neck in a freak collision with an advertising board which his club says could leave him paralysed.\n\nNadine de Klerk hits a blistering unbeaten 84 from 54 balls as South Africa produce a stunning comeback to beat India at the Women's World Cup.\n\nFollow live text commentary, score updates and match stats from Djibouti vs Egypt in the CAF World Cup Qualifiers\n\nA Gen Z leader in Madagascar says he has put his UK university scholarship on hold to help organise the protests.\n\nBotswana's diamond-reliant economy is under strain - the main diamond company saw a 50% drop in sales last year.\n\nYoung protesters in Morocco are protesting against corruption and for better health and education.\n\nSomalia's President Hassan Sheikh Mohamud says he is a prime target of the Islamist group al-Shabab.\n\nThe battle for Kordofan, with a population of eight million, is the latest frontline in Sudan's civil war.\n\nThree essential stories to round off your working day. Explaining the news from Africa.\n\nEl-Fasher has been surrounded by the RSF for 17 months, as residents face hunger and starvation.\n\nDozens of Chagossians have flown in to Heathrow Airport this week, putting pressure on housing services.\n\nEsther Njoki says her family has been denied justice for 13 years after her aunt Agnes Wanjiru's body was found in a septic tank.\n\nCameroon's Paul Biya promises young voters \"the best is yet to come\" as others hunger for \"young blood\".\n\nCounting the cost of deadly Gen Z protests in Madagascar where most young people are unemployed.\n\nA Gen Z leader in Madagascar says he has put his UK university scholarship on hold to help organise the protests.\n\nAsashi and Precious use dance as a form of escapism and expression in a show of resilience, community, and hope.\n\nDesire Moyo died a day before his 46th birthday - the four other MPs in the car have been taken to hospital.\n\nThe Nigeria's electoral agency is under increased scrutiny, with growing calls for greater transparency.",
  "url": "https://www.bbc.com/news/world/africa",
  "scraped_timestamp": "2025-10-11T23:47:25.775718",
  "content_length": 3805,
  "word_count": 632,
  "source_domain": "www.bbc.com"
}