{
  "title": "NewsNews",
  "content": "Crowds chant \"thank you Trump\" at a rally in Hostages Square in Tel Aviv, as Hamas recalls 7,000 fighters to reassert control over Gaza.\n\nClashes have already taken place between the group and an armed clan in Gaza City.\n\nIt is unclear if disagreement over the list of Palestinian prisoners will affect the release of hostages within the agreed 72 hours.\n\nA ceasefire deal should see Hamas hand over all 48 remaining Israeli and foreign hostages, 20 of whom are believed to be alive.\n\nThe text of the agreement lacks details and in some cases is vague and ambiguous - perhaps on purpose.\n\nClashes have already taken place between the group and an armed clan in Gaza City.\n\nThousands of displaced Palestinians are making their way to their homes in the north of the territory.\n\nThose returning say they are driven by desperation rather than confidence that it is safe.\n\nIt is unclear if disagreement over the list of Palestinian prisoners will affect the release of hostages within the agreed 72 hours.\n\nIsraeli troops have pulled back from parts of Gaza after Israel approved Donald Trump's ceasefire and hostage release plan.\n\nFor the first time since the Hamas attacks on Israel two years ago, there is a realistic chance of ending the horrors\n\nTrump's unique style and his relationships with key players helped but there were also factors beyond his control.\n\nThe BBC's Lyse Doucet reflects on how long-awaited negotiations to move forward, not further back, appear to be succeeding.\n\nThe agreement of the first-phase of the peace plan for Gaza, announced by US President Donald Trump, is a big moment.\n\nThe Skeik building, in a quiet road in western Gaza City, has seen many families pass through it since the war began.\n\nPeople in Gaza celebrate a potential end to the war, but know it will mean facing the grief they have put aside.\n\n\"I can't quite believe this is actually happening, we've been waiting for so long,\" said Gil Dickman, cousin of hostage Carmel Gat.\n\nTwo years on from Hamas' attack on 7 October, Herut Nimrodi says she is clinging to hope that her son Tamir is \"still hanging on\".\n\nDr Mohammed Abu Mughaisib, who worked in hospitals in Gaza for two years, says Israeli strikes have made conditions \"indescribable\" for colleagues still there.\n\nClashes have already taken place between the group and an armed clan in Gaza City.\n\nIt is unclear if disagreement over the list of Palestinian prisoners will affect the release of hostages within the agreed 72 hours.\n\nIsraeli troops have pulled back from parts of Gaza after Israel approved Donald Trump's ceasefire and hostage release plan.\n\nThousands of displaced Palestinians are making their way to their homes in the north of the territory.\n\nThe text of the agreement lacks details and in some cases is vague and ambiguous - perhaps on purpose.\n\nPeople gather to reflect on shared values and focus \"on the very many things we share in common\".\n\nThe foreign secretary says the UK will continue to support the peace process through diplomacy.\n\nThose returning say they are driven by desperation rather than confidence that it is safe.\n\nA ceasefire deal should see Hamas hand over all 48 remaining Israeli and foreign hostages, 20 of whom are believed to be alive.",
  "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
  "scraped_timestamp": "2025-10-11T23:54:34.465695",
  "content_length": 3232,
  "word_count": 549,
  "source_domain": "www.bbc.com"
}