{
  "title": "NewsNews",
  "content": "Felipe Cáceres is the latest counternarcotics official to be detained over an alleged drugs offence.\n\nGustavo Petro told the BBC that \"there is no need to kill anyone\" in efforts to crackdown on maritime drug smuggling.\n\nUS Treasury Secretary Scott Bessent offers a pledge of support for Donald Trump ally Javier Milei.\n\nPolice said gang members killed a prison guard before turning on members of a rival gang.\n\nTens of thousands take to the streets of major cities to oppose a bill which could spare the ex-leader jail.\n\nGustavo Petro told the BBC that \"there is no need to kill anyone\" in efforts to crackdown on maritime drug smuggling.\n\nNaasón Joaquín García is already serving a sentence for sexually abusing girls from his congregation.\n\nThe move comes weeks after the former leader was sentenced to 27 years in jail over an attempted coup plot.\n\nUS Treasury Secretary Scott Bessent offers a pledge of support for Donald Trump ally Javier Milei.\n\nJamaican great Shelly-Ann Fraser-Pryce wins world 4x100m relay silver in the final race of her career in Tokyo.\n\nIn an exclusive interview, Brazil's president says Trump is \"not emperor of the world\".\n\nEx-English Schools champion Julia Paternain finishes third in the women's marathon to claim Uruguay's first medal in World Championships history.\n\nCCTV footage from 2021, released exclusively to the BBC, contains the last-recorded sighting of Sarm Heslop.\n\nThe Brazilian ex-president has been sentenced to 27 years for plotting a coup, but an amnesty could be on the cards.\n\nBrazil's Civil Defense and firefighting teams worked to extinguish the flames in São Paulo, and no injuries were reported.\n\nPresident Claudia Sheinbaum and Prime Minister Mark Carney's meeting is meant to kickstart a new economic bilateral relationship.\n\nInitial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.\n\nThe former president of Brazil has been sentenced to 27 years in prison after being found guilty for plotting a military coup.\n\nThe airline confirmed that all 164 passengers and crew aboard flight 2276 were safely evacuated.\n\nFelipe Cáceres is the latest counternarcotics official to be detained over an alleged drugs offence.\n\nThe move comes weeks after the former leader was sentenced to 27 years in jail over an attempted coup plot.\n\nPolice said gang members killed a prison guard before turning on members of a rival gang.\n\nTens of thousands take to the streets of major cities to oppose a bill which could spare the ex-leader jail.\n\n‘Firenado’ forms as flames tear through sugarcane plantation in São Paulo\n\nIn an exclusive interview, Brazil's president says Trump is \"not emperor of the world\".\n\nInitial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.\n\nPascoal - famed for his blend of jazz and traditional music - wrote more than 2,000 instrumental pieces.\n\nThe nation's highest court says the tech firm removed Esperanza Gómez's account without clear justification.",
  "url": "https://www.bbc.com/news/world/latin_america",
  "scraped_timestamp": "2025-09-26T00:14:53.543538",
  "content_length": 3033,
  "word_count": 484,
  "source_domain": "www.bbc.com"
}