{
  "title": "NewsNews",
  "content": "Both the Tories and Liberal Democrats are calling on the government to publish evidence it submitted in the now-collapsed case.\n\nThe tougher rules will come in force in January as part of wider plans to cut immigration.\n\nThe jury in the trial of Deng Majek is shown CCTV and told he carried out a \"vicious and frenzied attack\".\n\nThe far-right activist was charged under the Terrorism Act over an incident at the Channel Tunnel in July 2024.\n\nThe undercover policing inquiry heard the Met began surveillance of the Lawrences after their son's murder.\n\nThe tougher rules will come in force in January as part of wider plans to cut immigration.\n\nBut the UK is also predicted to suffer the highest rate of inflation in the G7 both this year and next.\n\nThe former education secretary tells the Covid inquiry there was a \"lack of seriousness\" in government.\n\nThe jury in the trial of Deng Majek is shown CCTV and told he carried out a \"vicious and frenzied attack\".\n\nThe Reform UK leader has described the threats made in a TikTok video as \"pretty chilling\".\n\nYoni Findlay, hit by a police bullet as officers responded to the attack, is released from hospital.\n\nTony Caunter, who played Roy Evans in the BBC soap, died in Eastbourne on Monday, his family says.\n\nDavid Coote was charged on 12 August following an investigation by Nottinghamshire Police.\n\nPrepare to switch to offline systems in the event of a cyber-attack, firms are being advised.\n\nOn Monday, shadow chancellor Mel Stride gave his speech to a partially empty hall in Manchester.\n\nThe late author appeared in the TV adaptation of her 1988 novel last year.\n\nTwo people died and three people were injured in the attack at a synagogue on Thursday.\n\nGreen Party leader Zack Polanski has delivered his first conference speech as leader and criticised the rise of Nigel Farage's Reform party.\n\nSeveral of the papers on Wednesday lead on a report from the International Monetary Fund.\n\nNew research suggests singing can be clinically effective at treating the symptoms and cost effective for the NHS.\n\nThey roamed the Earth 166 million years ago. Now a window into their prehistoric past is being revealed in an Oxfordshire quarry.\n\nCameron McGerr lost both his parents and is campaigning to have life-saving first aid taught in schools.\n\nTwo participants from Rose Ayling-Ellis: Old Hands, New Tricks share how BSL has transformed their lives.\n\nJulia Wandelt and Karen Spragg deny stalking Kate and Gerry McCann over several years.\n\nBrian Allison says an unexplained mix-up with his mother's ashes tormented his late sister as she battled cancer.\n\nA BBC investigation finds reports of sexual offences on trains rise by more than a third.\n\nAndrew Lynas' comments come as a House of Lords committee finds the Windsor Framework is \"impossible to navigate\".\n\nThe tougher rules will come in force in January as part of wider plans to cut immigration.\n\nThe far-right activist was charged under the Terrorism Act over an incident at the Channel Tunnel in July 2024.\n\nThe inquiry into the government's handling of the pandemic has heard from politicians, civil servants, experts and bereaved families.\n\nServices using the line between Bristol, Bath and London will be affected.\n\nThe far-right activist was charged under the Terrorism Act over an incident at the Channel Tunnel in July 2024.\n\nGill and Pete Brisley lost their daughter and two granddaughters in the 7 October attacks by Hamas.\n\nDrew Jonkmans reaches the halfway point of a running and cycling challenge to raise support for mental health.\n\nGermany's President Steinmeier will visit King Charles on a state visit to the UK in December.\n\nThe disgraced Lostprophets frontman was fatally injured at HMP Wakefield on Saturday.",
  "url": "https://www.bbc.com/news/uk",
  "scraped_timestamp": "2025-10-15T09:51:44.300907",
  "content_length": 3732,
  "word_count": 619,
  "source_domain": "www.bbc.com"
}