{
  "title": "NewsNews",
  "content": "Nicolas Sarkozy, president from 2007-12, was found guilty of criminal conspiracy but cleared of other charges.\n\nSarkozy is back where he used to be – dominating the news and dividing the nation, writes the BBC's Hugh Schofield.\n\nThe engineering giant says increased competition and costs mean it must scale back.\n\nVladimir Plahotniuc, an oligarch and former senior Moldovan politician, denies any wrongdoing.\n\nFrench authorities say the \"remarkable seizure\" was found on board a fishing boat following a tip-off.\n\nSarkozy is back where he used to be – dominating the news and dividing the nation, writes the BBC's Hugh Schofield.\n\nIn an era of hybrid warfare, there is a sense of embarrassment that Denmark's critical infrastructure has become vulnerable.\n\nBut the defence minister says there is no evidence of Russian involvement after the latest incident.\n\nThe engineering giant says increased competition and costs mean it must scale back.\n\nThe Ukrainian president addresses the UN General Assembly after Donald Trump says for the first time that Kyiv could retake its lost borders.\n\nRed warnings issued for damaging winds, flooding rain and huge waves as Hurricane Gabrielle approaches the Azores.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nThe US president says Ukraine can win back land with support from Nato and Europe, marking a major shift in his position.\n\nItaly's defence minister directs a navy vessel to assist the flotilla's boats after what he says was a drone attack by unidentified perpetrators off Crete.\n\nRussian citizen Liudmila Zavada, 31, was found dead in July 2005 by a road in the northeastern Spain.\n\nOne woman was given an ovation for saying the apology was crucial for the victims to move on.\n\nThe BBC's Steve Rosenberg says far from being riled by Trump's comments, Russia's response has so far been restrained.\n\nThe EU's much-delayed Entry/Exit System will change the way UK passengers travel to 29 countries.\n\nNotre-Dame's Medieval towers have been restored after a massive fire ravaged the cathedral in 2019.\n\nThe BBC's Russia editor, Steve Rosenberg, reports from joint manoeuvres by Russia and Belarus, as part of the Zapad 2025 (West 2025) military drills.\n\nDrones like this one were shot down over Polish airspace in the early hours of Wednesday.\n\nThe BBC's Sarah Rainsford says Sunday's attack caused \"a huge amount of damage\".\n\nPope Leo canonises the London-born Italian boy nicknamed \"God's influencer\" for his online skills.\n\nEmergency services were alerted at around 20:00 local time on Thursday by a member of the public.\n\nThe pair were allegedly recruited by pro-Russian hackers and used a \"wi-fi sniffer\" on the Europol headquarters.\n\nIn an era of hybrid warfare, there is a sense of embarrassment that Denmark's critical infrastructure has become vulnerable.\n\nDublin City councillors voted to award the honour to the former US president and his wife Michelle in 2017.\n\nSarkozy is back where he used to be – dominating the news and dividing the nation, writes the BBC's Hugh Schofield.\n\nVladimir Plahotniuc, an oligarch and former senior Moldovan politician, denies any wrongdoing.\n\nNicolas Sarkozy, president from 2007-12, was found guilty of criminal conspiracy but cleared of other charges.\n\nBut the defence minister says there is no evidence of Russian involvement after the latest incident.\n\nRussian citizen Liudmila Zavada, 31, was found dead in July 2005 by a road in the northeastern Spain.",
  "url": "https://www.bbc.com/news/world/europe",
  "scraped_timestamp": "2025-09-26T16:18:25.785614",
  "content_length": 3501,
  "word_count": 559,
  "source_domain": "www.bbc.com"
}