{
  "title": "NewsNews",
  "content": "Photographer Gildas Griffiths captures the wildlife in his local area as he goes for a walk.\n\nPolice say a car was driven at members of the public during an incident in the Crumpsall area.\n\nAbbey Road studios' nominees for its Music Photography Awards had 20,000 submissions from 30 countries.\n\nDuring a total lunar eclipse the Moon passes through the Earth's shadow, taking on a deep red hue.\n\nThe Northern Lights have been creating spectaculars display across Scotland and the UK this week.\n\nPolice say a car was driven at members of the public during an incident in the Crumpsall area.\n\nDay two of US President Donald Trump's second state visit\n\nPresident Trump greeted by the King and Queen and other senior royals at Windsor Castle.\n\nAbbey Road studios' nominees for its Music Photography Awards had 20,000 submissions from 30 countries.\n\nA gallery tracks down the portrait subjects of Chris Killip's Askam-in-Furness series.\n\nBehind the scenes photos taken by Paul Mccartney during the rise of Beatlemania are going on show.\n\nJoann Randles' photography will be at display at the world's largest Celtic gathering.\n\nHe was known for dramatic and unflinching black-and-white images of hardship, conflict and natural beauty.\n\nAndrew Fusek Peters has spent a decade capturing the images in a celebration of Britain's wildife.\n\nImages from our readers on the theme of \"my best photo\".\n\nImages on the theme of \"monochrome\" sent in by our readers.\n\nEach week, we ask you to send in your pictures on a set theme and a selection of these are then published each Thursday on our In pictures page\n\nImages on the theme of \"glass\" sent in by our readers.\n\nImages from our readers on the theme of \"winter walks\".\n\nFrom Paris to Taipei, this week's supermoon - also known as the Harvest and Hunter's moon - captured in photos.\n\nThe Lens on the Line exhibit features 17 images of the railway from across the country.\n\nSony Photography Awards winner explores the tension between artificial spaces and environmental destruction.\n\nImages from our readers on the theme of \"my best photo\".\n\nImages on the theme of \"monochrome\" sent in by our readers.\n\nA selection of news photographs from around the world.\n\nImages on the theme of \"glass\" sent in by our readers.\n\nA selection of news photographs from around the world.\n\nThe winners of the Nature inFocus Photography Awards 2024 have been announced.",
  "url": "https://www.bbc.com/news/in_pictures",
  "scraped_timestamp": "2025-10-15T10:46:58.436432",
  "content_length": 2382,
  "word_count": 397,
  "source_domain": "www.bbc.com"
}