{
  "title": "NewsNews",
  "content": "Pessimistic social media posts may now be targets of a fresh crackdown by the Chinese government.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nOfficials are investigating the firm after the display drew backlash for its potential environmental impact.\n\nA court orders their parents to compensate Haidilao for reputational and operational losses.\n\nThe deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nRagasa is the strongest storm anywhere on Earth so far this year.\n\nOfficials are investigating the firm after the display drew backlash for its potential environmental impact.\n\nAgricultural brokers tell the BBC there has been a surge of interest from exporters in trade with China.\n\nPresident Xi shows off his power and influence in an open challenge to US supremacy and the world order.\n\nThe display of might comes as Beijing positions itself as a global counterweight to the United States.\n\nBeijing's shipbuilding capacity is 200 times that of the US, an expert says, calling the scale \"extraordinary\".\n\nBeijing has unveiled a range of military hardware in a show of might to Western powers.\n\nDonald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.\n\nTrump's volatile trade policy has thrown the world economy into chaos, and put some US prices up.\n\nA court said the espionage was carried out \"over a long period\"  and involved \"important intelligence\".\n\nPessimistic social media posts may now be targets of a fresh crackdown by the Chinese government.\n\nA scene featuring a same-sex couple was digitally altered to depict a heterosexual couple.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nIt is China's first firm goal to reduce emissions but falls well short of what is needed to meet global targets.\n\nThe \"king of storms\" has forced the evacuation of nearly two million people from the southern Chinese province of Guangdong.\n\nRagasa is the world's strongest storm this year and has been roaring over the South China Sea for days.",
  "url": "https://www.bbc.com/news/world/asia/china",
  "scraped_timestamp": "2025-09-26T15:51:33.058965",
  "content_length": 2440,
  "word_count": 407,
  "source_domain": "www.bbc.com"
}