{
  "title": "NewsNews",
  "content": "Nadia Yahlom says she had the \"right to take a stance about genocide\" by removing ribbons.\n\nDavid Setters, 68, was diagnosed with MND a decade ago and relies on a ventilator at night.\n\nLindsay Foreman, from East Sussex, has been transferred to the notorious Evin Prison, her son says.\n\nA UK firm says other sellers are lifting its photos of steel ornaments to sell similar products.\n\nBen Hatcher is pulled on to the stage by his childhood idol during her concert in Sheffield.\n\nDavid Setters, 68, was diagnosed with MND a decade ago and relies on a ventilator at night.\n\nDominic Robinson says he discovered crockery on the wreck below the surface of the Celtic Sea.\n\nA woman from Cornwall says people should be aware after a dental check-up led to her diagnosis.\n\nLindsay Foreman, from East Sussex, has been transferred to the notorious Evin Prison, her son says.\n\nZoe found her ex-partner Kester had spent £250,000 on his secret gambling addiction.\n\nFormer British Olympic athletics coach Jose Vicente Leiva-Modahl will appear in court on Tuesday accused of child sex offences.\n\nIbrahima Seck had been \"dancing in the kitchen\" before he went out and was stabbed, his mother says.\n\nSome parents say help is not available quickly enough to deal with violence from their children.\n\nWoman praises \"absolute heroes\" at Guernsey Waste for hunting for her missing rings.\n\nPaul Richards aims to raise the profile of independent record stores along the south coast.\n\nAmy Sharp's Alaskan Malamute Mal is more than twice the average size of a dog of his breed.\n\nDominika is now living at an animal rescue after a third disappearing act in the space of a year.\n\nTests show a road surface enhanced with graphene is outperforming regular asphalt.\n\nMore needs to be done to support those with hyperemesis gravidarum (HG), says  a Lincolnshire mum.\n\nIsle of Wight Distillery which produces Mermaid Gin says new waste scheme will cost thousands\n\nExperts say families are building up \"more and more debt and really getting into trouble\".\n\nGlobal environmental activism by metal bands can be traced back to Black Sabbath, an academic says.\n\nThree women from the South are hoping to highlight important causes as part of the competition.\n\nPolice footage shows the suspects get caught by a stinger, pile out of the car and run off.\n\nDiversity, known for winning Britain's Got Talent in 2009, open a studio in the Jewellery Quarter.\n\nQuaker has a new life after retiring from the Household Cavalry.\n\nDave Harvey checks out why a supposedly Bristol-based site is actually Chinese.\n\nPolice footage shows the suspects get caught by a stinger, pile out of the car and run off.\n\nDave Harvey checks out why a supposedly Bristol-based site is actually Chinese.\n\nAll the latest build-up to England's match in Latvia as Thomas Tuchel's side look to confirm place at next year's World Cup, plus Phil McNulty takes your questions.\n\nBeau Greaves emerges victorious from a 6-5 thriller against Luke Littler as she becomes the first woman to reach the final of the World Youth Championship.\n\nBBC Sport F1 correspondent Andrew Benson answers your latest questions before the United States Grand Prix.\n\nMarcus Rashford? Ollie Watkins? Ivan Toney? Who's the best England striker after Harry Kane?\n\nA look at what stories are trending across the West of England.\n\nIt uses infrared sensors and cameras to monitor patients alone in their rooms, sending alerts to staff when it detects signs of distress.\n\nLindsay Foreman, from East Sussex, has been transferred to the notorious Evin Prison, her son says.\n\nThe popular swimming spot is closed for six months while urgent repairs take place.\n\nA diversion via the A259 has been put in place, National Highways says.\n\nPaul Bryan Vogler was a registered nurse at HMP Huntercombe, near Henley-on-Thames.\n\nManager Mike Elsby says Nantwich is home to \"one of the last really traditional\" markets.\n\nThe plans detail replacement of Leighton Hospital with the UK's \"most digitally-advanced\" facility.\n\nRelease planning for Richard Cosgrove \"was undoubtedly rushed\", the prisons ombudsman has said.",
  "url": "https://www.bbc.com/news/england",
  "scraped_timestamp": "2025-10-14T15:12:31.321048",
  "content_length": 4095,
  "word_count": 672,
  "source_domain": "www.bbc.com"
}