{
  "title": "NewsNews",
  "content": "They roamed the Earth 166 million years ago. Now a window into their prehistoric past is being revealed in an Oxfordshire quarry.\n\nPrepare to switch to offline systems in the event of a cyber-attack, firms are being advised.\n\nThe deal was agreed last month but received a mixed reaction from political parties, victims’ groups and veterans.\n\nAnnual growth in employees' average earnings was 4.7% in the three months to August.\n\nVodafone said its Monday outage, which knocked broadband and mobile data users offline for several hours, was caused by a \"non-malicious software issue\".\n\nPrepare to switch to offline systems in the event of a cyber-attack, firms are being advised.\n\nInsulation programmes costing billions of pounds have led to widespread problems with damp and mould.\n\nThe former PM is among those in favour of targeted screening for men most at risk, but some medical experts are sceptical.\n\nThe deal was agreed last month but received a mixed reaction from political parties, victims’ groups and veterans.\n\nFamiliar faces from Brookside will return to the small screen for a one-off special episode.\n\nDriving licence applicants will get an email prompt encouraging them to become regular donors amid low NHS blood stocks.\n\nThere may be evidence of racism in how a police team targeted black justice campaigners, an inquiry hears.\n\nPublic services could face big cuts if Mark Drakeford cannot get other parties to back his budget.\n\nThe government's national security adviser is facing pressure over whether he played a role in the trial's collapse.\n\nOn Monday, shadow chancellor Mel Stride gave his speech to a partially empty hall in Manchester.\n\nThe late author appeared in the TV adaptation of her 1988 novel last year.\n\nTwo people died and three people were injured in the attack at a synagogue on Thursday.\n\nGreen Party leader Zack Polanski has delivered his first conference speech as leader and criticised the rise of Nigel Farage's Reform party.\n\nCameron McGerr lost both his parents and is campaigning to have life-saving first aid taught in schools.\n\nTwo participants from Rose Ayling-Ellis: Old Hands, New Tricks share how BSL has transformed their lives.\n\nPsychologists subjected a BBC reporter to a carefully designed thermal camera stress test.\n\nHow to keep friendships alive as an adult alongside work, family and endless to-do lists.\n\nMark Hutchinson was only 52 when he died unexpectedly last year after suffering two strokes \"out of the blue\".\n\nDavid Coote was charged on 12 August following an investigation by Nottinghamshire Police.\n\nPolice believe the trailer became detached from a Mitsubishi Outlander and struck a pram on the pavement.\n\nRebecca Comins, described as a \"fierce competitor\", had reached speeds of up to 30mph.\n\nThe deal was agreed last month but received a mixed reaction from political parties, victims’ groups and veterans.\n\nThe inquiry into the government's handling of the pandemic has heard from politicians, civil servants, experts and bereaved families.\n\nServices using the line between Bristol, Bath and London will be affected.\n\nThe far-right activist was charged under the Terrorism Act over an incident at the Channel Tunnel in July 2024.\n\nGill and Pete Brisley lost their daughter and two granddaughters in the 7 October attacks by Hamas.\n\nDrew Jonkmans reaches the halfway point of a running and cycling challenge to raise support for mental health.\n\nGermany's President Steinmeier will visit King Charles on a state visit to the UK in December.\n\nThe disgraced Lostprophets frontman was fatally injured at HMP Wakefield on Saturday.\n\nAdam, Nikki and Isa contacted Your Voice, Your BBC News to share their thoughts on Britishness and flags.\n\nCelebrated rock pianist Rick Wakeman says he is \"very proud\" of a stamp set created in his honour.",
  "url": "https://www.bbc.com/news/uk",
  "scraped_timestamp": "2025-10-14T15:45:39.939030",
  "content_length": 3804,
  "word_count": 610,
  "source_domain": "www.bbc.com"
}