{
  "title": "NewsNews",
  "content": "Many have been unable to leave the territory since the Allenby Bridge crossing was shut indefinitely on Wednesday.\n\nIn a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.\n\nThousands of Palestinians have been forced to flee Gaza City since Israel launched its ground offensive last week.\n\nAustralian doctors say they are having to operate in filthy conditions with few or no anaesthetics.\n\nBritain and France's decision to recognise a Palestinian state is a historic moment, but it only becomes feasible with US support.\n\nIn a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.\n\nWomen and children were among 20 people who died when a strike hit a building sheltering displaced families, first responders say.\n\nTwo have been taken to hospital with serious shrapnel injuries, the Magen David Adom ambulance service says.\n\nThousands of Palestinians have been forced to flee Gaza City since Israel launched its ground offensive last week.\n\nHamas-linked social media channels say \"three collaborators who were spying for the occupation\" were executed.\n\nInside Panorama and BBC Eye's investigation into hunger in Gaza and why so many are risking their lives for aid.\n\nThe UK, Australia, Canada and France have recognised a Palestinian state, while other countries are set to do so in the coming days.\n\nWith the president approaching 90 years of age and another possible candidate in jail, finding the right leadership would be a challenge\n\nThe PM had signalled a shift in policy unless Israel took steps including agreeing to a ceasefire in Gaza.\n\nPalestinians living in the West Bank describe the impact of Israel's occupying control.\n\nIsrael has ordered hundreds of thousands of people to head south to al-Mawasi as it seeks to fully occupy Gaza City.\n\nTheir intervention comes as US Secretary of State Marco Rubio arrives in Israel to meet the Israeli PM.\n\nPalestinians tell the BBC whole residential blocks have been levelled as the Israeli army ramps up its offensive in the city.\n\nThe former prime minister has been in high-level planning talks over the territory's future, the BBC understands.\n\nThe US president spoke ahead the Israeli PM's address to the UN General Assembly on Friday.\n\nThe tech giant said its products were not intended to be used for mass surveillance of civilians.\n\nIn a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.\n\nIsrael does not allow foreign journalists into Gaza independently, citing security grounds.\n\nThe Haywards Heath charity is marking its 25th anniversary with a nationwide fundraising challenge.\n\nWomen and children were among 20 people who died when a strike hit a building sheltering displaced families, first responders say.\n\nTwo have been taken to hospital with serious shrapnel injuries, the Magen David Adom ambulance service says.\n\nItaly's defence minister directs a navy vessel to assist the flotilla's boats after what he says was a drone attack by unidentified perpetrators off Crete.",
  "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
  "scraped_timestamp": "2025-09-26T16:01:10.600543",
  "content_length": 3069,
  "word_count": 494,
  "source_domain": "www.bbc.com"
}