{
  "title": "NewsNews",
  "content": "An investigation by the watchdog into Leicestershire Police officers was reopened in March.\n\nKlevi Shekaj and teenager Leo Reid's killers smirked and showed no remorse during their murder trial.\n\nWatch live as Housing Secretary Steve Reed takes part in a series of quickfire interviews.\n\nBilly Vigar's family said they were \"devastated\" by his untimely passing at the age of just 21.\n\nA dozen flags appear on the same lamp-posts that caused a floral group a health and safety headache.\n\nKlevi Shekaj and teenager Leo Reid's killers smirked and showed no remorse during their murder trial.\n\nHashem Abedi appears in court over an alleged attack on prison officers earlier this year.\n\nResidents are calling for urgent action from the Environment Agency and Anglian Water.\n\nWatch live as Housing Secretary Steve Reed takes part in a series of quickfire interviews.\n\nJurors were unable to reach a verdict on manslaughter charges against co-defendant Lewis Carr.\n\nNottinghamshire County Council leader Mick Barton is still refusing to be interviewed by a local paper.\n\nKristopher Follos, 45, from Morpeth, is remanded in custody over the incident at a service station.\n\nIftikhar Mughal died after falling to the pavement from scaffolding that did not have a guardrail.\n\nA diversion is put in place as police and highways officers work to remove the obstruction.\n\nFinalist Sophie Segrue admits she never expected to hear back after her application to the show.\n\nMax Fosh travelled across the sea from Sennen Cove in Cornwall to Hugh Town.\n\nAbout 70 old cast iron road signs are spruced up by the anonymous volunteer in their spare time.\n\nThe Anthony Nolan Cell Collection Centre is the first in the UK dedicated to transplants.\n\nMaria Chekh is one of 16 soldiers who swapped the front line for classes at Warwick Business School.\n\nThe family of Clive Houghton are asking for colleagues from his time working for BT to come forward.\n\nThe station hall has been closed for more than two years for a £10.5m restoration project.\n\nCommunities are set to get powers to veto unwanted shops, but will it work in towns like Scunthorpe?\n\nPeople living in Portsmouth have told the BBC's Dan Johnson they feel unsafe in their own homes.\n\nThe beatbox championships were held in Bristol and saw people show off their skills.\n\nFans of the young wizard capture a scene for the upcoming HBO series being shot in Hertfordshire.\n\nStaff at Teesside Hospice plan a wedding in \"less than two weeks\" for one of their wellbeing patients.\n\nListen on BBC Radio 5 live and follow live text commentary on the opening foursomes in the Ryder Cup at Bethpage Black in New York.\n\nFollow live text updates and BBC radio commentaries from day three of the County Championship.\n\nEllie Kildunne went from not having a rugby club to playing for England in four years. A World Cup win would confirm the sport's new superstar.\n\nAll the latest from Friday's Premier League news conferences as Liverpool manager Arne Slot and Newcastle boss Eddie Howe speak to the media.\n\nThe coach left the A36 and went into a ditch between the Ower roundabout and junction 2 of the M27.\n\nKent County Council and Dartford and Ashford boroughs are making a new plea for the trains' return.\n\nEngland's Meg Jones explains how losing her parents to cancer and alcoholism has given her a new perspective on life, which has helped to drive her forward in the Red Roses' run to the Women's Rugby World Cup final.\n\nThe funding will see £2m allocated to the Holme Wood area of Bradford each year for the next decade.\n\nChoman Sameen, from Leeds, denies the charges against him and will face trial in Sheffield in 2026.\n\nJack McGlenen will continue to represent the Dalton and Dawdon ward as an Independent.\n\nA look at what stories are trending across the West of England.\n\nEmergency services say the road could be closed \"for some time\".",
  "url": "https://www.bbc.com/news/england",
  "scraped_timestamp": "2025-09-26T17:44:24.327841",
  "content_length": 3863,
  "word_count": 653,
  "source_domain": "www.bbc.com"
}