{
  "title": "NewsNews",
  "content": "Bereaved Israeli families express anger that the remains of only four out of 28 deceased hostages were handed over during Monday's exchange.\n\nA major hostage and prisoner exchange marks a significant step towards ending two years of war in Gaza.\n\nThe US president says the ceasefire will hold and the second phase of negotiations for a lasting peace are under way.\n\nIsrael and Hamas are exchanging hostages and prisoners as part of phase one of Donald Trump's peace plan for Gaza.\n\nAt least 27 people have been killed in one of the most violent internal confrontations since Israeli troops withdrew.\n\nA major hostage and prisoner exchange marks a significant step towards ending two years of war in Gaza.\n\nFamilies say it ends \"two years of hell\" and a journey of \"healing and rehabilitation\" will now begin.\n\nThousands of people gather in Gaza and the West Bank to welcome Palestinian prisoners and detainees freed by Israel.\n\nThe US president says the ceasefire will hold and the second phase of negotiations for a lasting peace are under way.\n\nCommando snipers were used to disable boats travelling across the Gulf of Oman, the Royal Navy says.\n\nRoei Shalev saw his girlfriend murdered in front of him during the Hamas attack.\n\nSeveral of the hostages will be brought from Gaza to the Rabin Medical Center in Petah Tikva.\n\nThe facility in Idaho will be used to train Qatari pilots to fly F-15 fighter jets, the US defence secretary says.\n\nFor the first time since the Hamas attacks on Israel two years ago, there is a realistic chance of ending the horrors\n\nThe Israeli military says 20 living hostages have been released by Hamas and have returned to Israel.\n\nAlaa Abdel Fattah tells the BBC's Today programme about life after a decade in prison.\n\nTrump's unique style and his relationships with key players helped but there were also factors beyond his control.\n\nThe Skeik building, in a quiet road in western Gaza City, has seen many families pass through it since the war began.\n\nThe conflict between Israel and the Palestinian people is one of the longest-running in the world.\n\nThe US president and other world leaders signed the first phase of the Gaza ceasefire deal in Sharm el-Sheik.\n\nIsrael is releasing 250 Palestinian prisoners as part of the ceasefire deal with Hamas.\n\nVideo released by the Israeli military shows Mor smiling and embracing two relatives.\n\nThe footage shows Alon Ohel and Guy Gilboa-Dalal speaking to Israeli soldiers after being freed from Hamas captivity in Gaza.\n\nThe BBC's Anthony Zurcher breaks down how the US president's connections have brought about a breakthrough moment for the Middle East.\n\nA major hostage and prisoner exchange marks a significant step towards ending two years of war in Gaza.\n\nIsrael says it has released 1,968 prisoners and detainees as part of a ceasefire deal with Hamas.\n\nFamilies say it ends \"two years of hell\" and a journey of \"healing and rehabilitation\" will now begin.\n\nIn an exclusive interview with BBC Panorama, the king says a two-state solution is the only answer.\n\nThe US president was speaking at the Israeli parliament after the release of all 20 living hostages from Gaza.\n\nThousands of people gather in Gaza and the West Bank to welcome Palestinian prisoners and detainees freed by Israel.\n\nIsrael is releasing 250 Palestinian prisoners as part of the ceasefire deal with Hamas.\n\nVideo released by the Israeli military shows Mor smiling and embracing two relatives.\n\nIsrael and Hamas are exchanging hostages and prisoners as part of phase one of Donald Trump's peace plan for Gaza.",
  "url": "https://www.bbc.com/news/world/middle_east",
  "scraped_timestamp": "2025-10-14T14:47:51.907382",
  "content_length": 3566,
  "word_count": 597,
  "source_domain": "www.bbc.com"
}