{
  "title": "NewsNews",
  "content": "Police are carrying out a reinvestigation into the unsolved killing of Sandra Phillips in 1985.\n\nJoanne Penney died after being shot in Llys Illtyd, Talbot Green, Rhondda Cynon Taf on 9 March.\n\nThe couple were settling down for a glass of wine before an explosion devastated their home.\n\nA 57-year-old man is charged with three counts of causing serious injury by dangerous driving.\n\nCardiff council issues guidance for when when a child is suspected of having a weapon.\n\nJoanne Penney died after being shot in Llys Illtyd, Talbot Green, Rhondda Cynon Taf on 9 March.\n\nFin Gough and Sioned Cray's saying poody confused producers but is in the Oxford English Dictionary.\n\nDrought had been declared in parts of Wales after the driest period since 1976.\n\nThe couple were settling down for a glass of wine before an explosion devastated their home.\n\nDavies will make her Strictly debut on Saturday and will be dancing the waltz with Nikita Kuzmin.\n\nA review of the front page stories from the daily and weekly newspapers in Wales.\n\nLabour is facing a fight to retain the seat in a Senedd by-election next month.\n\nThe hearing heard that the slap on the child's hand was in response to \"challenging\" behaviour.\n\nThe Emmy Award winning actor is set to play Richard Burton in a show raising money for the Welsh National Theatre.\n\nYear 10 pupils starting in September 2025 are the first to study new-look GCSEs, but what are they?\n\nFizz, from Powys, beat thousands of other felines across the UK in winning 'Cat of the Year'.\n\nWelsh actress Joanna Page says she was warned by a producer the man could be \"handsy\".\n\nChris Daniel has climbed Pen y Fan 366 times in less than six months, smashing the previous record.\n\nThousands of people marched through the town to oppose the bunkers construction.\n\nAs Wales' professional sides prepare for a new campaign, they have to wonder whether the 2025-26 season will be their final one - so how are the four regions coping?\n\nFollow live text updates and BBC radio commentaries from day three of the County Championship.\n\nGareth Davies recalls the day - exactly 10 years ago - that Wales beat England 28-25 in an epic World Cup match at Twickenham.\n\nGreat Britain win two gold medals at the 2025 World Rowing Championships in Shanghai, with victory in the men's four and PR1 men's single sculls.\n\nCardiff sign former Wales full-back Leigh Halfpenny for the 2025-26 season.\n\nFe gafodd merch 17 oed anafiadau difrifol o ganlyniad i'r gwrthdrawiad rhwng dau gerbyd ar nos Fawrth.\n\nCafodd Sandra Phillips, 37, ei lladd tra'n gweithio mewn siop ryw ar Stryd Dillwyn, Abertawe yn 1985.\n\nMae canllawiau - y cyntaf o'u math yng Nghymru - wedi'u cyflwyno yng Nghaerdydd ar beth fydd yn digwydd os ydy plentyn yn cael eu hamau o fod yn cario arf.\n\nHywel Gwynfryn yn hel atgofion am y ddeuawd hynod boblogaidd o'r 1960au a 1970au, a'u dylanwad ar ddiwylliant poblogaidd Cymru.\n\nA 57-year-old man is charged with three counts of causing serious injury by dangerous driving.\n\nDrought had been declared in parts of Wales after the driest period since 1976.\n\nPolice are carrying out a reinvestigation into the unsolved killing of Sandra Phillips in 1985.\n\nFin Gough and Sioned Cray's saying poody confused producers but is in the Oxford English Dictionary.\n\nThe couple were settling down for a glass of wine before an explosion devastated their home.\n\nThe couple were settling down for a glass of wine, before an explosion devastated their home.\n\nCardiff council issues guidance for when when a child is suspected of having a weapon.\n\nA review of the front page stories from the daily and weekly newspapers in Wales.\n\nBody-worn and drone footage is shown to a jury in the trial of eight people accused of rioting.",
  "url": "https://www.bbc.com/news/wales",
  "scraped_timestamp": "2025-09-26T17:24:05.386512",
  "content_length": 3728,
  "word_count": 636,
  "source_domain": "www.bbc.com"
}