{
  "title": "NewsNews",
  "content": "A scene featuring a same-sex couple was digitally altered to depict a heterosexual couple.\n\nThe debt-ridden centre said the money would go towards paying overdue bills.\n\nPolice arrested the 61-year-old after a breakthrough in DNA and fingerprint technologies.\n\nCanada and Portugal also announced the move on Sunday, with Israeli PM Benjamin Netanyahu accusing leaders of giving a \"huge reward to terrorism\".\n\nThe outage left hundreds of people unable to contact emergency services and has been linked to multiple deaths.\n\nThe debt-ridden centre said the money would go towards paying overdue bills.\n\nAustralia's public broadcaster \"sacrificed\" Antoinette Lattouf \"to appease a lobby group\", the judge said.\n\nHannah Thomas says she was punched in the eye during a scuffle with police in June.\n\nPolice arrested the 61-year-old after a breakthrough in DNA and fingerprint technologies.\n\nAustralia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.\n\nThere are many more species of peacock spider than other animals, scientists think they may know why.\n\nIt has shaken consumer trust and raised questions about global sunscreen regulation.\n\nThe two democratic allies have had a spectacular falling out - but what has actually changed?\n\nThe BBC's Katy Watson was in the courtroom as Erin Patterson was sentenced to life.\n\nVideo shows the aircraft flying over the golf course before crash landing, as the pilot and passenger escaped without major injuries.\n\nVeteran MP Bob Katter, 80, said he had previously punched people for mentioning his Lebanese heritage.\n\nThe debt-ridden centre said the money would go towards paying overdue bills.\n\nAustralia's public broadcaster \"sacrificed\" Antoinette Lattouf \"to appease a lobby group\", the judge said.\n\nGrace Harris is ruled out of Australia's squad for the World Cup and replaced by Heather Graham.\n\nHannah Thomas says she was punched in the eye during a scuffle with police in June.\n\nThe outage left hundreds of people unable to contact emergency services and has been linked to multiple deaths.\n\nChris Webster said he realised Patterson was a killer within minutes of speaking to her.\n\nThe country is one of the world's biggest carbon emitters per capita.\n\nHe faces 27 charges which allege that he indecently assaulted or groped nine men from 2001 to 2019.\n\nAustralia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.",
  "url": "https://www.bbc.com/news/world/australia",
  "scraped_timestamp": "2025-09-26T00:57:20.392337",
  "content_length": 2440,
  "word_count": 378,
  "source_domain": "www.bbc.com"
}