{
  "title": "NewsNews",
  "content": "The maker of Japan's most popular beer, Super Dry, was hit by a major cyber-attack last month.\n\nThe S&P 500 closed down 2.7%, its steepest fall since April, after the US president hit out at China.\n\nThe South Asian art market has raked in millions in recent months, even as global art sales slump.\n\nThis comes a day after Taiwan's defence ministry warned of the growing threat of a Chinese invasion.\n\nAmir Khan Muttaqi flies into Delhi from Russia, on a once unimaginable visit being closely watched by Pakistan.\n\nThe S&P 500 closed down 2.7%, its steepest fall since April, after the US president hit out at China.\n\nThe allegation by the Taliban came after two loud blasts were heard in the city late on Thursday.\n\nOne person has died from Friday's earthquake, which comes a week after a deadly quake hit the island of Cebu.\n\nThe South Asian art market has raked in millions in recent months, even as global art sales slump.\n\nHigh-ranking officials from China and Russia are in Pyongyang to attend the anniversary celebrations.\n\nMore than two dozen civilians were killed on Monday after a motorised army paraglider dropped bombs from above.\n\nThree weeks after Zubeen Garg's death, Assam is still unable to come to terms with the loss of a beloved icon.\n\nTwo games in Macau this weekend will be the first since the league was effectively frozen out in 2019.\n\nThe two leaders met in India's financial capital Mumbai to discuss ways to strengthen trade and business ties.\n\nA life-sized holographic police officer has been installed in central Seoul in a bid to deter crime. The BBC took to the streets to ask people if they think it’ll work.\n\nA wave of new share offerings shows India's markets are maturing, but the euphoria demands caution, say experts.\n\nIndia’s booming cough syrup market faces scrutiny after contaminated syrups kill multiple children.\n\nArattai is seeing a surge in popularity amid a push from Narendra Modi's government to boost self-reliance.\n\nDriving reverse migration from the US at scale will require a concerted effort that's currently missing, experts say.\n\nFemale reporters were excluded from an event at the Taliban government's embassy in New Delhi.\n\nNamed the Hwasong-20, its size suggests that it could carry multiple nuclear warheads.\n\nBorn in Afghanistan, Maiwand Banaye says he was radicalised as a teenager in a refugee camp in Pakistan, after his family fled civil war at home.\n\nThe South Asian art market has raked in millions in recent months, even as global art sales slump.\n\nThe allegation by the Taliban came after two loud blasts were heard in the city late on Thursday.\n\nThis comes a day after Taiwan's defence ministry warned of the growing threat of a Chinese invasion.\n\nAt least 20 children have died after consuming cough syrups contaminated with diethylene glycol.\n\nOne person has died from Friday's earthquake, which comes a week after a deadly quake hit the island of Cebu.\n\nA life-sized holographic police officer has been installed in central Seoul in a bid to deter crime. The BBC took to the streets to ask people if they think it’ll work.",
  "url": "https://www.bbc.com/news/world/asia",
  "scraped_timestamp": "2025-10-11T23:47:00.843423",
  "content_length": 3093,
  "word_count": 523,
  "source_domain": "www.bbc.com"
}