{
  "title": "NewsNews",
  "content": "James Comey says he is innocent and the charges are politically motivated, as they follow Trump pressure on prosecutors to act.\n\nThe criminal case against Comey fulfils the president's desire to seek retribution and further raises concerns about abuse of power.\n\nCombs' lawyers argue he was unjustly convicted under a federal law that was passed to combat human trafficking.\n\nRoughly 35 million people in the US could be eligible for refunds, according to the government.\n\nNearly $1 million worth of merchandise was stolen by about 25 people, according to police.\n\nThe criminal case against Comey fulfils the president's desire to seek retribution and further raises concerns about abuse of power.\n\nThe US president suggests the US could lift sanctions on Turkey and allow it to buy F-35 jets.\n\nThe US president said the move aims to help protect American manufacturers from foreign imports.\n\nOne detainee was killed and two others critically injured after a shooting at a Dallas ICE facility on Wednesday.\n\nCombs' lawyers argue he was unjustly convicted under a federal law that was passed to combat human trafficking.\n\nPresident Donald Trump tells reporters in the Oval Office the US will be \"safe for the World Cup\" next year.\n\nGrowth was revised up to 3.8% in the period from April through to June - up from the previous estimate of 3.3%.\n\nSara Jane Moore fired two shots at the Republican president during his visit to San Francisco in 1975.\n\nThe warning came after Trump refused a meeting with Democrats seeking healthcare funding in budget negotiations.\n\nUS officials have blamed Canada for not doing enough to stop its wildfire smoke from wafting south. Climate experts say it’s not so simple.\n\nDonald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.\n\nPresident Donald Trump has previously claimed Biden used an autopen to sign important documents, including pardons.\n\nMacron and Trump were in New York for the 80th UN General Assembly\n\nSuccess gets winners a spot on the champion's wall at Katmai National Park in Alaska, but also improves their survival chances this winter.\n\nIn a wide-ranging speech, President Trump slammed the world body and singled out many of the countries in attendance.\n\nTrump says a deal is done but the details have not been confirmed by China or the app's owner ByteDance.\n\nStartups and smaller firms could bear the brunt of Trump's new H-1B visa fee, and some fear it could thwart US innovation.\n\nAstronauts of Nasa's first crewed mission to the Moon for more than 50 years hope their journey inspires a new generation.\n\nThe US talk show host isn't backing down after being suspended; it seems to have hardened his resolve.\n\nThe US leader's address was one of the clearest expositions of the way he sees the world, writes James Landale.\n\nJames Comey says he is innocent and the charges are politically motivated, as they follow Trump pressure on prosecutors to act.\n\nThe criminal case against Comey fulfils the president's desire to seek retribution and further raises concerns about abuse of power.\n\nThe former FBI director said he had \"great confidence in the federal judicial system\" after being indicted on two charges.\n\nSara Jane Moore fired two shots at the Republican president during his visit to San Francisco in 1975.\n\nRoughly 35 million people in the US could be eligible for refunds, according to the government.\n\nOne detainee was killed and two others critically injured after a shooting at a Dallas ICE facility on Wednesday.\n\nCombs' lawyers argue he was unjustly convicted under a federal law that was passed to combat human trafficking.\n\nNearly $1 million worth of merchandise was stolen by about 25 people, according to police.\n\nThe gunman fired at an unmarked van near the detention facility, before taking his own life, officials say.",
  "url": "https://www.bbc.com/news/us-canada",
  "scraped_timestamp": "2025-09-26T16:26:10.082561",
  "content_length": 3876,
  "word_count": 645,
  "source_domain": "www.bbc.com"
}