{
  "title": "NewsNews",
  "content": "Andrew Lynas' comments come as a House of Lords committee finds the Windsor Framework is \"impossible to navigate\".\n\nThe deal was agreed last month but received a mixed reaction from political parties, victims’ groups and veterans.\n\nPeter Jackson sued Danielle Meagher for libel following a social media post in April 2018.\n\nThe Ulster Beekeepers' Association has said it is very worried about the discovery of the hornet.\n\nThe Republic of Ireland breathe new life into their World Cup qualifying campaign with a much-needed 1-0 win over 10-man Armenia at Aviva Stadium.\n\nThe deal was agreed last month but received a mixed reaction from political parties, victims’ groups and veterans.\n\nA prosecution lawyer tells Belfast Crown Court military witness statements are consistent on Soldier F firing his rifle.\n\n90-year-old Maryette was the oldest of more than 300 graduates at the Open University's ceremony in Belfast on Tuesday.\n\nPeter Jackson sued Danielle Meagher for libel following a social media post in April 2018.\n\nThe Prince and Princess of Wales make their first joint visit to Northern Ireland in three years.\n\nA councillor hails the planning approval granted on Tuesday as \"fantastic news for the city\".\n\nHeather Humphreys made the claim during a radio debate when she challenged her rival Catherine Connolly's decision to employ the woman in her Dáil office.\n\nA look at returning Ireland head coach Andy Farrell's in-tray as he prepares to name his squad for next month's autumn internationals.\n\nA new report finds the lack of tree planting is putting climate action, nature recovery and community wellbeing at risk.\n\nDunloy is celebrating its first County Antrim senior football championship win in 89 years.\n\nBBC News NI has visited three towns, where locals say high rates, fast trains and derelict buidings are causing problems.\n\nThe final of BBC Young Chorister Of The Year 2025 aired on Sunday afternoon, with one Belfast hopeful bidding for the prize.\n\nThanks to a now defunct eligibility rule, Germany-born goalkeeper Maik Taylor became the most unlikely of Northern Ireland heroes.\n\nJim Gavin had been chosen to represent Fianna Fáil, the Republic of Ireland's biggest party in the coalition government\n\nDepartment for Infrastructure officials met residents affected by severe flooding in 2017.\n\nThe non-jury trial is taking place at Belfast Crown Court with the former soldier accused of two murders and five attempted murders.\n\nCordons remain in place after a section of the former convent on Pump Street in Derry collapsed at the weekend.\n\nThe assault and other offences took place in Altnagelvin hospital in Derry in March.\n\nA round-up of local news, sport and weather across the north west of Northern Ireland.\n\nHeather Humphreys, one of two people vying to be Ireland's next president, says she's \"well placed\" to speak to unionists.\n\nA man in his 50s was arrested and remains detained in Garda custody.\n\nThe incident on Abbey Street was said to have happened on Saturday, as  supporters marched through the city centre.\n\nEvan Moore, who is 20, was sentenced to four years in prison with the final 12 months suspended.\n\nCitizens in Northern Ireland will not get a say in who is elected as you need an address in the Republic of Ireland to vote.\n\nWake up to Good Morning Ulster and get all the news and analysis from home and abroad.\n\nBreaking news and hard-hitting talk about the big stories of the day.\n\nHighlights from Talkback. William Crawley and guests discuss the news headlines.\n\nAll the day’s news and analysis with Richard Morgan.\n\nThe latest news for Northern Ireland.\n\nTara Mills and Declan Harvey react and reflect on news stories in a BBC NI podcast.\n\nThe back-stop’s here? Bad puns with top political coverage from BBC Northern Ireland.\n\nHard-hitting investigations on the stories that matter in Northern Ireland.\n\nMark Carruthers provides comment and expert analysis on the week's political news\n\nMark Carruthers with the latest political news, interviews and debate.\n\nA councillor hails the planning approval granted on Tuesday as \"fantastic news for the city\".\n\nThe Prince and Princess of Wales make their first joint visit to Northern Ireland in three years.\n\nA prosecution lawyer tells Belfast Crown Court military witness statements are consistent on Soldier F firing his rifle.\n\n90-year-old Maryette was the oldest of more than 300 graduates at the Open University's ceremony in Belfast on Tuesday.\n\nPeter Jackson sued Danielle Meagher for libel following a social media post in April 2018.\n\nA new report finds the lack of tree planting is putting climate action, nature recovery and community wellbeing at risk.\n\nThe first sighting of an Asian hornet in Northern Ireland has been confirmed, the Northern Ireland Environment Agency (NIEA) has said.\n\nThe Ulster Beekeepers' Association has said it is very worried about the discovery of the hornet.\n\nThe police said they are not treating the death as murder at this time, following a post-mortem examination.",
  "url": "https://www.bbc.com/news/northern_ireland",
  "scraped_timestamp": "2025-10-15T10:06:32.738170",
  "content_length": 5005,
  "word_count": 807,
  "source_domain": "www.bbc.com"
}