{
  "title": "NewsNews",
  "content": "Muskan Sharma, who won the Miss Rishikesh contest, said it made her feel like Miss Universe.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nCanada's foreign minister visits Delhi as the sides restore ties strained by a murder on Canadian soil.\n\nParamjit Singh, an Indian passport holder, has lived in the US on a green card since 1994.\n\nSmaller Indian towns are becoming centres for training and correcting artificial intelligence models.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nThis is Google’s biggest investment outside the US , the firm's top executive says.\n\nIndia complete a clean sweep over West Indies to give Shubman Gill his first Test series win as captain.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nCanada's foreign minister visits Delhi as the sides restore ties strained by a murder on Canadian soil.\n\nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.\n\nThe South Asian art market has raked in millions in recent months, even as global art sales slump.\n\nThree weeks after Zubeen Garg's death, Assam is still unable to come to terms with the loss of a beloved icon.\n\nIndia’s booming cough syrup market faces scrutiny after contaminated syrups kill multiple children.\n\nDriving reverse migration from the US at scale will require a concerted effort that's currently missing, experts say.\n\nSeveral neighbourhoods in Kolkata have been inundated, with water entering people's homes.\n\nRescue efforts are under way after the Himalayan region was hit by torrential downpour.\n\nThe Chinese, Indian and Russian leaders were among those attending a regional security summit in China over the weekend.\n\nRussian President Vladimir Putin and Indian Prime Minister Narendra Modi are among the 20 world leaders attending a regional security summit in China.\n\nAt least 30 people have died since Tuesday, as flash floods swept away roads and submerged homes.\n\nMuskan Sharma, who won the Miss Rishikesh contest, said it made her feel like Miss Universe.\n\nIndia complete a clean sweep over West Indies to give Shubman Gill his first Test series win as captain.\n\nThis is Google’s biggest investment outside the US , the firm's top executive says.\n\nSmaller Indian towns are becoming centres for training and correcting artificial intelligence models.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nCanada's foreign minister visits Delhi as the sides restore ties strained by a murder on Canadian soil.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nParamjit Singh, an Indian passport holder, has lived in the US on a green card since 1994.\n\nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.",
  "url": "https://www.bbc.com/news/world/asia/india",
  "scraped_timestamp": "2025-10-15T09:44:17.699575",
  "content_length": 2977,
  "word_count": 477,
  "source_domain": "www.bbc.com"
}