{
  "title": "NewsNews",
  "content": "People in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nA court orders their parents to compensate Haidilao for reputational and operational losses.\n\nThe deal will pave the way to US ownership of the social media platform's American operations, according to the US treasury secretary.\n\nThe accusation comes as the US and China hold talks to de-escalate the trade war between the two.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nRagasa is the strongest storm anywhere on Earth so far this year.\n\nOfficials are investigating the firm after the display drew backlash for its potential environmental impact.\n\nA court orders their parents to compensate Haidilao for reputational and operational losses.\n\nAgricultural brokers tell the BBC there has been a surge of interest from exporters in trade with China.\n\nPresident Xi shows off his power and influence in an open challenge to US supremacy and the world order.\n\nThe display of might comes as Beijing positions itself as a global counterweight to the United States.\n\nBeijing's shipbuilding capacity is 200 times that of the US, an expert says, calling the scale \"extraordinary\".\n\nBeijing has unveiled a range of military hardware in a show of might to Western powers.\n\nA scene featuring a same-sex couple was digitally altered to depict a heterosexual couple.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nIt is China's first firm goal to reduce emissions but falls well short of what is needed to meet global targets.\n\nThe \"king of storms\" has forced the evacuation of nearly two million people from the southern Chinese province of Guangdong.\n\nRagasa is the world's strongest storm this year and has been roaring over the South China Sea for days.\n\nA person was swept off their feet as water burst into the building.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nThe BBC's Laura Bicker says residents of southern China are largely heeding warnings from authorities as the storm lashes the region with wind and rain.\n\nRagasa is the strongest storm anywhere on Earth so far this year.",
  "url": "https://www.bbc.com/news/world/asia/china",
  "scraped_timestamp": "2025-09-26T00:24:48.969859",
  "content_length": 2365,
  "word_count": 392,
  "source_domain": "www.bbc.com"
}