{
  "title": "NewsNews",
  "content": "The US president says Ukraine can win back land with support from Nato and Europe, marking a major shift in his position.\n\nPresident Zelensky says Moscow seeks to \"intimidate civilians\", while Russia reports four deaths in a Ukrainian strike.\n\nRussia imprisoned Dmytro shortly after its invasion of Ukraine in 2022. He was freed last month.\n\nThe Zapad-2025 military drills come just days after Poland accused Moscow of violating its air space with a drone incursion.\n\nThe BBC's Russia editor, Steve Rosenberg, reports from joint manoeuvres by Russia and Belarus, as part of the Zapad 2025 (West 2025) military drills.\n\nPresident Zelensky says Moscow seeks to \"intimidate civilians\", while Russia reports four deaths in a Ukrainian strike.\n\nRussia denies jets entered Estonian airspace in the same month as its drones violated the airspace of two other Nato members.\n\nEvans Kibet, now being held in Ukraine after surrendering, says he did not know he was signing up.\n\nRussia imprisoned Dmytro shortly after its invasion of Ukraine in 2022. He was freed last month.\n\nHow Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months.\n\nWhether the drone incursion was deliberate or accidental, Moscow will be watching Nato's response to it closely.\n\nA new law says men under the age of 23 can now leave the country. But why has Ukraine brought it in?\n\nUkraine says Russia deliberately hit the main government building in Kyiv with a missile last Sunday.\n\nMoscow's diplomatic success in China, and Trump's lack of action, have emboldened Putin, reports Steve Rosenberg.\n\nIn Bilozerske, eastern Ukraine, people must make the agonising decision to flee or risk staying.\n\nThe Duke of Sussex said he wanted to do \"everything possible\" to help the recovery of military personnel injured in the war with Russia.\n\nThe BBC's Sarah Rainsford says Sunday's attack caused \"a huge amount of damage\".\n\nBoth Russia and Ukraine are using blow up dolls and plastic decoys as tricks on the battlefield.\n\nUkraine midfielder Georgiy Sudakov says his apartment in Kyiv is severely damaged after being struck by a Russian drone while his wife and child were at home.\n\nYour questions answered after the US president's UK state visit.\n\nMaria Chekh is one of 16 soldiers who swapped the front line for classes at Warwick Business School.\n\nThe US president suggests the US could lift sanctions on Turkey and allow it to buy F-35 jets.\n\nVladimir Putin \"will keep driving the war forward wider and deeper\", the Ukrainian president tells the UN.\n\nThe BBC's Steve Rosenberg says far from being riled by Trump's comments, Russia's response has so far been restrained.\n\nHow Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months.\n\nThe US president says Ukraine can win back land with support from Nato and Europe, marking a major shift in his position.\n\nMany Ukranians living in the UK say there is little prospect of them being able to return home soon.\n\nThe US leader's address was one of the clearest expositions of the way he sees the world, writes James Landale.\n\nOn Monday night Kastrup airport in Copenhagen was forced to shut down for several hours following several drone sightings.",
  "url": "https://www.bbc.com/news/war-in-ukraine",
  "scraped_timestamp": "2025-09-26T16:42:23.053583",
  "content_length": 3263,
  "word_count": 538,
  "source_domain": "www.bbc.com"
}