{
  "title": "NewsNews",
  "content": "The former prime minister has been in high-level planning talks over the territory's future, the BBC understands.\n\nThe US president spoke ahead the Israeli PM's address to the UN General Assembly on Friday.\n\nMany have been unable to leave the territory since the Allenby Bridge crossing was shut indefinitely on Wednesday.\n\nIsrael does not allow foreign journalists into Gaza independently, citing security grounds.\n\nThe United States government say it will try to block any attempts to ban Israel from competing at the 2026 World Cup.\n\nThe US president spoke ahead the Israeli PM's address to the UN General Assembly on Friday.\n\nIn a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.\n\nThe Israeli military says its \"most powerful strike\" in Yemen targeted security and military targets, but the Houthis say civilian facilities were hit.\n\nMany have been unable to leave the territory since the Allenby Bridge crossing was shut indefinitely on Wednesday.\n\nWomen and children were among 20 people who died when a strike hit a building sheltering displaced families, first responders say.\n\nSyrian president Ahmed Al-Sharaa became the first representative of Syria to address world leaders at the United Nations General Assembly for almost sixty years.\n\nThousands of Palestinians have been forced to flee Gaza City since Israel launched its ground offensive last week.\n\nTwo have been taken to hospital with serious shrapnel injuries, the Magen David Adom ambulance service says.\n\nInside Panorama and BBC Eye's investigation into hunger in Gaza and why so many are risking their lives for aid.\n\nBritain and France's decision to recognise a Palestinian state is a historic moment, but it only becomes feasible with US support.\n\nThe UK, Australia, Canada and France have recognised a Palestinian state, while other countries are set to do so in the coming days.\n\nPalestinians living in the West Bank describe the impact of Israel's occupying control.\n\nIsrael has ordered hundreds of thousands of people to head south to al-Mawasi as it seeks to fully occupy Gaza City.\n\nThe drought has slashed wheat harvests by 40% in a country where nearly 90% of the population already lives in poverty.\n\nSyrian president Ahmed Al-Sharaa became the first representative of Syria to address world leaders at the United Nations General Assembly for almost sixty years.\n\nThe Iraqi President Abdul Latif Rashid has rejected Washington’s argument that the move is a reward for Hamas.\n\nPrime Minister Starmer says the move will \"revive the hope of peace\" but Israel says it is \"nothing but a reward for jihadist Hamas\".\n\nBBC Verify's Merlyn Thomas looks at the latest Israeli strikes on buildings in Gaza City city over the weekend.\n\nAs Israel insists the whole population of Gaza City must leave, the BBC visits new aid sites the army claims will help them.\n\nThe former prime minister has been in high-level planning talks over the territory's future, the BBC understands.\n\nThe US president spoke ahead the Israeli PM's address to the UN General Assembly on Friday.\n\nThe Israeli military says its \"most powerful strike\" in Yemen targeted security and military targets, but the Houthis say civilian facilities were hit.\n\nIn a speech to the UN, Mahmoud Abbas also calls on more countries to recognise a Palestinian state.\n\nMany have been unable to leave the territory since the Allenby Bridge crossing was shut indefinitely on Wednesday.\n\nIsrael does not allow foreign journalists into Gaza independently, citing security grounds.\n\nWomen and children were among 20 people who died when a strike hit a building sheltering displaced families, first responders say.\n\nSyrian president Ahmed Al-Sharaa became the first representative of Syria to address world leaders at the United Nations General Assembly for almost sixty years.\n\nTwo have been taken to hospital with serious shrapnel injuries, the Magen David Adom ambulance service says.",
  "url": "https://www.bbc.com/news/world/middle_east",
  "scraped_timestamp": "2025-09-26T17:13:19.338097",
  "content_length": 3952,
  "word_count": 633,
  "source_domain": "www.bbc.com"
}