{
  "title": "NewsNews",
  "content": "Brian Allison says an unexplained mix-up with his mother's ashes tormented his late sister as she battled cancer.\n\nThe escape of 75,000 farmed fish from damaged pens in the Highlands could pose a genetic threat to native Atlantic salmon.\n\nThe Royal College of GPs says it is not clear how the new services, promised by John Swinney, will be staffed when the GP workforce is smaller.\n\nThe former Manchester United manager paid for overnight accommodation for Benburb FC before they play Wick.\n\nKevin Muscat is the leading candidate to replace Russell Martin as Rangers head coach, although the Ibrox club are talking to other targets.\n\nThe escape of 75,000 farmed fish from damaged pens in the Highlands could pose a genetic threat to native Atlantic salmon.\n\nResearchers at the University of Dundee find that a measure used to assess the health of older people can improve quality of life for younger patients.\n\nPolice believe the trailer became detached from a Mitsubishi Outlander and struck a pram on the pavement.\n\nThe Royal College of GPs says it is not clear how the new services, promised by John Swinney, will be staffed when the GP workforce is smaller.\n\nThe Old Forge in Knoydart said staff had received 'inappropriate grief' over the Halloween event\n\nMihai Nicolae Patran assaulted a 27 year-old doctor as she walked along Mitchell Street in November 2023.\n\nJim Glennie was just 18 when he went to Normandy and says it was just by \"sheer luck\" he survived.\n\nAlan Johnston, 62, of Laurencekirk, Aberdeenshire, hit the woman with a van in March last year.\n\nBan Van Nguyen and Long Van Le were tending to more than 500 plants when officers police raided the property in Dundee.\n\nCameron McGerr lost both his parents and is campaigning to have life-saving first aid taught in schools.\n\nAnd Craig Levein’s surprise Rangers recommendation.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nThe rotors, first used in 1925 on a journey to Scotland, are being revived to help emissions in shipping.\n\nMark Hutchinson was only 52 when he died unexpectedly last year after suffering two strokes \"out of the blue\".\n\nOfficers carried out searches in Bonnyrigg and at addresses in Dumfries and Galloway.\n\nThe escape of 75,000 farmed fish from damaged pens in the Highlands could pose a genetic threat to native Atlantic salmon.\n\nJim Glennie was just 18 when he went to Normandy and says it was just by \"sheer luck\" he survived.\n\nPolice believe the trailer became detached from a Mitsubishi Outlander and struck a pram on the pavement.\n\nResearchers at the University of Dundee find that a measure used to assess the health of older people can improve quality of life for younger patients.\n\nKevin Muscat is the leading candidate to replace Russell Martin as Rangers head coach, although the Ibrox club are talking to other targets.\n\nAround 3000 athletes will compete for 215 gold medals at the Commonwealth Games next summer after the Glasgow 2026 schedule is confirmed.\n\nThe SPFL issue a suspended reduction of 50 tickets on Rangers for future away matches after the Ibrox club are found to have breached rules on the opening day of the Premiership season.\n\nWorld champion skip Bruce Mouat is sure Scotland would be a great choice to host a curling Grand Slam as the tournament series prepares to shift out of Canada for the first time.\n\nBig stories from across the country\n\nThe BBC's Scottish news podcast.\n\nMore from the day’s top stories and communities across Scotland.\n\nThe nation's morning news programme.\n\nThe escape of 75,000 farmed fish from damaged pens in the Highlands could pose a genetic threat to native Atlantic salmon.\n\nA review of the front page stories from the daily newspapers in Scotland.\n\nExperienced shipbuilder Duncan Anderson will take on the role on an interim basis.\n\nThe announcement came during the first minister's keynote speech at the SNP conference in Aberdeen.\n\nEnergy company SSEN Transmission said it would replace the overhead power line between Dunoon and Loch Long.\n\nA review of the front page stories from the daily newspapers in Scotland.\n\nThe rotors, first used in 1925 on a journey to Scotland, are being revived to help emissions in shipping.\n\nA review of Scotland's newspaper front pages.\n\nThe first minister will declare a mandate for a second independence referendum, if the SNP wins a majority of seats in the 2026 Holyrood election.",
  "url": "https://www.bbc.com/news/scotland",
  "scraped_timestamp": "2025-10-15T10:34:35.273731",
  "content_length": 4422,
  "word_count": 739,
  "source_domain": "www.bbc.com"
}