{
  "title": "NewsNews",
  "content": "Donald Trump says a deal on the future of TikTok in the US has been made, but it’s not been confirmed by China or the app’s owner ByteDance.\n\nPessimistic social media posts may now be targets of a fresh crackdown by the Chinese government.\n\nThe government's multi-billion-dollar \"nutritious meals programme\" has been plagued by food poisoning.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nThe debt-ridden centre said the money would go towards paying overdue bills.\n\nPessimistic social media posts may now be targets of a fresh crackdown by the Chinese government.\n\nHarjit Kaur, 73, had lived in the US for over 30 years before being deported to India.\n\nA court said the espionage was carried out \"over a long period\"  and involved \"important intelligence\".\n\nThe government's multi-billion-dollar \"nutritious meals programme\" has been plagued by food poisoning.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nIt is China's first firm goal to reduce emissions but falls well short of what is needed to meet global targets.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nSocial media footage showed the massive crater in Thailand's capital leaving cars teetering on the edge.\n\nAustralia's public broadcaster \"sacrificed\" Antoinette Lattouf \"to appease a lobby group\", the judge said.\n\nAs the K-pop idols continue to break records, they stay focused on making music and meeting fans.\n\nThe BBC's Laura Bicker says residents of southern China are largely heeding warnings from authorities as the storm lashes the region with wind and rain.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nBahison Ravindran thought he was an Indian by birth - until police declared his passport invalid.\n\nKaran Johar, Aishwarya Rai, Abhishek Bachchan and others have gone to court to protect their personality rights.\n\nA court said the espionage was carried out \"over a long period\"  and involved \"important intelligence\".\n\nHarjit Kaur, 73, had lived in the US for over 30 years before being deported to India.\n\nInspector Zende tells the story of an Indian police officer who captured notorious killer Charles Sobhraj twice.\n\nPessimistic social media posts may now be targets of a fresh crackdown by the Chinese government.\n\nThe government's multi-billion-dollar \"nutritious meals programme\" has been plagued by food poisoning.\n\nMany tattoo artists have operated illegally for the past 30 years, leaving them at the sharp end of the law.\n\nA scene featuring a same-sex couple was digitally altered to depict a heterosexual couple.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.",
  "url": "https://www.bbc.com/news/world/asia",
  "scraped_timestamp": "2025-09-26T17:34:26.193573",
  "content_length": 2979,
  "word_count": 481,
  "source_domain": "www.bbc.com"
}