{
  "title": "NewsNews",
  "content": "The case against Liam  Óg Ó hAnnaidh is thrown out following a technical error in the way the charge against him was brought.\n\nThe Acute Mental Health Inpatient Centre on the Belfast City Hospital site was opened six years ago at a cost of £33m.\n\nEach month 350 families in NI will lose a loved one to cardiovascular conditions, the British Heart Foundations says.\n\nThe cost is on top of the almost £2,500 spent on repairs to the painting, which were carried out by a professional conservator.\n\nThe prime minister insists new Troubles legacy protections are for Army veterans but not paramilitaries.\n\nThe Acute Mental Health Inpatient Centre on the Belfast City Hospital site was opened six years ago at a cost of £33m.\n\nEmergency services were alerted at around 20:00 local time on Thursday by a member of the public.\n\nMichelle O'Neill has called plans for a compulsory UK-wide digital ID scheme an attack on the Good Friday Agreement.\n\nEach month 350 families in NI will lose a loved one to cardiovascular conditions, the British Heart Foundations says.\n\nCaoimhin Teggart has died from injuries sustained in a collision between a VW Bora and a Toyota Avensis on the Ballydugan Road.\n\nThe Pittsburgh Steelers showdown in Ireland is a homecoming for the Rooneys whose ancestors come from Newry.\n\nOlympic medallists Philip Doyle and Fintan McCarthy won bronze in the men’s double sculls final at the World Championships in Shanghai.\nThe Irish combination from Banbridge and Skibbereen, sculling together in competition for the first time, were in the mix for the medals from the start of the race but saw Miroslaw Zietarski and Mateusz Biskup from Poland ease away to take gold followed by the Serbian duo, Martin Mackovic and Nikolaj Pimenov.\nDoyle and McCarthy held on to take a comfortable third place.\n\nSt Ronan's College in Lurgan is one of nine schools to be provided with pouches as part of a new pilot started by the Department of Education.\n\nDublin City councillors voted to award the honour to the former US president and his wife Michelle in 2017.\n\nThe new treatment is a type of gene therapy given during 12 to 18 hours of delicate brain surgery.\n\nDublin-born Bonnie Anne Clyde and west Belfast's Elle Vosque are competing in the new season of Ru Paul's Drag Race UK.\n\nFigures obtained by BBC News NI show there were 63 fines handed down for water pollution between 2020 and 2024.\n\nSwimming is not permitted at Downhill or Portstewart, and Castlerock is also being monitored.\n\nThe new Netflix drama tells the story of Ireland's most famous family name at the moment of crisis.\n\nPolice say the death is non-suspicious following a post-mortem examination.\n\nIn June, a court found plans for the A5 dual carriageway project did not comply with climate change targets.\n\nThe body of a man, aged in his 60s, was found in Drumbawn Close on Sunday.\n\nFunding for Extern's crisis intervention service in Londonderry ran out in June of this year.\n\nThe incident happened outside the County Tyrone town of Strabane on Saturday.\n\nThe successful candidate will replace the outgoing president Michael D Higgins.\n\nPresident Michael D Higgins will step down from the role when his term ends later this year.\n\nIt has been a long time coming, but thousands of NFL fans will witness history when the Pittsburgh Steelers face the Minnesota Vikings in Dublin on Sunday.\n\nJim Gavin says \"vicious\" misinformation posted about him online may be politically motivated.\n\nShe says both have committed war crimes after her previous comments were criticised\n\nWake up to Good Morning Ulster and get all the news and analysis from home and abroad.\n\nBreaking news and hard-hitting talk about the big stories of the day.\n\nHighlights from Talkback. William Crawley and guests discuss the news headlines.\n\nAll the day’s news and analysis with Richard Morgan.\n\nThe latest news for Northern Ireland.\n\nTara Mills and Declan Harvey react and reflect on news stories in a BBC NI podcast.\n\nThe back-stop’s here? Bad puns with top political coverage from BBC Northern Ireland.\n\nHard-hitting investigations on the stories that matter in Northern Ireland.\n\nMark Carruthers provides comment and expert analysis on the week's political news\n\nMark Carruthers with the latest political news, interviews and debate.\n\nThe awards recognise and celebrate members of the public who make life better for others where they live.\n\nEach month 350 families in NI will lose a loved one to cardiovascular conditions, the British Heart Foundations says.\n\nA pilot scheme aimed at restricting pupils from using phones during school hours has been hailed as \"very beneficial\".\n\nThe Acute Mental Health Inpatient Centre on the Belfast City Hospital site was opened six years ago at a cost of £33m.\n\nThe trust's chief executive says a review of what happened is underway.\n\nThe prime minister insists new Troubles legacy protections are for Army veterans but not paramilitaries.\n\nThe Pittsburgh Steelers showdown in Ireland is a homecoming for the Rooneys whose ancestors come from Newry.\n\nDrugs worth £300,000 were found in luggage on a connecting international flight.\n\nSt Ronan's College in Lurgan is one of nine schools to be provided with pouches as part of a new pilot started by the Department of Education.",
  "url": "https://www.bbc.com/news/northern_ireland",
  "scraped_timestamp": "2025-09-26T16:35:53.772876",
  "content_length": 5255,
  "word_count": 870,
  "source_domain": "www.bbc.com"
}