{
  "title": "NewsNews",
  "content": "The outage in Australia has been linked to four deaths as people could not reach emergency services.\n\nAustralian Josh Cavallo, who moved to England in July to join non-league Peterborough Sports, says football has got \"mountains to do\" to tackle homophobia.\n\nThe use of controversial shark nets was about to be scaled back in Sydney when a surfer was killed.\n\nThe \"area of interest\" flagged by a team of volunteers has turned out to be a false alarm.\n\nPolice suspect three-year-old Cheryl Grimmer, originally from Bristol, was taken from a beach in Australia.\n\nAustralian Josh Cavallo, who moved to England in July to join non-league Peterborough Sports, says football has got \"mountains to do\" to tackle homophobia.\n\nErin Patterson was jailed for a minimum of 33 years for murdering three people with a toxic mushroom meal.\n\nExperts say the deal seeks to counter Beijing's growing influence, but PNG says it is not about China.\n\nThe use of controversial shark nets was about to be scaled back in Sydney when a surfer was killed.\n\nAustralia's first National Climate Risk Assessment predicts more frequent and severe climate hazards.\n\nThere are many more species of peacock spider than other animals, scientists think they may know why.\n\nIt has shaken consumer trust and raised questions about global sunscreen regulation.\n\nThe two democratic allies have had a spectacular falling out - but what has actually changed?\n\nWatch: Duck family rescued from busy Australian motorway\n\nIn the wake of a recent fatal shark attack, the BBC is off the coast in Sydney to learn how authorities are trying to protect people.\n\nThe BBC's Katy Watson was in the courtroom as Erin Patterson was sentenced to life.\n\nVideo shows the aircraft flying over the golf course before crash landing, as the pilot and passenger escaped without major injuries.\n\nWatch: Duck family rescued from busy Australian motorway\n\nMarnus Labuschagne further pushes his case for a recall to Australia's Test squad for the Ashes by hitting his third century in four matches for Queensland.\n\nAustralia are yet to make a decision on whether Pat Cummins will feature in the Ashes, amid reports he could miss the series through injury.\n\nErin Patterson was jailed for a minimum of 33 years for murdering three people with a toxic mushroom meal.\n\nIn the wake of a recent fatal shark attack, the BBC is off the coast in Sydney to learn how authorities are trying to protect people.\n\nThe use of controversial shark nets was about to be scaled back in Sydney when a surfer was killed.\n\nBBC Sport assesses Australia's top-order candidates to line up against England in the first Ashes Test in Perth.\n\nPolice suspect three-year-old Cheryl Grimmer, originally from Bristol, was taken from a beach in Australia.\n\nErin Patterson was handed life in prison for murdering three relatives with a toxic mushroom meal.",
  "url": "https://www.bbc.com/news/world/australia",
  "scraped_timestamp": "2025-10-11T23:47:04.811101",
  "content_length": 2854,
  "word_count": 473,
  "source_domain": "www.bbc.com"
}