{
  "title": "NewsNews",
  "content": "The deal was agreed last month but received a mixed reaction from political parties, victims’ groups and veterans.\n\nA new report finds the lack of tree planting is putting climate action, nature recovery and community wellbeing at risk.\n\nThe law will compel schools to explain to parents the reasons for uniform prices and could lead to a price cap.\n\nNorthern Ireland's young squad were down but not out, as Michael O'Neill describes the 1-0 World Cup qualifying defeat by Germany as \"sore\".\n\nThe European Broadcasting Union had previously announced it would hold a vote on Israel's participation in November.\n\nA new report finds the lack of tree planting is putting climate action, nature recovery and community wellbeing at risk.\n\nThe police said they are not treating the death as murder at this time, following a post-mortem examination.\n\nThe insect was captured in the Dundonald area on Friday by a member of the public.\n\nThe law will compel schools to explain to parents the reasons for uniform prices and could lead to a price cap.\n\nA defence barrister set out the details of a no case to answer application, telling the court a conviction would be \"unsafe\".\n\nDunloy is celebrating its first County Antrim senior football championship win in 89 years.\n\nHeather Humphreys, one of two people vying to be Ireland's next president, says she's \"well placed\" to speak to unionists.\n\nFrank Cushnahan is one of two men facing fraud charges linked to a £1.1bn property deal.\n\nBBC News NI has visited three towns, where locals say high rates, fast trains and derelict buidings are causing problems.\n\nThe final of BBC Young Chorister Of The Year 2025 aired on Sunday afternoon, with one Belfast hopeful bidding for the prize.\n\nThanks to a now defunct eligibility rule, Germany-born goalkeeper Maik Taylor became the most unlikely of Northern Ireland heroes.\n\nJim Gavin had been chosen to represent Fianna Fáil, the Republic of Ireland's biggest party in the coalition government\n\nOne of Northern Ireland's rarest native mammals have been turning up in some unusual places.\n\nDepartment for Infrastructure officials met residents affected by severe flooding in 2017.\n\nThe non-jury trial is taking place at Belfast Crown Court with the former soldier accused of two murders and five attempted murders.\n\nCordons remain in place after a section of the former convent on Pump Street in Derry collapsed at the weekend.\n\nThe assault and other offences took place in Altnagelvin hospital in Derry in March.\n\nA round-up of local news, sport and weather across the north west of Northern Ireland.\n\nA man in his 50s was arrested and remains detained in Garda custody.\n\nThe incident on Abbey Street was said to have happened on Saturday, as  supporters marched through the city centre.\n\nEvan Moore, who is 20, was sentenced to four years in prison with the final 12 months suspended.\n\nCitizens in Northern Ireland will not get a say in who is elected as you need an address in the Republic of Ireland to vote.\n\nMohammed Al Shaker Al Tamimi also admitted the attempted murder of the girl's mother Aisha Noor Al Kattib.\n\nWake up to Good Morning Ulster and get all the news and analysis from home and abroad.\n\nBreaking news and hard-hitting talk about the big stories of the day.\n\nHighlights from Talkback. William Crawley and guests discuss the news headlines.\n\nAll the day’s news and analysis with Richard Morgan.\n\nThe latest news for Northern Ireland.\n\nTara Mills and Declan Harvey react and reflect on news stories in a BBC NI podcast.\n\nThe back-stop’s here? Bad puns with top political coverage from BBC Northern Ireland.\n\nHard-hitting investigations on the stories that matter in Northern Ireland.\n\nMark Carruthers provides comment and expert analysis on the week's political news\n\nMark Carruthers with the latest political news, interviews and debate.\n\nA new report finds the lack of tree planting is putting climate action, nature recovery and community wellbeing at risk.\n\nThe police said they are not treating the death as murder at this time, following a post-mortem examination.\n\nThe insect was captured in the Dundonald area on Friday by a member of the public.\n\nA temporary barrier was erected in January 2023 after an elderly woman suffered facial injuries in a fall.\n\nThe law will compel schools to explain to parents the reasons for uniform prices and could lead to a price cap.\n\nFrank Cushnahan is one of two men facing fraud charges linked to a £1.1bn property deal.\n\nA defence barrister set out the details of a no case to answer application, telling the court a conviction would be \"unsafe\".\n\nDunloy is celebrating its first County Antrim senior football championship win in 89 years.\n\nClosing sale signs and boarded up windows have become regular fixtures on Northern Ireland's high streets in recent years.",
  "url": "https://www.bbc.com/news/northern_ireland",
  "scraped_timestamp": "2025-10-14T14:42:50.358323",
  "content_length": 4809,
  "word_count": 797,
  "source_domain": "www.bbc.com"
}