{
  "title": "NewsNews",
  "content": "The prime minister says progressive politicians have been \"squeamish\" to address illegal migration and say things that are \"clearly true\".\n\nThe scheme will make it tougher to work in the UK illegally and offer \"countless benefits\" to citizens, PM says.\n\nSir Keir Starmer's comments follow criticism of his leadership from the Mayor of Manchester.\n\nThe former prime minister has been in high-level planning talks over the territory's future, the BBC understands.\n\nThe MP for East Wiltshire was responding to concerns about scrapping indefinite leave to remain.\n\nThe scheme will make it tougher to work in the UK illegally and offer \"countless benefits\" to citizens, PM says.\n\nSir Menzies led the Liberal Democrats from 2006 to 2007 and was the MP for North East Fife at Westminster for 28 years.\n\nAndy Burnham's recent remarks seem to have narked the prime minister, our political editor writes.\n\nSir Keir Starmer's comments follow criticism of his leadership from the Mayor of Manchester.\n\nWatch live as Housing Secretary Steve Reed takes part in a series of quickfire interviews.\n\nHarriet Green, founder of Basis Capital, is working with the party's cost-cutting unit Doge.\n\nThe majority of Labour MPs contacted by the BBC say they are against Andy Burnham challenging Keir Starmer.\n\nSir Keir Starmer says he stands with mayor Sir Sadiq Khan, after Donald Trump's statement to the UN.\n\nOn economic and immigration issues, many international leaders are trying to work out how to combat the rise of the populist right.\n\nThe Manchester mayor's comments ahead of Labour's annual conference are a clear sign of his leadership ambitions.\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nThe party is taking on Nigel Farage in a way Labour and the Tories either can't or won't, our political editor writes.\n\nUnder the plans, migrants would need to reapply for new visas with tougher rules.\n\nThe PM had signalled a shift in policy unless Israel took steps including agreeing to a ceasefire in Gaza.\n\nAndy Burnham's recent remarks seem to have narked the prime minister, our political editor writes.\n\nThe party is taking on Nigel Farage in a way Labour and the Tories either can't or won't, our political editor writes.\n\nTrump's disagreements with Sir Keir were somehow channelled past him, rather than at him, writes the BBC's political editor.\n\nThe government will hope for a reprieve from questions about Peter Mandelson, says the BBC's political editor.\n\nThe BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nMonths of preparations have gone into this state visit - but the Lord Mandelson question is not the only concern troubling insiders.\n\nThe start of this political season has been wild, writes Laura Kuenssberg, and Labour now has Reform UK breathing down its neck.\n\nSome say Britain's decision is an important first step – while others worry it won't make a real difference, writes BBC's International Editor Jeremy Bowen.\n\nIt's been a week of dismissals, disagreements and backbench bust-ups, writes Laura Kuenssberg.\n\nGreater Manchester's mayor answers questions on his comments about he Labour leadership.\n\nAndy Burnham is asked about his interview in the Daily Telegraph, in which he said Labour MPs were asking him privately to challenge the prime minister.\n\nBurnham said the Labour government needed a \"proper plan for the country\", including one to beat Reform UK.\n\nWhy understanding zero-sum thinking can help explain modern politics and attitudes.",
  "url": "https://www.bbc.com/news/politics",
  "scraped_timestamp": "2025-09-26T16:18:43.918585",
  "content_length": 3687,
  "word_count": 599,
  "source_domain": "www.bbc.com"
}