{
  "title": "NewsNews",
  "content": "A shaken sheriff said that a teacher, a neighbour and one of his best friends were among the victims who died in the blast.\n\nThe cost of health insurance could double for millions of people, which could hurt Republicans.\n\nThe children in South Carolina were unvaccinated, as were many of the 1,563 people infected in the US this year.\n\nThe US president says the ceasefire will hold and the second phase of negotiations for a lasting peace are under way.\n\nThe Canadian prime minister had a light-hearted exchange with the US president after he misspoke at the 'Summit for Peace'.\n\nThe cost of health insurance could double for millions of people, which could hurt Republicans.\n\nCustomers worry about missing parcels as shipping companies struggle to handle a flood of packages facing new customs and tariff rules.\n\nThe BBC’s Michelle Fleury looks at what to expect from the gathering of top bankers and finance ministers.\n\nThe children in South Carolina were unvaccinated, as were many of the 1,563 people infected in the US this year.\n\nWhen I went this weekend to take the oath to become an American citizen, I enountered disorder, and disappointment.\n\nThe pair worked together on eight films including the Oscar-winning Annie Hall and Manhattan.\n\nThe cyclone, whose name is derived from the direction the winds blow in the Atlantic Ocean, also hit the coast with strong winds.\n\nCanada's foreign minister visits Delhi as the sides restore ties strained by a murder on Canadian soil.\n\nAs politicians in Washington bicker during the government shutdown,  Martinsburg, West Virginia, worries about what's next.\n\nThe US president was speaking at the Israeli parliament after the release of all 20 living hostages from Gaza.\n\nThe cyclone, whose name is derived from the direction the winds blow in the Atlantic Ocean, also hit the coast with strong winds.\n\nAuthorities have confirmed that 16 people were killed when an explosives plant in rural Tennessee exploded on Friday morning.\n\nThe missing Nasa research-probe had blown off course and crash-landed in Edmonson on 2 October.\n\nVideo from the site of an explosives manufacturer shows buildings flattened and destroyed vehicles.\n\nThe political tug-of-war over redrawing political maps intensifies, with both Republicans and Democrats seeking advantage ahead of the 2026 midterms.\n\nAuthorities say the 16 people missing after the explosives factory incident are all presumed dead.\n\nAfter years of controversy and financial struggles, Marineland says it may have to euthanise 30 whales if it cannot find them another home.\n\nSome are worried that the rapid rise in the value of AI tech companies may be a bubble waiting to burst.\n\nMaría Corina Machado tells Trump of her appreciation for \"what he's doing... around the world for peace\".\n\nThe rocket launched from Starbase, Texas and flew for more than an hour before splash landing into the Indian Ocean.\n\nA shaken sheriff said that a teacher, a neighbour and one of his best friends were among the victims who died in the blast.\n\nThe BBC’s Michelle Fleury looks at what to expect from the gathering of top bankers and finance ministers.\n\nThe political tug-of-war over redrawing political maps intensifies, with both Republicans and Democrats seeking advantage ahead of the 2026 midterms.\n\nThe cost of health insurance could double for millions of people, which could hurt Republicans.\n\nThe cyclone, whose name is derived from the direction the winds blow in the Atlantic Ocean, also hit the coast with strong winds.\n\nThe Canadian prime minister had a light-hearted exchange with the US president after he misspoke at the 'Summit for Peace'.\n\nWhen I went this weekend to take the oath to become an American citizen, I enountered disorder, and disappointment.\n\nThe children in South Carolina were unvaccinated, as were many of the 1,563 people infected in the US this year.",
  "url": "https://www.bbc.com/news/us-canada",
  "scraped_timestamp": "2025-10-14T15:12:06.604832",
  "content_length": 3866,
  "word_count": 628,
  "source_domain": "www.bbc.com"
}