{
  "title": "NewsNews",
  "content": "People living in a Chicago apartment block targeted in a big immigration raid have described seeing armed agents and a helicopter landing on the roof.\n\nTwo years after the 7 October attacks, dozens of hostages remain in Hamas captivity. BBC Verify has been examining what we know about them.\n\nThe US government and law enforcement agencies have hit out at developers and users of the apps, saying they pose a risk to agents.\n\nAmid the blame game over the shutdown, Republicans claim Democrats want free healthcare for illegal immigrants - the Democrats call this a lie\n\nUkraine has attacked refineries deep inside Russia, with Zelensky vowing to continue the strikes.\n\nTwo years after the 7 October attacks, dozens of hostages remain in Hamas captivity. BBC Verify has been examining what we know about them.\n\nUkraine has attacked refineries deep inside Russia, with Zelensky vowing to continue the strikes.\n\nHamas-linked social media channels say \"three collaborators who were spying for the occupation\" were executed.\n\nNew footage has revealed that two more strikes were carried out on hospital by Israel than initially reported.\n\nBBC Verify finds 10 occasions where aid was dropped into an area Israel has warned people not to enter, saying it would put their lives at risk.\n\nMissile and drone attacks on Ukraine are now at their highest, despite Trump's promise to end the war.\n\nSatellite images show massive amounts of destruction in areas Israel's military claims to have under \"operational control\".\n\nLatest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.\n\nLatest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.\n\nLatest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.\n\nLatest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.\n\nLatest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.\n\nA BBC Verify investigation has revealed that the identities of British public sector workers have been cloned using AI by a Russian-linked disinformation campaign.\n\nFake AI videos relating to the conflict have gained over 100 million views online, BBC Verify finds.\n\nBBC Verify has debunked videos which purport to show Pakistani attacks on Indian bases and jets crashing.\n\nBBC Verify: Earthquake video proven fake gets millions of views\n\nA clip of Donald Trump Jr allegedly saying on his podcast that the US should have sent arms to Russia rather than Ukraine was very likely generated with AI, experts say.\n\nThe BBC's analysis editor looks at a decision that leading Democrats have called \"an abuse of power\".\n\nBBC Verify asked experts, in the UK and elsewhere, if Israel’s actions in Gaza have been proportionate.\n\nIsrael's Prime Minister has long warned that Iran is close to developing nuclear weapons. BBC Verify's Ros Atkins explains what we know about its programme.\n\nRos Atkins looks at the reasons behind the government's investment in nuclear power, and how its plan fits into the UK’s energy mix.\n\nThe US government and law enforcement agencies have hit out at developers and users of the apps, saying they pose a risk to agents.\n\nExperts have hit back at claims that use of a common painkiller could cause autism in children.\n\nPresident Trump has signed an executive order designating Antifa as a domestic terror group, but legal experts have questioned how this will work.\n\nAn image of a \"birthday letter\" to Jeffrey Epstein, allegedly signed by Donald Trump, has been released - but the White House says it is a fake.\n\nNearly 500 workers - most of them South Korean nationals - were seized in an immigration raid on a large Korean car plant in the US state of Georgia.\n\nKeir Starmer has linked the rise in small boat arrivals to Brexit, describing the crossings as \"Farage boats\".\n\nThe party has pledged to boost spending, but some have questioned how the party intends to pay for its plans.\n\nThe UK suspended dozens of arms licences to Israel last year, but many say the measures do not go far enough.\n\nTech companies are restricting debates of public interest to comply the Online Safety Act, analysis shows.\n\nThe government has confirmed details of its scaled-back plan to reform some benefits.\n\nPresident Trump has signed an executive order designating Antifa as a domestic terror group, but legal experts have questioned how this will work.\n\nTwo years after the 7 October attacks, dozens of hostages remain in Hamas captivity. BBC Verify has been examining what we know about them.\n\nExperts have hit back at claims that use of a common painkiller could cause autism in children.\n\nThe BBC's analysis editor looks at a decision that leading Democrats have called \"an abuse of power\".\n\nPlanning approvals for new homes were at their lowest on record during Labour’s first year in office, figures show\n\nHow many new homes have been added in your area and what is the government's target?\n\nBBC Verify examines key areas which the government has promised to make improvements\n\nFind out how many new homes were registered where you live during Labour’s first year in government\n\nDonald Trump has struck an agreement with the European Union to reduce tariffs - what will that mean for the UK?",
  "url": "https://www.bbc.com/news/bbcverify",
  "scraped_timestamp": "2025-10-14T14:32:15.785838",
  "content_length": 5342,
  "word_count": 864,
  "source_domain": "www.bbc.com"
}