{
  "title": "NewsNews",
  "content": "A rally in Tel Aviv has gathered crowds chanting 'thank you Trump' as they call for the release of hostages.\n\nA ceasefire deal should see Hamas hand over all 48 remaining Israeli and foreign hostages, 20 of whom are believed to be alive.\n\nIsraeli troops have pulled back from parts of Gaza after Israel approved Donald Trump's ceasefire and hostage release plan.\n\nFor the first time since the Hamas attacks on Israel two years ago, there is a realistic chance of ending the horrors\n\nThe facility in Idaho will be used to train Qatari pilots to fly F-15 fighter jets, the US defence secretary says.\n\nA ceasefire deal should see Hamas hand over all 48 remaining Israeli and foreign hostages, 20 of whom are believed to be alive.\n\nAlaa Abdel Fattah tells the BBC's Today programme about life after a decade in prison.\n\nThe US will establish a multinational force in Israel, likely to include troops from Egypt, Qatar, Turkey and the UAE, officials say.\n\nIsraeli troops have pulled back from parts of Gaza after Israel approved Donald Trump's ceasefire and hostage release plan.\n\nThe agreement of the first-phase of the peace plan for Gaza, announced by US President Donald Trump, is a big moment.\n\nTrump's unique style and his relationships with key players helped but there were also factors beyond his control.\n\nWorld leaders, and people in Gaza and Israel have welcomed the tentative deal between Israel and Hamas.\n\nThe deal will see the release of hostages held in Gaza in exchange for Palestinian prisoners and raises hopes for peace after two years of war.\n\nSanaa el-Azab is one of 58 people who have been evacuated from Gaza to study at universities in the UK on scholarships.\n\nPalestinians have been reflecting on the toll on their lives since Hamas's attack on Israel on 7 October 2023, which triggered the war.\n\nA-listers including Dave Chappelle, Bill Burr and Jack Whitehall have faced a backlash over the event.\n\nFamilies describe a \"fragile situation\", with negotiations between Israel and Hamas expected to resume.\n\nThe order vows to use the US military, if necessary, to defend the tiny energy-rich nation almost mirrors aspects of a Nato alliance.\n\nEli Sharabi reflects on finding out, after release, his wife and children had been killed in the attacks.\n\nThe BBC's Anthony Zurcher breaks down how the US president's connections have brought about a breakthrough moment for the Middle East.\n\nPalestinians celebrate on the streets of Khan Younis after the first phase of a Gaza peace deal was agreed.\n\nRelatives of Israeli hostages celebrated in Tel Aviv after the announcement that Israel and Hamas had signed the first phase of a peace deal.\n\nTwo years after the 7 October attacks, dozens of hostages remain in Hamas captivity. BBC Verify has been examining what we know about them.\n\nThe BBC's Middle East Correspondent Yolande Knell and Gaza Correspondent Rushdi Abualouf talk about their memories of 7 October.\n\nClashes have already taken place between the group and an armed clan in Gaza City.\n\nIt is unclear if disagreement over the list of Palestinian prisoners will affect the release of hostages within the agreed 72 hours.\n\nIsraeli troops have pulled back from parts of Gaza after Israel approved Donald Trump's ceasefire and hostage release plan.\n\nThousands of displaced Palestinians are making their way to their homes in the north of the territory.\n\nThe text of the agreement lacks details and in some cases is vague and ambiguous - perhaps on purpose.\n\nThose returning say they are driven by desperation rather than confidence that it is safe.\n\nA ceasefire deal should see Hamas hand over all 48 remaining Israeli and foreign hostages, 20 of whom are believed to be alive.\n\nHamas attacked Israel on 7 October 2023, killing about 1,200 people and taking 251 hostages.\n\nThe conflict between Israel and the Palestinian people is one of the longest-running in the world.",
  "url": "https://www.bbc.com/news/world/middle_east",
  "scraped_timestamp": "2025-10-11T23:46:52.768100",
  "content_length": 3893,
  "word_count": 650,
  "source_domain": "www.bbc.com"
}