{
  "title": "NewsNews",
  "content": "The prime minister denies he has ruined Anas Sarwar's chances of becoming the next first minister.\n\nForensic officers have been sent to the scene in the Castlemilk area of Glasgow.\n\nFamily and friends have launched a crowdfunder to repatriate the body of June Bunyan from Arran.\n\nThe collision happened on the A803 near Linlithgow Bridge at about 20:35 on Friday.\n\nThe tree defeated nine other contenders in a public vote to win the annual prize.\n\nForensic officers have been sent to the scene in the Castlemilk area of Glasgow.\n\nThe closures include four in the Highlands - Nairn, Dingwall, Gairloch and Tain.\n\nListen to Sportsound commentary from Ibrox and follow live text updates as Rangers host Genk in their opening Europa League game.\n\nFamily and friends have launched a crowdfunder to repatriate the body of June Bunyan from Arran.\n\nCentral midfielder Brooke Paterson spent five hours lying on a cold, damp pitch in Cumbernauld waiting for an ambulance.\n\nThe prime minister believes a new scheme would help crack down on illegal working in the UK.\n\nSam Kelly appeared at Kilmarnock Sheriff Court on Thursday facing a single charge of murder.\n\nThe statue will recognise the achievements of pioneering Edinburgh doctor Dr Elsie Inglis\n\nGlasgow City Council says it needs to ensure viewable content is \"age and stage appropriate.\"\n\nAnd can Keir Starmer fight back?\n\nResidents scrutinise long-awaited plans to bypass two villages on the busy A75 in southern Scotland.\n\nHighland woman Eve Graham endured physical, mental and financial abuse during her long marriage.\n\nThe Shout singer discloses her alcohol problem - and the family history that contributed to it.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nSpecialists advise Fife Council the cinema is in a dangerous condition and demolition is the safest solution.\n\nThe closures include four in the Highlands - Nairn, Dingwall, Gairloch and Tain.\n\nThe Scottish broadcaster is seeking £2.5m of savings by next year after announcing a £0.2m loss.\n\nA council hears calls for stronger action over the self-styled Kingdom of Kubala near Jedburgh.\n\nSir Anton Muscatelli calls for a review of the future funding and shape of higher education.\n\nListen to Sportsound commentary from Ibrox and follow live text updates as Rangers host Genk in their opening Europa League game.\n\nWithout a league win and humiliated in Europe - why has Russell Martin's style not worked at Rangers and has he shown signs of changing?\n\nBrendan Rodgers said fans need to have realism after Celtic's 1-1 draw in Belgrade to open their Europa League campaign.\n\nCentral midfielder Brooke Paterson spent five hours lying on a cold, damp pitch in Cumbernauld waiting for an ambulance.\n\nBig stories from across the country\n\nThe BBC's Scottish news podcast.\n\nMore from the day’s top stories and communities across Scotland.\n\nThe nation's morning news programme.\n\nThe Scottish broadcaster is seeking £2.5m of savings by next year after announcing a £0.2m loss.\n\nThe closures include four in the Highlands - Nairn, Dingwall, Gairloch and Tain.\n\nCentral midfielder Brooke Paterson spent five hours lying on a cold, damp pitch in Cumbernauld waiting for an ambulance.\n\nThe American who faked his death and fled to Scotland to escape justice was convicted by a Utah jury.\n\nA review of the front page stories from the daily newspapers in Scotland.\n\nScottish ministers have approved a new by-law for the UK's largest national park to reduce the risk of wildfires.\n\nSir Anton Muscatelli calls for a review of the future funding and shape of higher education.\n\nIain Sinclair completed the challenge in memory of Jenny Hastings, the wife of his former teammate Scott.\n\nResidents scrutinise long-awaited plans to bypass two villages on the busy A75 in southern Scotland.",
  "url": "https://www.bbc.com/news/scotland",
  "scraped_timestamp": "2025-09-26T00:57:01.989086",
  "content_length": 3828,
  "word_count": 619,
  "source_domain": "www.bbc.com"
}