{
  "title": "NewsNews",
  "content": "The US president suggests the US could lift sanctions on Turkey and allow it to buy F-35 jets.\n\nRoughly 35 million people in the US could be eligible for refunds, according to the government.\n\nNearly $1 million worth of merchandise was stolen by about 25 people, according to police.\n\nPhysicians worry pregnant women may forgo a treatment over an unproven link between Tylenol and autism.\n\nThe warning came after Trump refused a meeting with Democrats seeking healthcare funding in budget negotiations.\n\nRoughly 35 million people in the US could be eligible for refunds, according to the government.\n\nThe gunman fired at an unmarked van near the detention facility, before taking his own life, officials say.\n\nGustavo Petro told the BBC that \"there is no need to kill anyone\" in efforts to crackdown on maritime drug smuggling.\n\nNearly $1 million worth of merchandise was stolen by about 25 people, according to police.\n\nUS officials have blamed Canada for not doing enough to stop its wildfire smoke from wafting south. Climate experts say it’s not so simple.\n\nThe Turkish president is in Washington and seeking deals on defence and energy worth tens of billions of US dollars.\n\nThe actor plays a school bus driver trapped in US wildfires, appearing with his real mother and son.\n\nThe US president called the incidents that included an escalator and teleprompter mishap \"a real disgrace\".\n\nStartups and smaller firms could bear the brunt of Trump's new H-1B visa fee, and some fear it could thwart US innovation.\n\nPresident Donald Trump has previously claimed Biden used an autopen to sign important documents, including pardons.\n\nMacron and Trump were in New York for the 80th UN General Assembly\n\nSuccess gets winners a spot on the champion's wall at Katmai National Park in Alaska, but also improves their survival chances this winter.\n\nIn a wide-ranging speech, President Trump slammed the world body and singled out many of the countries in attendance.\n\nThe five-hour service saw top officials from the Trump administration pay tribute to the conservative activist.\n\nAstronauts of Nasa's first crewed mission to the Moon for more than 50 years hope their journey inspires a new generation.\n\nThe US talk show host isn't backing down after being suspended; it seems to have hardened his resolve.\n\nThe US leader's address was one of the clearest expositions of the way he sees the world, writes James Landale.\n\nThe US visa shake-up could push talent north — but experts caution that Canada’s immigration system has its own challenges.\n\nCombs' lawyers argue he was unjustly convicted under a federal law that was passed to combat human trafficking.\n\nRoughly 35 million people in the US could be eligible for refunds, according to the government.\n\nNearly $1 million worth of merchandise was stolen by about 25 people, according to police.\n\nThe gunman fired at an unmarked van near the detention facility, before taking his own life, officials say.\n\nThe warning came after Trump refused a meeting with Democrats seeking healthcare funding in budget negotiations.\n\nThe US president called the incidents that included an escalator and teleprompter mishap \"a real disgrace\".\n\nIt is the latest development in a case that has garnered international attention, including from senior White House officials.\n\nUS officials have blamed Canada for not doing enough to stop its wildfire smoke from wafting south. Climate experts say it’s not so simple.\n\nStartups and smaller firms could bear the brunt of Trump's new H-1B visa fee, and some fear it could thwart US innovation.",
  "url": "https://www.bbc.com/news/us-canada",
  "scraped_timestamp": "2025-09-26T00:24:53.215925",
  "content_length": 3564,
  "word_count": 581,
  "source_domain": "www.bbc.com"
}