{
  "title": "NewsNews",
  "content": "Julia Wandelt and Karen Spragg deny stalking Kate and Gerry McCann over several years.\n\nThe jury in the trial of Deng Majek is shown CCTV and told he carried out a \"vicious and frenzied attack\".\n\nFives vehicles parked outside houses in Barmouth Drive were destroyed in a suspected arson attack.\n\nResidents were offered thousands to sell their land and withdraw previous objections to the project.\n\nButtons, Bueno, Yorkie and Malteser were among 455 animals seized from a Skegby farm.\n\nThe jury in the trial of Deng Majek is shown CCTV and told he carried out a \"vicious and frenzied attack\".\n\nYoni Findlay, hit by a police bullet as officers responded to the attack, is released from hospital.\n\nTesco has told customers affected by a petrol station fuel pump mix-up to get in touch.\n\nFives vehicles parked outside houses in Barmouth Drive were destroyed in a suspected arson attack.\n\nA spokesperson for the nursery says an employee is suspended and police are investigating.\n\nThe undercover policing inquiry heard the Met began surveillance of the Lawrences after their son's murder.\n\nKae Burnell-Chambers said she needed a stick to walk, but was seen attending body painting events.\n\nTony Caunter, who played Roy Evans in the BBC soap, died in Eastbourne on Monday, his family says.\n\nThe British Museum hopes to secure the pendant, found by a metal detectorist in Warwickshire.\n\nBen Hatcher is pulled on to the stage by his childhood idol during her concert in Sheffield.\n\nWoman praises \"absolute heroes\" at Guernsey Waste for hunting for her missing rings.\n\nAmy Sharp's Alaskan Malamute Mal is more than twice the average size of a dog of his breed.\n\nSix months on from the government taking control of Scunthorpe's steelworks, what is the mood?\n\nNadia Yahlom says she had the \"right to take a stance about genocide\" by removing ribbons.\n\nDominic Robinson says he discovered crockery on the wreck below the surface of the Celtic Sea.\n\nA UK firm says other sellers are lifting its photos of steel ornaments to sell similar products.\n\nTests show a road surface enhanced with graphene is outperforming regular asphalt.\n\nThe 125m (137yd) tunnel is launched 19 months ago and arrives in Birmingham in October.\n\nA \"scream club\" hosted its first London event at Primrose Hill last weekend.\n\nThree women from the South are hoping to highlight important causes as part of the competition.\n\nPolice footage shows the suspects get caught by a stinger, pile out of the car and run off.\n\nA \"scream club\" hosted its first London event at Primrose Hill last weekend.\n\nPolice footage shows the suspects get caught by a stinger, pile out of the car and run off.\n\nFormer England bowler Stuart Broad believes Australia have their \"worst\" team since 2010 heading into this winter's Ashes.\n\nKevin de Bruyne is in sparkling form for Napoli and Belgium this season - did he leave Man City too soon?\n\nThe spotlight is on Beau Greaves after her landmark win over Luke Littler on Monday, but who is the 21-year-old from Doncaster?\n\nBritain's Emma Raducanu struggles physically in a three-set loss to world number 219 Zhu Lin in the Ningbo Open first round.\n\nSome parents say help is not available quickly enough to deal with violence from their children.\n\nCorsham in Wiltshire has been transformed for the filming of the latest series.\n\nA parliamentary inquiry will look at reflective \"ghost\" plates, which cannot be read by cameras.\n\nNew information screens and USB sockets are added to more than 1,000 carriages.\n\nNational Highways says emergency resurfacing works have now been completed following a vehicle fire.\n\nThe club has announced a rugby league development agreement with North Lincolnshire Council.\n\nPatients say they could have lived normal lives if they had been tested sooner.\n\nActor Stephen Finegold says his career 'stood him in good stead' to work as a magistrate.\n\nButtons, Bueno, Yorkie and Malteser were among 455 animals seized from a Skegby farm.",
  "url": "https://www.bbc.com/news/england",
  "scraped_timestamp": "2025-10-15T10:06:31.764733",
  "content_length": 3944,
  "word_count": 654,
  "source_domain": "www.bbc.com"
}