{
  "title": "NewsNews",
  "content": "Watkins was serving a 29-year sentence imposed in 2013 after admitting 13 child sex offences.\n\nThe demonstration comes a day after a ceasefire between Israel and Hamas took effect in Gaza.\n\nJanet Skinner says she has been offered an interim compensation payment, meaning she can buy a home.\n\nFamilies affected by the toxic waste scandal are calling for a public inquiry and full apology.\n\nA German couple are trying to find the writer after they found the bottle on a beach in Denmark.\n\nThe demonstration comes a day after a ceasefire between Israel and Hamas took effect in Gaza.\n\nTwelve members of a gang behind a £900,000 cocaine supply are jailed for drugs and guns offences.\n\nThe orange and yellow designs painted on a road in Birkenhead have been met with outcry.\n\nJanet Skinner says she has been offered an interim compensation payment, meaning she can buy a home.\n\nOfficers were called to an address in Walthamstow to reports of a man with a firearm.\n\nPolice find 1,000 parts at the home of Konrad Labinksi, who admits theft by employee.\n\nIt \"beggars belief\" anyone would target a rescue helicopter, the RNLI says.\n\nA fan says airports have been named after John Lennon and George Best, so why not Ozzy Osbourne?\n\nQuaker, 15, was one of five Household Cavalry horses spooked while on an exercise in Belgravia.\n\nNine-year-old Flash, who had been overlooked at a rescue centre, now lives in Blaydon.\n\nJane Bean, from Kent, and Debbie Houschild, from New Jersey, say they have always stayed in contact.\n\nThe army veteran has sailed a total of 500 miles (804km) in the boat to raise money for charity.\n\nPoliticians are at odds on whether Warwickshire should be split to form north and south authorities.\n\nThe colourful banners can be seen around north-east England, but why and what do they represent?\n\nThe estate hit the headlines for social unrest in 1985 but since then locals say it's transformed.\n\nFollowing an arduous rescue of three cavers in Yorkshire, the BBC explores the world of caving.\n\nThe model and actor describes her experience on the BBC show so far as \"10 out of 10\".\n\nDave Harvey checks out why a supposedly Bristol-based site is actually Chinese.\n\nMartin Withers from Manchester paints bollards to look like Minions from the Despicable Me films.\n\nHull has one of Europe's largest travelling fairs - and rides have been arriving from around the UK.\n\nChildren can be seen screaming with joy as the breakfast treats cascade down the school corridor.\n\nDawlish Waterfowl Centre says Reggie has \"settled in very well\" and already found a mate.\n\nMartin Withers from Manchester paints bollards to look like Minions from the Despicable Me films.\n\nDawlish Waterfowl Centre says Reggie has \"settled in very well\" and already found a mate.\n\nFollow BBC Radio 5 Live commentary, live text & score updates as Hull KR take on Wigan Warriors in the Super League Grand Final.\n\nNat Sciver-Brunt's sparkling 117 and Sophie Ecclestone's four wickets ensure England remain unbeaten in the Women's World Cup as they thrash Sri Lanka by 89 runs in Colombo.\n\nFollow build-up, live text and score updates as it happens across 18 matches in League One and League Two.\n\nNorthampton Saints overpower rivals Leicester Tigers in the second half to close out a 32-26 win in a frenetic Prem contest at Franklin's Gardens.\n\nA \"chief leaf peeper\" says trees have been \"revived\" by the weather in recent months.\n\nThe school says the development will maximise its potential to generate zero-carbon electricity.\n\nPrince William asks Baton of Hope campaign to join his National Suicide Prevention Network.\n\nThe need for affordable housing for young staff is an urgent priority, East Cambs Council hears.\n\nRail lines are reopened at a major junction after cables were stolen, a train operator says.\n\nA meeting will discuss how to tackle what organisers say is a growing inequality in HIV prevention.\n\nActor Steve Evets says it is \"the end of an era\" as the final series of Brassic hits the small screen.\n\nNine-year-old Flash, who had been overlooked at a rescue centre, now lives in Blaydon.\n\nThe Duchess of York in Leeds was once the place to play for bands on the verge of stardom.",
  "url": "https://www.bbc.com/news/england",
  "scraped_timestamp": "2025-10-11T23:47:00.353043",
  "content_length": 4168,
  "word_count": 705,
  "source_domain": "www.bbc.com"
}