{
  "title": "NewsNews",
  "content": "Harjit Kaur, 73, had lived in the US for over 30 years before being deported to India.\n\nInspector Zende tells the story of an Indian police officer who captured notorious killer Charles Sobhraj twice.\n\nIndia, Qatari royals, China and ecologists have their own, very different, views on Assumption Island's future.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nInspector Zende tells the story of an Indian police officer who captured notorious killer Charles Sobhraj twice.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nPakistan set up an Asia Cup final showdown with India after successfully defending 136 to beat Bangladesh by 11 runs.\n\nIndia, Qatari royals, China and ecologists have their own, very different, views on Assumption Island's future.\n\nKaran Johar, Aishwarya Rai, Abhishek Bachchan and others have gone to court to protect their personality rights.\n\nA Pakistan-Saudi defence agreement pledging a mutual response to any aggression raises concerns in India.\n\nLower consumer taxes are expected to ease some of the impact of Trump's 50% tariffs on India.\n\nIndia may adapt, but the US risks losing skilled workers who have helped build the Silicon Valley and hospitals.\n\nSongs of Forgotten Trees, which won the Orizzonti Award at Venice, marks the first such win by an Indian director.\n\nSeveral neighbourhoods in Kolkata have been inundated, with water entering people's homes.\n\nRescue efforts are under way after the Himalayan region was hit by torrential downpour.\n\nThe Chinese, Indian and Russian leaders were among those attending a regional security summit in China over the weekend.\n\nRussian President Vladimir Putin and Indian Prime Minister Narendra Modi are among the 20 world leaders attending a regional security summit in China.\n\nAt least 30 people have died since Tuesday, as flash floods swept away roads and submerged homes.\n\nHarjit Kaur, 73, had lived in the US for over 30 years before being deported to India.\n\nInspector Zende tells the story of an Indian police officer who captured notorious killer Charles Sobhraj twice.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nOpener Abhishek Sharma scores a half-century and Kuldeep Yadav takes three wickets as defending champions India beat Bangladesh in Dubai\n\nBahison Ravindran thought he was an Indian by birth - until police declared his passport invalid.\n\nAt least 10 people have died, most from electrocution, following the record-breaking downpour.\n\nKaran Johar, Aishwarya Rai, Abhishek Bachchan and others have gone to court to protect their personality rights.",
  "url": "https://www.bbc.com/news/world/asia/india",
  "scraped_timestamp": "2025-09-26T17:24:21.802851",
  "content_length": 3056,
  "word_count": 488,
  "source_domain": "www.bbc.com"
}