{
  "title": "NewsNews",
  "content": "The dead have been burned beyond recognition and officials have warned that the toll could rise.\n\nFisher says his visa is \"legit\" but that authorities were unhappy he would be working while in the country.\n\nMasanori Aoki stabbed two women in Nakano city before shooting two policemen with a hunting rifle.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nFisher says his visa is \"legit\" but that authorities were unhappy he would be working while in the country.\n\nMuskan Sharma, who won the Miss Rishikesh contest, said it made her feel like Miss Universe.\n\nBipin Joshi tried to save fellow Nepalese students before being taken hostage, his mourning friend tells the BBC.\n\nMasanori Aoki stabbed two women in Nakano city before shooting two policemen with a hunting rifle.\n\nThe attacks came days after Pakistan was accused of bombing a market inside Afghanistan.\n\nThe co-directors of Netflix's most watched film ever say \"there's more we can do with these characters\"\n\nThe mother and calf were spotted in late September, with the young dolphin’s swimming ability noticeably impeded by a fishing line caught around its tail.\n\nBeijing says it could introduce \"countermeasures\" if the US President imposes an an additional 100% tariff on Chinese imports.\n\nUnpredictable, intense and longer monsoons are encroaching into autumn, turning it into a deadly season.\n\nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.\n\nSmaller Indian towns are becoming centres for training and correcting artificial intelligence models.\n\nThe maker of Japan's most popular beer, Super Dry, was hit by a major cyber-attack last month.\n\nThe South Asian art market has raked in millions in recent months, even as global art sales slump.\n\nBoth the Tories and Liberal Democrats are calling on the government to publish evidence it submitted in the now-collapsed case.\n\nThe dead have been burned beyond recognition and officials have warned that the toll could rise.\n\nMuskan Sharma, who won the Miss Rishikesh contest, said it made her feel like Miss Universe.\n\nThis is Google’s biggest investment outside the US , the firm's top executive says.\n\nMasanori Aoki stabbed two women in Nakano city before shooting two policemen with a hunting rifle.\n\nThousands had earlier in August protested against an increase in housing allowances for MPs.\n\nIndia’s sunshine hours have fallen over the past 30 years due to clouds, aerosols and local weather.\n\nFemale reporters were invited after being excluded from Taliban minister Amir Khan Muttaqi's first event in Delhi.\n\nZion Church, founded by pastor Jin Mingri in 2007, is one of China's largest underground church networks.",
  "url": "https://www.bbc.com/news/world/asia",
  "scraped_timestamp": "2025-10-15T10:07:14.011174",
  "content_length": 2840,
  "word_count": 453,
  "source_domain": "www.bbc.com"
}