{
  "title": "NewsNews",
  "content": "Oslo calls the decision \"regrettable\", stressing that the Nobel committee functions independently.\n\nAt least 64 people are dead and scores are missing after tropical storms triggered torrential rains.\n\nMaría Corina Machado tells Trump of her appreciation for \"what he's doing... around the world for peace\".\n\nMachado is recognised for \"tireless work promoting democratic rights\" in Venezuela, the Nobel Committee says.\n\nA spokesman says the Nobel Committee placed \"politics over peace\" in awarding the coveted award to Venezuela's opposition leader.\n\nAt least 64 people are dead and scores are missing after tropical storms triggered torrential rains.\n\nThe country hopes to build a big tech sector, fuelled by its vast amount of cheap hydroelectricity.\n\nAccording to local media, dozens of houses have been damaged and it's suspected the blaze was caused by an illegal pyrotechnics warehouse.\n\nMaría Corina Machado tells Trump of her appreciation for \"what he's doing... around the world for peace\".\n\nChaotic scenes have become routine in a federal immigration court in Manhattan.\n\nOne of the world's driest deserts is transformed into a sea of wildflowers after a rare bloom.\n\nMaria Corina Machado called on Donald Trump directly to help her country which continues to be at crisis.\n\nThe numbers are the lowest since 1970, as Trump continues his crackdown on immigration to the US.\n\nThe makers of Colombia's popular mochila bags can earn good money, but are at risk of being underpaid.\n\nThe wounded animal was rescued in Rio Negro, Brazil, after being spotted crossing the river.\n\nPeople living in a Chicago apartment block targeted in a big immigration raid have described seeing armed agents and a helicopter landing on the roof.\n\nDogs, cats and even a rooster were blessed in celebration of the Feast of Saint Francis of Assisi.\n\nBrazil's Civil Defense and firefighting teams worked to extinguish the flames in São Paulo, and no injuries were reported.\n\nPresident Claudia Sheinbaum and Prime Minister Mark Carney's meeting is meant to kickstart a new economic bilateral relationship.\n\nOslo calls the decision \"regrettable\", stressing that the Nobel committee functions independently.\n\nAt least 64 people are dead and scores are missing after tropical storms triggered torrential rains.\n\nThe country hopes to build a big tech sector, fuelled by its vast amount of cheap hydroelectricity.\n\nAccording to local media, dozens of houses have been damaged and it's suspected the blaze was caused by an illegal pyrotechnics warehouse.\n\nHeavy rainfall has caused river banks to burst and triggered landslides, carrying away homes and cars.\n\nOne of the world's driest deserts is transformed into a sea of wildflowers after a rare bloom.\n\nA spokesman says the Nobel Committee placed \"politics over peace\" in awarding the coveted award to Venezuela's opposition leader.\n\nMaria Corina Machado called on Donald Trump directly to help her country which continues to be at crisis.\n\nMachado is recognised for \"tireless work promoting democratic rights\" in Venezuela, the Nobel Committee says.",
  "url": "https://www.bbc.com/news/world/latin_america",
  "scraped_timestamp": "2025-10-14T15:37:34.717110",
  "content_length": 3079,
  "word_count": 480,
  "source_domain": "www.bbc.com"
}