{
  "title": "NewsNews",
  "content": "Watkins was serving a 29-year sentence imposed in 2013 after admitting 13 child sex offences.\n\nPolice said the cause of death was unknown but was not thought to be suspicious.\n\nThe family of Olivia-Grace Huxter, 8, who died on Wednesday, say she was the \"centre of the family\".\n\nDiane Jones and her two young daughters died when their Merthyr Tydfil home was set alight.\n\nIncentives will be aimed at new teachers in priority subjects if Plaid wins next election, party says.\n\nPolice said the cause of death was unknown but was not thought to be suspicious.\n\nQuestions still remain as to why no-one looked for teenager Karen Price when she vanished in 1981.\n\nThe classical singer says the family \"go all out\" for St David's Day, despite living in the US.\n\nThe family of Olivia-Grace Huxter, 8, who died on Wednesday, say she was the \"centre of the family\".\n\nWhat is it that has helped this genre find its way into everyone's headphones and ear buds?\n\nThe child was airlifted to Alder Hey Hospital after a crash in Llanrwst which involved a white van.\n\nLocals in some parts of Newport describe new rubbish appearing as soon as old waste is cleared.\n\nPeople arriving at Cardiff Central train station face a stark scene of concrete, says civic society.\n\nThe former chief executive was sacked after being accused of being \"dictatorial\".\n\nWhat can we expect from the new book When Gavin Met Stacey And Everything In Between?\n\nIsland trust seeks adventurous family or couple to join three other permanent residents on Ynys Enlli.\n\nRichard Baker says he will invite Ryan Reynolds over for a cup of tea in his new home.\n\nPlaid Cymru considers its future as some polls suggest it could win the next Senedd election.\n\nWomen from ethnic minority communities typically experience perimenopause symptoms earlier and for longer.\n\nOnce an esoteric 1970s genre, mood music playlists have become a daily habit for millions.\n\nLocals in some parts of Newport describe new rubbish appearing as soon as old waste is cleared.\n\nBBC Wales' Tink Llewellyn tells us about the best bits in the new Gavin and Stacey book.\n\nThe sudden death of Hefin David triggered a by-election in Caerphilly.\n\nThe Canary Wharf of Cardiff for some, others says Cardiff around its central station is \"stark\".\n\nLocals in some parts of Newport describe new rubbish appearing as soon as old waste is cleared.\n\nThe Canary Wharf of Cardiff for some, others says Cardiff around its central station is \"stark\".\n\nOspreys enjoy a first victory of the United Rugby Championship season by beating Zebre convincingly in Bridgend.\n\nListen to live BBC Radio Wales commentary as Glasgow Warriors host Dragons in the United Rugby Championship.\n\nDavid Hughes suggests \"one or two\" may have \"deviated in their belief\" in his ability to manage Newport County after the club's winless run.\n\nMark Williams will face fellow Welshman Daniel Wells in the Xi'an Grand Prix semi-finals.\n\nIan Watkins, cyn-ganwr Lostprophets wedi marw wedi ymosodiad arno yn y carchar.\n\nBu farw Olivia-Grace Huxter a oedd yn ddisgybl yn Ysgol Gynradd Pen-rhys yn sydyn ddydd Mercher.\n\nRhybudd bod cynnydd sylweddol yn y defnydd o AI yn peryglu mwy na swyddi cyfieithu yn unig.\n\nFaint ydych chi'n ei wybod am y band chwedlonol?\n\nThe classical singer says the family \"go all out\" for St David's Day, despite living in the US.\n\nWatkins was serving a 29-year sentence imposed in 2013 after admitting 13 child sex offences.\n\nPolice said the cause of death was unknown but was not thought to be suspicious.\n\nIncentives will be aimed at new teachers in priority subjects if Plaid wins next election, party says.\n\nThe family of Olivia-Grace Huxter, 8, who died on Wednesday, say she was the \"centre of the family\".\n\nDiane Jones and her two young daughters died when their Merthyr Tydfil home was set alight.\n\nWhat is it that has helped this genre find its way into everyone's headphones and ear buds?\n\nQuestions still remain as to why no-one looked for teenager Karen Price when she vanished in 1981.\n\nOnce an esoteric 1970s genre, mood music playlists have become a daily habit for millions.",
  "url": "https://www.bbc.com/news/wales",
  "scraped_timestamp": "2025-10-11T23:55:15.781158",
  "content_length": 4094,
  "word_count": 691,
  "source_domain": "www.bbc.com"
}