{
  "title": "NewsNews",
  "content": "The government's national security adviser is facing pressure over whether he played a role in the trial's collapse.\n\nThe SNP are not only hopeful of victory at next year's Scottish election, but are even talking of an outright majority.\n\nThe think tank says the government should seize the opportunity to reform the tax system.\n\nEducation Secretary Bridget Phillipson says Jewish students do not feel safe, as she sets out measures to tackle antisemitism.\n\nPlaid backs plan for independence white paper, but not in the first five years of a government.\n\nThe SNP are not only hopeful of victory at next year's Scottish election, but are even talking of an outright majority.\n\nThe former PM is among those in favour of targeted screening for men most at risk, but some medical experts are sceptical.\n\nTrump's Middle East envoy also says the UK played a \"vital role\" in the peace agreement.\n\nThe think tank says the government should seize the opportunity to reform the tax system.\n\nAs well as the accusations regarding Ed Davey, Inigo Rowland is charged with flick-knife possession.\n\nDozens of Chagossians have flown in to Heathrow Airport this week, putting pressure on housing services.\n\nThe ex-PM confirms he met Epstein in 2002, six years before the financier pleaded guilty to soliciting prostitution from a minor.\n\nThe foreign secretary says the UK will continue to support the peace process through diplomacy.\n\nThere has been a backlash to the announcement a UK-wide digital ID scheme will be introduced by 2029.\n\nThe government is facing questions about why the case collapsed just weeks before a trial was due to go ahead.\n\nThere is a renewed emphasis on independence as the party meets less than a year before the Scottish election.\n\nKemi Badenoch says a future Conservative government would scrap stamp duty, but what might the impact be?\n\nSome experts think the government may break its promise not to increase income tax, NI or VAT for working people.\n\nA guide to the politicians competing in, arguably, the most interesting devolved Welsh by-election.\n\nThe Tory leader's conference speech included a new pledge to scrap stamp duty on the purchase of main homes.\n\nThe Conservative Party, so often and for so long the dominating force in British politics, is a shrivelled version of its usual self.\n\nAgainst the backdrop of grief after the Manchester attack, there is debate about which tenets should be fundamental in our society, writes Chris Mason.\n\nWith this speech, the prime minister reminded his internal critics who won Labour's whopping majority in the election 15 months ago.\n\nThe Labour gathering in Liverpool is awash with talk of the rise of Nigel Farage's party as well as the ambitions of Andy Burnham.\n\nAs the party's annual conference begins, there are reasons for the current leadership to be gloomy, writes Laura Kuenssberg.\n\nAhead of Labour's annual conference, Laura Kuenssberg talks to ministers, MPs and advisers about Starmer's position.\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nMonths of preparations have gone into this state visit - but the Lord Mandelson question is not the only concern troubling insiders.\n\nThe start of this political season has been wild, writes Laura Kuenssberg, and Labour now has Reform UK breathing down its neck.\n\nEducation Secretary Bridget Phillipson says it's unacceptable that Jewish young people feel they need to conceal their identity on campus.\n\nThe sudden death of Hefin David triggered a by-election in Caerphilly.\n\nKemi Badenoch made the announcement at the parties conference in Manchester during her first keynote speech as Conservative Party leader.\n\n'The vibe is flat' at Conservative Party conference",
  "url": "https://www.bbc.com/news/politics",
  "scraped_timestamp": "2025-10-14T14:56:13.327051",
  "content_length": 3738,
  "word_count": 607,
  "source_domain": "www.bbc.com"
}