{
  "title": "NewsNews",
  "content": "Some 260 suspects were arrested in the operation across 14 African countries, says Interpol.\n\nOne resident said the cemetery in the capital had been left littered with discarded bottles and cans.\n\nFrench authorities say the \"remarkable seizure\" was found on board a fishing boat following a tip-off.\n\nNicolas Sarkozy, president from 2007-12, was found guilty of criminal conspiracy but cleared of other charges.\n\nPeter Mutharika defeated the incumbent, Lazarus Chakwera, the election commission announces.\n\nOne resident said the cemetery in the capital had been left littered with discarded bottles and cans.\n\nIndia, Qatari royals, China and ecologists have their own, very different, views on Assumption Island's future.\n\nEthiopian runner Shewarge Alene dies aged 30, the organiser of the Stockholm marathon confirms.\n\nFrench authorities say the \"remarkable seizure\" was found on board a fishing boat following a tip-off.\n\nThe president-elect of the southern African nation has a long and controversial political career.\n\nFriends of the stabbed 21-year-old Kenyan woman recount to the BBC events on the night she went missing.\n\nEvans Kibet, now being held in Ukraine after surrendering, says he did not know he was signing up.\n\nA selection of the week's best photos from across the African continent and beyond.\n\nRwanda will make history when it becomes the first African nation to host cycling's Road World Championships from 21-28 September.\n\nIslamists fighters are trying to prevent deliveries of fuel and other essential supplies to landlocked Mali.\n\nAs the 50th independence anniversary approaches the country grapples with poverty and inequality.\n\nThe political rift that could spiral into conflict again after the vice-president was accused of treason.\n\nFemale runners won six of Kenya’s seven gold medals at the World Athletics Championships, topping the podium in every event from 800m to the marathon in Tokyo.\n\nPresident Duma Boko congratulates the men's 4x400m relay team for winning gold at the World Athletic Championships.\n\nWicketkeeper Quinton de Kock reverses his retirement for one-day internationals and is recalled by South Africa.\n\nKenya make it a clean sweep at the Berlin Marathon with Sabastian Sawe winning the men's race and Rosemary Wanjiru triumphing in the women's.\n\nLuca Zidane, the son of France's World Cup-winning playmaker Zinedine, switches his international allegiance from France to Algeria.\n\nSomalia's President Hassan Sheikh Mohamud says he is a prime target of the Islamist group al-Shabab.\n\nThe battle for Kordofan, with a population of eight million, is the latest frontline in Sudan's civil war.\n\nThis is why the African Union has backed calls to stop using the Mercator map of the world.\n\nGhana has been described as the fashion industry’s dumping ground.\n\nRadio 1Xtra presenter Nadia Jae shares her top tips for Notting Hill Carnival with singer Tyla.\n\nThree essential stories to round off your working day. Explaining the news from Africa.\n\nOne resident said the cemetery in the capital had been left littered with discarded bottles and cans.\n\nSome 260 suspects were arrested in the operation across 14 African countries, says Interpol.\n\nIndia, Qatari royals, China and ecologists have their own, very different, views on Assumption Island's future.\n\nPeter Mutharika defeated the incumbent, Lazarus Chakwera, the election commission announces.\n\nThe president-elect of the southern African nation has a long and controversial political career.\n\nThe battle for Kordofan, with a population of eight million, is the latest frontline in Sudan's civil war.\n\nThe drug - a twice-yearly injection – reduces the current HIV treatment cost in developing countries.\n\nThe herd was fleeing lions, officials say\n\nPeter Mutharika has got about 66% of the votes counted so far, putting him ahead of President Lazarus Chakwera.",
  "url": "https://www.bbc.com/news/world/africa",
  "scraped_timestamp": "2025-09-26T17:03:33.864913",
  "content_length": 3856,
  "word_count": 592,
  "source_domain": "www.bbc.com"
}