{
  "title": "NewsNews",
  "content": "The prime minister believes a new scheme would help crack down on illegal working in the UK.\n\nThe majority of Labour MPs contacted by the BBC say they are against Andy Burnham challenging Keir Starmer.\n\nOn economic and immigration issues, many international leaders are trying to work out how to combat the rise of the populist right.\n\nUnder the Pride in Place programme, 169 communities will get £20m over a decade to spend on boosting their local area.\n\nReform UK argues the sell-off, started in 2022, is pushing up the government's borrowing costs.\n\nThe majority of Labour MPs contacted by the BBC say they are against Andy Burnham challenging Keir Starmer.\n\nSir Keir Starmer says he stands with mayor Sir Sadiq Khan, after Donald Trump's statement to the UN.\n\nThe Manchester mayor's comments ahead of Labour's annual conference are a clear sign of his leadership ambitions.\n\nOn economic and immigration issues, many international leaders are trying to work out how to combat the rise of the populist right.\n\nThe carmaker says it is working through a backlog of payments as its IT systems come back online.\n\nSome migrants in hotels are taking journeys costing hundreds of pounds, a BBC investigation found.\n\nThe former Labour leader admits the new party has faced some \"fraught days in the last week\".\n\nEducation Secretary Bridget Phillipson is running against Lucy Powell for Labour's deputy leadership.\n\nMinisters say software developed by the Cabinet Office has helped to ramp up fraud detection.\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nThe party is taking on Nigel Farage in a way Labour and the Tories either can't or won't, our political editor writes.\n\nUnder the plans, migrants would need to reapply for new visas with tougher rules.\n\nThe PM had signalled a shift in policy unless Israel took steps including agreeing to a ceasefire in Gaza.\n\nA complete transcription of Sir Keir Starmer's video announcement on Palestinian statehood.\n\nThe party is taking on Nigel Farage in a way Labour and the Tories either can't or won't, our political editor writes.\n\nTrump's disagreements with Sir Keir were somehow channelled past him, rather than at him, writes the BBC's political editor.\n\nThe government will hope for a reprieve from questions about Peter Mandelson, says the BBC's political editor.\n\nThe BBC's Political Editor Chris Mason and North America Editor Sarah Smith discuss what's at stake for both sides during the trip.\n\nThe BBC's political editor says people at the top of government acknowledge the last few weeks have been dreadful for them.\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nMonths of preparations have gone into this state visit - but the Lord Mandelson question is not the only concern troubling insiders.\n\nThe start of this political season has been wild, writes Laura Kuenssberg, and Labour now has Reform UK breathing down its neck.\n\nSome say Britain's decision is an important first step – while others worry it won't make a real difference, writes BBC's International Editor Jeremy Bowen.\n\nIt's been a week of dismissals, disagreements and backbench bust-ups, writes Laura Kuenssberg.\n\nGreater Manchester's mayor answers questions on his comments about he Labour leadership.\n\nAndy Burnham is asked about his interview in the Daily Telegraph, in which he said Labour MPs were asking him privately to challenge the prime minister.\n\nBurnham said the Labour government needed a \"proper plan for the country\", including one to beat Reform UK.\n\nUnder the plans, migrants would need to reapply for new visas with tougher rules.",
  "url": "https://www.bbc.com/news/politics",
  "scraped_timestamp": "2025-09-26T00:35:11.361719",
  "content_length": 3672,
  "word_count": 604,
  "source_domain": "www.bbc.com"
}