{
  "title": "NewsNews",
  "content": "Get alerts about the latest stories from InDepth - the home of the best analysis from BBC correspondents about the biggest issues of the day\n\nThe pair are going head-to-head to be Angela Rayner's replacement, but what are they battling for?\n\nThe debate is ramping up about what happens if - or when - computer intelligence overtakes humans\n\nWith close to 32,000 dog attacks recorded in England and Wales last year, is there a better solution?\n\nAre this year's major attacks the \"cumulative effect of a kind of inaction on cyber security\" from the government and big business?\n\nAs the party's annual conference begins, there are reasons for the current leadership to be gloomy, writes Laura Kuenssberg.\n\nThe debate is ramping up about what happens if - or when - computer intelligence overtakes humans\n\nFor the first time since the Hamas attacks on Israel two years ago, there is a realistic chance of ending the horrors\n\nThe extent to which leaving the Convention would make a difference to immigration has been greatly exaggerated, argues Lord Sumption\n\nWith close to 32,000 dog attacks recorded in England and Wales last year, is there a better solution?\n\nThe inquest following the death of Paloma Shemirani raises the question of how to prevent young people from health misinformation\n\nWith claims of a 'two-tier system', could it be that these drugs are exacerbating health inequalities?\n\nAhead of Labour's annual conference, Laura Kuenssberg talks to ministers, MPs and advisers about Starmer's position.\n\nAs the US president pushes a crackdown on left-wing groups and openly targets political foes, critics ask where he's taking America\n\n​​Keir Starmer calls Reform migrant policy 'racist' and 'immoral'.\n\nCould memes found on bullets point to a possible motive behind Charlie Kirk's murder?\n\nThe Macrons are suing influencer Candace Owens for defamation\n\nA potter, historian and theatre performer embark on a social media experiment.\n\nSecret filming reveals evidence of racism and misogyny at Charing Cross Police Station.\n\nThe reality for some elderly residents at a large nursing home in the Highlands.\n\nProfessor Jim Al-Khalili unravels the mysteries of the human brain.\n\nThe inside story of how a council in England was held to ransom by a damaging cyberattack.",
  "url": "https://www.bbc.com/news/bbcindepth",
  "scraped_timestamp": "2025-10-14T15:02:30.932744",
  "content_length": 2272,
  "word_count": 365,
  "source_domain": "www.bbc.com"
}