{
  "title": "NewsNews",
  "content": "MiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nBahison Ravindran thought he was an Indian by birth - until police declared his passport invalid.\n\nKaran Johar, Aishwarya Rai, Abhishek Bachchan and others have gone to court to protect their personality rights.\n\nAt least 10 people have died, most from electrocution, following the record-breaking downpour.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nStartups and smaller firms could bear the brunt of Trump's new H-1B visa fee, and some fear it could thwart US innovation.\n\nOpener Abhishek Sharma scores a half-century and Kuldeep Yadav takes three wickets as defending champions India beat Bangladesh in Dubai\n\nBahison Ravindran thought he was an Indian by birth - until police declared his passport invalid.\n\nLower consumer taxes are expected to ease some of the impact of Trump's 50% tariffs on India.\n\nSongs of Forgotten Trees, which won the Orizzonti Award at Venice, marks the first such win by an Indian director.\n\nIndia may adapt, but the US risks losing skilled workers who have helped build the Silicon Valley and hospitals.\n\nHarjit Kaur, a 73-year-old who unsuccessfully applied for asylum, was arrested by immigration authorities last week.\n\nIn Kerala this year, more than 70 people have been diagnosed and 19 have died from the brain-eating amoeba.\n\nSeveral neighbourhoods in Kolkata have been inundated, with water entering people's homes.\n\nRescue efforts are under way after the Himalayan region was hit by torrential downpour.\n\nThe Chinese, Indian and Russian leaders were among those attending a regional security summit in China over the weekend.\n\nRussian President Vladimir Putin and Indian Prime Minister Narendra Modi are among the 20 world leaders attending a regional security summit in China.\n\nAt least 30 people have died since Tuesday, as flash floods swept away roads and submerged homes.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nOpener Abhishek Sharma scores a half-century and Kuldeep Yadav takes three wickets as defending champions India beat Bangladesh in Dubai\n\nBahison Ravindran thought he was an Indian by birth - until police declared his passport invalid.\n\nAt least 10 people have died, most from electrocution, following the record-breaking downpour.\n\nKaran Johar, Aishwarya Rai, Abhishek Bachchan and others have gone to court to protect their personality rights.\n\nRob and Rylan board a packed train to Rajasthan during Diwali. But Rylan is horrified when Rob says he might use the toilet...\n\nSeveral neighbourhoods in Kolkata have been inundated, with water entering people's homes.",
  "url": "https://www.bbc.com/news/world/asia/india",
  "scraped_timestamp": "2025-09-26T00:49:17.469611",
  "content_length": 3194,
  "word_count": 510,
  "source_domain": "www.bbc.com"
}