{
  "title": "NewsNews",
  "content": "Sébastien Lecornu resigned on Monday after 26 days in the job and he said two days later his \"mission is over\".\n\nThe UK, France and Germany are \"united\" in wanting to use the full value of frozen Russian assets to end the war, Sir Keir Starmer said.\n\nAlexander Stubb has become a key voice for Europe at the White House amid the Ukraine war.\n\nPolice officers question two people and find a suspected improvised explosive device at one of the suspect's homes.\n\nAn Interpol-led operation has identified German citizen Eva Maria Pommer after a police tip-off.\n\nThe UK, France and Germany are \"united\" in wanting to use the full value of frozen Russian assets to end the war, Sir Keir Starmer said.\n\nDenmark will buy US F-35 fighter jets and new ships to defend the Arctic, including Greenland.\n\nOfficials say 380,000 consumers in Kyiv are without power, with emergency outages in place across Ukraine.\n\nAlexander Stubb has become a key voice for Europe at the White House amid the Ukraine war.\n\nRed weather warnings have now been lifted but yellow and amber alerts are in place across south-eastern Spain as Storm Alice hits.\n\nPolice investigate after 10 beehives were burned down in a park in the central city of Almere.\n\nA French court increases by a year the jail term of the only man who challenged his conviction for raping Gisèle Pelicot.\n\nIt is understood her family has raised enough money to significantly reduce any jail time imposed.\n\nThe BBC's Mark Lowen gets exclusive access to the room where the Nobel committee meets every year to choose a winner.\n\nSatellite images show the house where the BBC's Vitaly Shevchenko grew up could now be a Russian base.\n\nAfter eight years in office, Emmanuel Macron's position as president is coming under increasing pressure as France's political crisis escalates.\n\nGisèle Pelicot's dominant stance was seen as a moment in France's MeToo movement but the enthusiasm appears to be wilting.\n\nThey are melting like never seen before, changing landscapes around the world beyond recognition.\n\nThe president's unpopularity means those who associate themselves with him risk a beating at France's 2027 election, writes the BBC's Hugh Schofield.\n\nJoin the puffin patrol as they rescue lost pufflings on Vestmannaeyjar, off the southern coast of Iceland.\n\nWatch as mountain biker Aurélien Fontenoy cycles up the Eiffel Tower's staircase to break the world record by nearly seven minutes.\n\nDogs, cats and even a rooster were blessed in celebration of the Feast of Saint Francis of Assisi.\n\nWater cannon and pepper spray was used by authorities to disperse protesters.\n\nAt least three people, including two rescue workers, have been killed in the country's south-east\n\nJim Gavin had been chosen to represent Fianna Fáil, the Republic of Ireland's biggest party in the coalition government\n\nThe UK, France and Germany are \"united\" in wanting to use the full value of frozen Russian assets to end the war, Sir Keir Starmer said.\n\nDenmark will buy US F-35 fighter jets and new ships to defend the Arctic, including Greenland.\n\nSébastien Lecornu resigned on Monday after 26 days in the job and he said two days later his \"mission is over\".\n\nOfficials say 380,000 consumers in Kyiv are without power, with emergency outages in place across Ukraine.\n\nEmma Costello McCrory, a mother-of-two, died after her home in Clontarf was set on fire by George Turner in 2022.\n\nMohammed Al Shaker Al Tamimi also admitted the attempted murder of the girl's mother Aisha Noor Al Kattib.\n\nPolice officers question two people and find a suspected improvised explosive device at one of the suspect's homes.\n\nAn Interpol-led operation has identified German citizen Eva Maria Pommer after a police tip-off.",
  "url": "https://www.bbc.com/news/world/europe",
  "scraped_timestamp": "2025-10-11T23:54:57.014873",
  "content_length": 3717,
  "word_count": 614,
  "source_domain": "www.bbc.com"
}