{
  "title": "NewsNews",
  "content": "Anti-corruption demonstrations have toppled a government - will they lead to lasting change?\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nWith the president approaching 90 years of age and another possible candidate in jail, finding the right leadership would be a challenge\n\nThis moment has parallels with other periods of discord in US history, but it is more complicated than simply repeating them.\n\nMonths of preparations have gone into this state visit - but the Lord Mandelson question is not the only concern troubling insiders.\n\nWhy so many corn belt Americans continue to back Trump, even while feeling economic pressure driven partly by his trade policy\n\nWith the president approaching 90 years of age and another possible candidate in jail, finding the right leadership would be a challenge\n\nAs they gather in Bournemouth for their annual conference, Laura Kuenssberg considers what next for the Lib Dems.\n\nThe country is at the conjuncture of several crises at once - but is it fair to blame Macron for 'this shipwreck'?\n\nThis moment has parallels with other periods of discord in US history, but it is more complicated than simply repeating them.\n\nThere is growing disquiet over the roles of Starmer, his chief of staff and Whitehall vetting in the saga.\n\nDenmark's survival rates record for certain cancers were poor compared to some other wealthy countries. Then it came up with a bold plan\n\nErdogan's critics claim that he has become a latter-day Sultan in Turkey, dismantling human rights, cracking down on dissent and weaponising the courts\n\nThe start of this political season has been wild, writes Laura Kuenssberg, and Labour now has Reform UK breathing down its neck.\n\nThe party has now been ahead in the polls for five months, but can it keep the momentum?\n\nCovid is in the rear view mirror but are we equipped to deal with the next pandemic?\n\nCould memes found on bullets point to a possible motive behind Charlie Kirk's murder?\n\nThe Macrons are suing influencer Candace Owens for defamation\n\nA potter, historian and theatre performer embark on a social media experiment.\n\nWhat is the state of the historic special relationship between the US and the UK?\n\nZara McDermott explores backpacker life and begins her Thai adventure.\n\nIt began with a dream of heaven on earth - but the reality was abuse on a shocking scale.\n\nThe inside story of how a council in England was held to ransom by a damaging cyberattack.",
  "url": "https://www.bbc.com/news/bbcindepth",
  "scraped_timestamp": "2025-09-26T00:15:05.455910",
  "content_length": 2486,
  "word_count": 419,
  "source_domain": "www.bbc.com"
}