{
  "title": "NewsNews",
  "content": "The taxi driver who took the Southport attacker to Hart Space did not call 999 for 50 minutes.\n\nChichester City FC confirmed that Billy Vigar died on Thursday morning.\n\nShirley Bartram, 69, lost five fingers and the ends of her toes due to sepsis.\n\nMohammed Shabir one of three defendants due to stand trial for murders of mother and three children.\n\nThe dog found a phone which showed drunk driver Darryl Anderson was texting and speeding on the A1(M).\n\nChichester City FC confirmed that Billy Vigar died on Thursday morning.\n\nAnn Blackwood was found fatally stabbed by the grave of her son on the anniversary of his death.\n\nSir Keir Starmer says he stands with mayor Sir Sadiq Khan, after Donald Trump's statement to the UN.\n\nShirley Bartram, 69, lost five fingers and the ends of her toes due to sepsis.\n\nSir Keir said he wanted to \"get it right\" following the unravelling of HS2 plans.\n\nDaniel Cotson and his parents, Paul and Stephanie, were involved in the scheme.\n\nThe accident happened as the door on the flight was being closed at East Midlands Airport.\n\nThe largest planning enforcement fine in Bradford in recent years relates to Deli Crunch.\n\nThe bar, and a suit belonging to Led Zeppelin drummer John Bonham, were among items sold on 25 September.\n\nCrown Wharf in Stone is chosen from the winners of 16 categories at the Great British Pub Awards.\n\nBest known for slapstick comedy, Paul Chuckle is set to star in mobster movie Fall to the Top.\n\nSouthwood Garden Centre near Hull says dogs are banned from its Halloween and Christmas areas.\n\nSophia Choudry says she is \"shaken\" and \"heartbroken\" after being racially abused on the Elizabeth line.\n\nUswayford is only accessible via forest tracks and a public road, but has £5m of timber waiting.\n\nCouncil to spend £3.4m on temporary homes after an increase in the number of people needing help.\n\nBBC London joins charity workers as they carry out research into where homeless women are sleeping.\n\nFans of the young wizard capture a scene for the upcoming HBO series being shot in Hertfordshire.\n\nStaff at Teesside Hospice plan a wedding in \"less than two weeks\" for one of their wellbeing patients.\n\nKiburi weights 177kg and was anaesthetised for the duration of the checks.\n\nThe driver was attacked by Demetri Draco while delivering a phone in Derby.\n\nFollow live text commentary as Aston Villa host Bologna in the Europa League looking for their first win of the season.\n\nNottinghamshire win the County Championship title, denying Surrey a fourth straight crown.\n\nFrance defender William Saliba agrees a new five-year contract with Arsenal.\n\nGeoff Parling is the ninth head coach to lead Leicester Tigers in nine years, but could he be the one to build a long-term future?\n\nSenior police figures say anti-immigration sentiment is leading to \"verbal and physical attacks\".\n\nEmergency services say the road could be closed \"for some time\".\n\nShort-term lets are widely blamed for exacerbating the housing crisis in places like the South West.\n\nTankers are being used to collect wastewater and keep the sewer flowing for residents.\n\nSir Keir said he wanted to \"get it right\" following the unravelling of HS2 plans.\n\nThe accused, 34, and a man, 35, who faces the same eight charges, are due to stand trial in January.\n\nUnison says the dispute involving healthcare assistants in Durham and Darlington is resolved.\n\nA 28-year-old man is in custody following the incident that saw Connor Batty shot dead in Hemsworth.\n\nEngland and Canada name unchanged teams for the Women's Rugby World Cup final on Saturday at Twickenham.",
  "url": "https://www.bbc.com/news/england",
  "scraped_timestamp": "2025-09-26T00:25:14.343497",
  "content_length": 3577,
  "word_count": 600,
  "source_domain": "www.bbc.com"
}