{
  "title": "NewsNews",
  "content": "The government's multi-billion-dollar \"nutritious meals programme\" has been plagued by food poisoning.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nIt is China's first firm goal to reduce emissions but falls well short of what is needed to meet global targets.\n\nThe BBC's Laura Bicker says residents of southern China are largely heeding warnings from authorities as the storm lashes the region with wind and rain.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nThe debt-ridden centre said the money would go towards paying overdue bills.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nMiG-21 served in all conflicts with Pakistan since 1965 and was later known for a high crash rate.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nBahison Ravindran thought he was an Indian by birth - until police declared his passport invalid.\n\nSocial media footage showed the massive crater in Thailand's capital leaving cars teetering on the edge.\n\nAustralia's public broadcaster \"sacrificed\" Antoinette Lattouf \"to appease a lobby group\", the judge said.\n\nHannah Thomas says she was punched in the eye during a scuffle with police in June.\n\nKaran Johar, Aishwarya Rai, Abhishek Bachchan and others have gone to court to protect their personality rights.\n\nThe strong winds hit in waves - and standing upright is almost impossible, our correspondent writes.\n\nChina's ban on K-drama seemed to be easing - until Jun Ji-hyun's Tempest came along.\n\nA Pakistan-Saudi defence agreement pledging a mutual response to any aggression raises concerns in India.\n\nIndia may adapt, but the US risks losing skilled workers who have helped build the Silicon Valley and hospitals.\n\nThe government's multi-billion-dollar \"nutritious meals programme\" has been plagued by food poisoning.\n\nMany tattoo artists have operated illegally for the past 30 years, leaving them at the sharp end of the law.\n\nA scene featuring a same-sex couple was digitally altered to depict a heterosexual couple.\n\nFour people were killed and dozens injured in the deadliest protests in the Himalayan region for years.\n\nAn Indian court dismissed a case filed by X against a government portal that it argued was being used for censorship.\n\nPeople in the path of a deadly wall of water stood little chance - survivors are shocked at what happened.\n\nThe \"king of storms\" has forced the evacuation of nearly two million people from the southern Chinese province of Guangdong.\n\nRagasa is the world's strongest storm this year and has been roaring over the South China Sea for days.\n\nA person was swept off their feet as water burst into the building.",
  "url": "https://www.bbc.com/news/world/asia",
  "scraped_timestamp": "2025-09-26T00:57:18.986103",
  "content_length": 2944,
  "word_count": 481,
  "source_domain": "www.bbc.com"
}