{
  "title": "NewsNews",
  "content": "Rebecca Comins, described as a \"fierce competitor\", had reached speeds of up to 30mph.\n\nPublic services could face big cuts if Mark Drakeford cannot get other parties to back his budget.\n\nJoanna Page says she was told at a prestigious London drama school her performances were poor because she's Welsh.\n\nMichelle Mills denies conspiring to murder Christopher Mills with Geraint Berry and Steven Thomas.\n\nKevin de Bruyne scores twice from the penalty spot as Belgium top Group J with a thrilling 4-2 victory over Wales in their World Cup qualifier in Cardiff.\n\nPublic services could face big cuts if Mark Drakeford cannot get other parties to back his budget.\n\nAbout 30 homes were evacuated last December when a 33ft wide and 45ft deep crater opened up.\n\nTwo men are accused of murdering former Lostprophets frontman Ian Watkins at HMP Wakefield.\n\nJoanna Page says she was told at a prestigious London drama school her performances were poor because she's Welsh.\n\nTikToker and food reviewer Kalani Smith called the doughnuts the \"best he has ever had\".\n\nDanielle Evans, from Swansea, died as a result of the explosion linked to printing machines.\n\nEight people have denied rioting in the aftermath of a fatal e-bike crash in Ely in May 2023.\n\nA herd invades Neath railway station, causing disruption to services between Cardiff and Swansea.\n\nPeople became unwell after a carvery dinner at the Cwrt Henllys Hotel.\n\nAs well as representing Wales at cricket, Libby Thomas also has a degree in forensic psychology.\n\nQuestions still remain as to why no-one looked for teenager Karen Price when she vanished in 1981.\n\nPeople arriving at Cardiff Central train station face a stark scene of concrete, says civic society.\n\nWhat can we expect from the new book When Gavin Met Stacey And Everything In Between?\n\nIsland trust seeks adventurous family or couple to join three other permanent residents on Ynys Enlli.\n\nA 33ft (10m) wide and 45ft (14m) deep crater left by Storm Bert is fixed in a £4m repair job.\n\nA herd invades Neath railway station, causing disruption to services between Cardiff and Swansea.\n\nThe charity Guide Dogs UK is calling for the banning of pavement parking.\n\nOnce an esoteric 1970s genre, mood music playlists have become a daily habit for millions.\n\nBBC Wales' Tink Llewellyn tells us about the best bits in the new Gavin and Stacey book.\n\nA herd invades Neath railway station, causing disruption to services between Cardiff and Swansea.\n\nBBC Wales' Tink Llewellyn tells us about the best bits in the new Gavin and Stacey book.\n\nHead coach Craig Bellamy is proud of Wales' efforts to try to find a vital win despite falling short in the 4-2 World Cup qualifying defeat by Belgium.\n\nThe state of play and the permutations as Wales aim for qualification to next summer's finals.\n\nWatch the best of the action as Wales lose 4-2 to Belgium in World Cup qualifying in Cardiff.\n\nKevin de Bruyne scores twice from the penalty spot as Belgium top Group J with a thrilling 4-2 victory over Wales in their World Cup qualifier in Cardiff.\n\nWelshman Mark Williams further cements his status as a Welsh sporting icon after becoming the oldest winner of a ranking event.\n\nDaw wedi i Lywodraeth Cymru rybuddio am ergyd drom i wasanaethau cyhoeddus os nad ydyn nhw'n cael cefnogaeth i'w cyllideb.\n\nDyn wedi marw ar ôl i gar gael ei ganfod wedi troi drosodd ar ei do yn ardal Llanddona ar Ynys Môn nos Lun.\n\nPobl ar draws Cymru yn cael eu hannog i gofrestru i dderbyn rhybuddion llifogydd yn sgil ofnau bod nifer y defnyddwyr yn \"bryderus o isel\".\n\nWythnos Dathlu Dysgu Cymraeg: Y cyflwynydd tywydd Branwen Gwyn a'i phartner dysgu Cymraeg sy'n rhannu eu profiadau o fod yn ran o bâr dysgu.\n\nPublic services could face big cuts if Mark Drakeford cannot get other parties to back his budget.\n\nJoanna Page says she was told at a prestigious London drama school her performances were poor because she's Welsh.\n\nAbout 30 homes were evacuated last December when a 33ft wide and 45ft deep crater opened up.\n\nRebecca Comins, described as a \"fierce competitor\", had reached speeds of up to 30mph.\n\nA 33ft (10m) wide and 45ft (14m) deep crater left by Storm Bert is fixed in a £4m repair job.\n\nPeople became unwell after a carvery dinner at the Cwrt Henllys Hotel.\n\nDanielle Evans, from Swansea, died as a result of the explosion linked to printing machines.\n\nEight people have denied rioting in the aftermath of a fatal e-bike crash in Ely in May 2023.\n\nMichelle Mills denies conspiring to murder Christopher Mills with Geraint Berry and Steven Thomas.",
  "url": "https://www.bbc.com/news/wales",
  "scraped_timestamp": "2025-10-14T15:52:59.917399",
  "content_length": 4541,
  "word_count": 774,
  "source_domain": "www.bbc.com"
}