{
  "title": "NewsNews",
  "content": "An investigation by the watchdog into Leicestershire Police officers was reopened in March.\n\nKlevi Shekaj and teenager Leo Reid's killers smirked and showed no remorse during their murder trial.\n\nWatch live as Housing Secretary Steve Reed takes part in a series of quickfire interviews.\n\nBilly Vigar's family said they were \"devastated\" by his untimely passing at the age of just 21.\n\nA dozen flags appear on the same lamp-posts that caused a floral group a health and safety headache.\n\nKlevi Shekaj and teenager Leo Reid's killers smirked and showed no remorse during their murder trial.\n\nResidents are calling for urgent action from the Environment Agency and Anglian Water.\n\nNottinghamshire County Council leader Mick Barton is still refusing to be interviewed by a local paper.\n\nWatch live as Housing Secretary Steve Reed takes part in a series of quickfire interviews.\n\nThe Anthony Nolan Cell Collection Centre is the first in the UK dedicated to transplants.\n\nThe authority has apologised to families for distress caused.\n\nThe house is one of 13 new homes with social rent in Chirbury, all part of a £3m development.\n\nBlackpool Illuminations \"no longer reach to our inner five-year-old\", says an opposition councillor.\n\nAbout 70 old cast iron road signs are spruced up by the anonymous volunteer in their spare time.\n\nFinalist Sophie Segrue admits she never expected to hear back after her application to the show.\n\nAuctioneers say the collection of vintage phones spans almost a century of design.\n\nMax Fosh travelled across the sea from Sennen Cove in Cornwall to Hugh Town.\n\nThe family of Clive Houghton are asking for colleagues from his time working for BT to come forward.\n\nThe station hall has been closed for more than two years for a £10.5m restoration project.\n\nLearn which M6 stretches will be shut and the diversions put in place as an HS2 bridge is installed.\n\nCommunities are set to get powers to veto unwanted shops, but will it work in towns like Scunthorpe?\n\nOwners who allow dogs to chase or injure waterfowl could face prosecution, a swan sanctuary warns.\n\nPeople living in Portsmouth have told the BBC's Dan Johnson they feel unsafe in their own homes.\n\nThe beatbox championships were held in Bristol and saw people show off their skills.\n\nFans of the young wizard capture a scene for the upcoming HBO series being shot in Hertfordshire.\n\nStaff at Teesside Hospice plan a wedding in \"less than two weeks\" for one of their wellbeing patients.\n\nFollow live text updates and BBC radio commentaries from day three of the County Championship.\n\nEllie Kildunne went from not having a rugby club to playing for England in four years. A World Cup win would confirm the sport's new superstar.\n\nAll the latest from Friday's Premier League news conferences as Liverpool manager Arne Slot and Newcastle boss Eddie Howe speak to the media.\n\nWhen Morgan Rogers handed Ollie Watkins the ball, the Holte End chanted the striker's name.\n\nEmergency services say the road could be closed \"for some time\".\n\nSir Keir said he wanted to \"get it right\" following the unravelling of HS2 plans.\n\nOur Ask Me Anything team take a look at whether there will be a bank holiday if England win the Rugby World Cup.\n\nThe two-storey unit at Vernon Park will be used for manufacturing, storage and distribution.\n\nLifelong fan Mitch Middleton died earlier this month after being diagnosed with a brain tumour.\n\nAuctioneers say the collection of vintage phones spans almost a century of design.\n\nEllie Kildunne went from not having a rugby club to playing for England in four years. A World Cup win would confirm the sport's new superstar.\n\nThe BBC understands concerns over the long-term costs of the proposed line are behind the delay.",
  "url": "https://www.bbc.com/news/england",
  "scraped_timestamp": "2025-09-26T16:01:35.706325",
  "content_length": 3725,
  "word_count": 621,
  "source_domain": "www.bbc.com"
}