{
  "title": "NewsNews",
  "content": "The changes, which raised the retirement age from 62 to 64, were seen as signature reforms in Emmanuel Macron's presidency.\n\nGas canisters were set off when the carabinieri entered the property near Verona in northern Italy.\n\nZelensky, due to visit Washington this week, wants long-range missiles to hit back at Russia - and Donald Trump says he may send Tomahawks.\n\nMoscow denies one of its vessels had to surface in the English Channel because of technical issues.\n\nThe move, which is aimed to protect supplies of technology, could raise tensions between the EU and China.\n\nGas canisters were set off when the carabinieri entered the property near Verona in northern Italy.\n\nThe defendants are believed to be couple Cecile Kohler and Jacques Paris, who were arrested in 2022.\n\nTens of thousands of people take to the streets in Brussels over government reforms and spending cuts.\n\nZelensky, due to visit Washington this week, wants long-range missiles to hit back at Russia - and Donald Trump says he may send Tomahawks.\n\nGermany's President Steinmeier will visit King Charles on a state visit to the UK in December.\n\nOslo calls the decision \"regrettable\", stressing that the Nobel committee functions independently.\n\nThe European Broadcasting Union had previously announced it would hold a vote on Israel's participation in November.\n\nThe highest red alert is declared in one coastal province, as residents are urged to stay indoors.\n\nThe EU's much-delayed Entry/Exit System will change the way UK passengers travel to 29 countries.\n\nThe piece was due to be used in a show by British designer Alexander McQueen - but then disappeared.\n\nAlexander Stubb has become a key voice for Europe at the White House amid the Ukraine war.\n\nThe BBC's Mark Lowen gets exclusive access to the room where the Nobel committee meets every year to choose a winner.\n\nSatellite images show the house where the BBC's Vitaly Shevchenko grew up could now be a Russian base.\n\nDrone footage shows blaze destroying the historic Bernaga Monastery in Italy.\n\nJoin the puffin patrol as they rescue lost pufflings on Vestmannaeyjar, off the southern coast of Iceland.\n\nWatch as mountain biker Aurélien Fontenoy cycles up the Eiffel Tower's staircase to break the world record by nearly seven minutes.\n\nWater cannon and pepper spray was used by authorities to disperse protesters.\n\nAt least three people, including two rescue workers, have been killed in the country's south-east\n\nHeather Humphreys made the claim during a radio debate when she challenged her rival Catherine Connolly's decision to employ the woman in her Dáil office.\n\nThe changes, which raised the retirement age from 62 to 64, were seen as signature reforms in Emmanuel Macron's presidency.\n\nTens of thousands of people take to the streets in Brussels over government reforms and spending cuts.\n\nGas canisters were set off when the carabinieri entered the property near Verona in northern Italy.\n\nMoscow denies one of its vessels had to surface in the English Channel because of technical issues.\n\nHeather Humphreys, one of two people vying to be Ireland's next president, says she's \"well placed\" to speak to unionists.\n\nA man in his 50s was arrested and remains detained in Garda custody.\n\nThe incident on Abbey Street was said to have happened on Saturday, as  supporters marched through the city centre.\n\nEvan Moore, who is 20, was sentenced to four years in prison with the final 12 months suspended.",
  "url": "https://www.bbc.com/news/world/europe",
  "scraped_timestamp": "2025-10-15T11:05:17.987105",
  "content_length": 3446,
  "word_count": 562,
  "source_domain": "www.bbc.com"
}