{
  "title": "NewsNews",
  "content": "Seven men each deny a charge of riot in the aftermath of a fatal e-bike crash in Ely in May 2023.\n\nA BBC investigation finds reports of sexual offences on trains rise by more than a third.\n\nSteven Thomas, 47, tells a jury he had \"no idea\" about an alleged plot to kill Christopher Mills.\n\nAn inquest into the death of Theo Treharne-Jones in June 2019 will study the door locks at the hotel.\n\nPublic services could face big cuts if Mark Drakeford cannot get other parties to back his budget.\n\nA BBC investigation finds reports of sexual offences on trains rise by more than a third.\n\nThe BBC Wales programme is being broadcast from the Bedwas Workmen's Hall and Institute.\n\nThe 47-year-old was found under the vehicle by a concerned colleague who went to look for him.\n\nSteven Thomas, 47, tells a jury he had \"no idea\" about an alleged plot to kill Christopher Mills.\n\nAs the Caerphilly by-election looms, voters search for ways to keep costs down amidst rising prices.\n\nResidents in the Braichmelyn area fear 'anti-social noise' if planning is given for new attraction.\n\nPolice say they are no closer to identifying the body of a man found in a Welsh reservoir.\n\nJoanna Page says she was told at a prestigious London drama school her performances were poor because she's Welsh.\n\nRebecca Comins, described as a \"fierce competitor\", had reached speeds of up to 30mph.\n\nAs well as representing Wales at cricket, Libby Thomas also has a degree in forensic psychology.\n\nQuestions still remain as to why no-one looked for teenager Karen Price when she vanished in 1981.\n\nWhat can we expect from the new book When Gavin Met Stacey And Everything In Between?\n\nPeople arriving at Cardiff Central train station face a stark scene of concrete, says civic society.\n\nIsland trust seeks adventurous family or couple to join three other permanent residents on Ynys Enlli.\n\nThis is the moment a train conductor is arrested after a passenger tells police about being assaulted.\n\nA 33ft (10m) wide and 45ft (14m) deep crater left by Storm Bert is fixed in a £4m repair job.\n\nChristopher Mills describes fighting off two masked men and taking their guns.\n\nA herd invades Neath railway station, causing disruption to services between Cardiff and Swansea.\n\nThe charity Guide Dogs UK is calling for the banning of pavement parking.\n\nA 33ft (10m) wide and 45ft (14m) deep crater left by Storm Bert is fixed in a £4m repair job.\n\nThe charity Guide Dogs UK is calling for the banning of pavement parking.\n\nPundits including Kit Symons, Tom Lockyer, David Edwards and Kath Morgan have their say on the decision to award Belgium a penalty following a handball by Wales' Ethan Ampadu in the World Cup qualifier between the sides.\n\nWales' autumn hopefuls are poised for a final chance to impress new coach Steve Tandy before his first squad announcement.\n\nWales must use their historic appearance at Euro 2025 as a springboard to qualify for a first World Cup, says former striker Helen Ward.\n\nHead coach Craig Bellamy is proud of Wales' efforts to try to find a vital win despite falling short in the 4-2 World Cup qualifying defeat by Belgium.\n\nMae menyw ifanc yn dweud bod profiad diweddar o aflonyddu rhywiol ar drên wedi gwneud iddi deimlo'n \"gaeth\".\n\nCwest yn clywed bod bachgen o Gymru wedi marw ar wyliau teulu yng Ngroeg ar ôl cael ei ganfod mewn pwll nofio.\n\nDyn wedi marw ar ôl i gar gael ei ganfod wedi troi drosodd ar ei do yn ardal Llanddona ar Ynys Môn nos Lun.\n\nDaw wedi i Lywodraeth Cymru rybuddio am ergyd drom i wasanaethau cyhoeddus os nad ydyn nhw'n cael cefnogaeth i'w cyllideb.\n\nA BBC investigation finds reports of sexual offences on trains rise by more than a third.\n\nThe BBC Wales programme is being broadcast from the Bedwas Workmen's Hall and Institute.\n\nThis is the moment a train conductor is arrested after a passenger tells police about being assaulted.\n\nSeven men each deny a charge of riot in the aftermath of a fatal e-bike crash in Ely in May 2023.\n\nThe 47-year-old was found under the vehicle by a concerned colleague who went to look for him.\n\nAs the Caerphilly by-election looms, voters search for ways to keep costs down amidst rising prices.\n\nChristopher Mills describes fighting off two masked men and taking their guns.\n\nResidents in the Braichmelyn area fear 'anti-social noise' if planning is given for new attraction.\n\nSteven Thomas, 47, tells a jury he had \"no idea\" about an alleged plot to kill Christopher Mills.",
  "url": "https://www.bbc.com/news/wales",
  "scraped_timestamp": "2025-10-15T10:45:16.290472",
  "content_length": 4433,
  "word_count": 767,
  "source_domain": "www.bbc.com"
}