{
  "title": "NewsNews",
  "content": "Machado is recognised for \"tireless work promoting democratic rights\" in Venezuela, the Nobel Committee says.\n\nA spokesman says the Nobel Committee placed \"politics over peace\" in awarding the coveted award to Venezuela's opposition leader.\n\nThe ousting of President Dina Boluarte follows a string of scandals and growing outrage over crime in Peru.\n\nThe White House calls the allegation \"baseless\" as the US Senate rejected a measure to bar Trump from using force against the boats.\n\nA large group of people threw rocks at Daniel Noboa's car, which bears \"signs of bullet damage\", an official says.\n\nA spokesman says the Nobel Committee placed \"politics over peace\" in awarding the coveted award to Venezuela's opposition leader.\n\nHeavy rainfall has caused river banks to burst and triggered landslides, carrying away homes and cars.\n\nOne of the world's driest deserts is transformed into a sea of wildflowers after a rare bloom.\n\nThe ousting of President Dina Boluarte follows a string of scandals and growing outrage over crime in Peru.\n\nThe numbers are the lowest since 1970, as Trump continues his crackdown on immigration to the US.\n\nMaria Corina Machado called on Donald Trump directly to help her country which continues to be at crisis.\n\nThe makers of Colombia's popular mochila bags can earn good money, but are at risk of being underpaid.\n\nVisitor numbers to the country have fallen sharply in the face of renewed US sanctions.\n\nAs islands brace for this year's big storms, many homes don't have household insurance.\n\nThe wounded animal was rescued in Rio Negro, Brazil, after being spotted crossing the river.\n\nDogs, cats and even a rooster were blessed in celebration of the Feast of Saint Francis of Assisi.\n\nBrazil's Civil Defense and firefighting teams worked to extinguish the flames in São Paulo, and no injuries were reported.\n\nPresident Claudia Sheinbaum and Prime Minister Mark Carney's meeting is meant to kickstart a new economic bilateral relationship.\n\nInitial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.\n\nHeavy rainfall has caused river banks to burst and triggered landslides, carrying away homes and cars.\n\nOne of the world's driest deserts is transformed into a sea of wildflowers after a rare bloom.\n\nA spokesman says the Nobel Committee placed \"politics over peace\" in awarding the coveted award to Venezuela's opposition leader.\n\nMaria Corina Machado called on Donald Trump directly to help her country which continues to be at crisis.\n\nMachado is recognised for \"tireless work promoting democratic rights\" in Venezuela, the Nobel Committee says.\n\nThe ousting of President Dina Boluarte follows a string of scandals and growing outrage over crime in Peru.\n\nA large group of people threw rocks at Daniel Noboa's car, which bears \"signs of bullet damage\", an official says.\n\nAuthorities are investigating the source of the tainted drinks, which have affected more than 200 people.\n\nThe makers of Colombia's popular mochila bags can earn good money, but are at risk of being underpaid.",
  "url": "https://www.bbc.com/news/world/latin_america",
  "scraped_timestamp": "2025-10-11T23:47:07.342455",
  "content_length": 3077,
  "word_count": 490,
  "source_domain": "www.bbc.com"
}