{
  "title": "NewsNews",
  "content": "Officials say 380,000 consumers in Kyiv are without power, with emergency outages in place across Ukraine.\n\nThe US First Lady has been directly engaged in diplomacy in Russia, pleading for the protection of children.\n\nThe Ukrainian leader says British-made microcomputers were used in weapons launched at Ukraine this weekend.\n\nRussia says it carried out an overnight strike on Ukrainian military and infrastructure targets.\n\nPreliminary reports indicate that train staff and passengers were at the site of the strike, he says.\n\nThe US First Lady has been directly engaged in diplomacy in Russia, pleading for the protection of children.\n\nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.\n\nWednesday's attack comes days after a similar strike caused mass power cuts.\n\nThe Ukrainian leader says British-made microcomputers were used in weapons launched at Ukraine this weekend.\n\nUkraine has attacked refineries deep inside Russia, with Zelensky vowing to continue the strikes.\n\nHow Russia's gradual gains in the face of fierce Ukrainian opposition have affected the front line in recent months.\n\nWhether the drone incursion was deliberate or accidental, Moscow will be watching Nato's response to it closely.\n\nA new law says men under the age of 23 can now leave the country. But why has Ukraine brought it in?\n\nUkraine says Russia deliberately hit the main government building in Kyiv with a missile last Sunday.\n\nBoth Ukraine and Russia use AI in battle, but removing human decision-making comes with risks.\n\nSatellite images show the house where the BBC's Vitaly Shevchenko grew up could now be a Russian base.\n\nSome 10,000 Ukrainian inmates have signed up to escape jail, but not all will live to see freedom.\n\nRussia imprisoned Dmytro shortly after its invasion of Ukraine in 2022. He was freed last month.\n\nIn Bilozerske, eastern Ukraine, people must make the agonising decision to flee or risk staying.\n\nYour questions answered on UN peacekeepers and Russian defence treaties\n\nZelensky, due to visit Washington this week, wants long-range missiles to hit back at Russia - and Donald Trump says he may send Tomahawks.\n\nJohn Lawson travelled to Lviv in September to deliver aid when Russia launched an attack.\n\nCharities have sent a total of nine ambulances in recent months packed with aid and essentials.\n\nGujarat’s Sahil Majothi joined the Russian army to avoid jail over alleged drug charges.\n\nThe US First Lady has been directly engaged in diplomacy in Russia, pleading for the protection of children.\n\nAlexander Stubb has become a key voice for Europe at the White House amid the Ukraine war.\n\nThe UK, France and Germany are \"united\" in wanting to use the full value of frozen Russian assets to end the war, Sir Keir Starmer said.\n\nOfficials say 380,000 consumers in Kyiv are without power, with emergency outages in place across Ukraine.\n\nBoth Ukraine and Russia use AI in battle, but removing human decision-making comes with risks.",
  "url": "https://www.bbc.com/news/war-in-ukraine",
  "scraped_timestamp": "2025-10-15T09:49:25.576606",
  "content_length": 2983,
  "word_count": 480,
  "source_domain": "www.bbc.com"
}