{
  "title": "NewsNews",
  "content": "Police believe the trailer became detached from a Mitsubishi Outlander and struck a pram on the pavement.\n\nAround 3000 athletes will compete for 215 gold medals at the Commonwealth Games next summer after the Glasgow 2026 schedule is confirmed.\n\nCameron McGerr lost both his parents and is campaigning to have life-saving first aid taught in schools.\n\nA review of the front page stories from the daily newspapers in Scotland.\n\nThe multi-agency meeting will look at ways to improve resilience and prevent future blazes.\n\nAround 3000 athletes will compete for 215 gold medals at the Commonwealth Games next summer after the Glasgow 2026 schedule is confirmed.\n\nThe woman was assaulted by two men on Sunday evening in a building in the Camelon area.\n\nThe short-eared owl was found on the Noble Patriot platform 180 miles (290km) off Shetland.\n\nCameron McGerr lost both his parents and is campaigning to have life-saving first aid taught in schools.\n\nThe SNP are not only hopeful of victory at next year's Scottish election, but are even talking of an outright majority.\n\nRangers compile a new shortlist containing more than two candidates after Steven Gerrard rules himself out of the running for the vacant head coach's role.\n\nThe announcement came during the first minister's keynote speech at the SNP conference in Aberdeen.\n\nAren Pearson allegedly killed Claire Leveque - who was 24 and originally from Canada - in Shetland.\n\nThe owners chopped down dozens of trees - including an oak - prompting scores of complaints on social media.\n\nA selection of photographs submitted to BBC Scotland News from around the country this week.\n\nThe rotors, first used in 1925 on a journey to Scotland, are being revived to help emissions in shipping.\n\nAnd Chris Mason on major parties receiving a 'kick in the whatsits'.\n\nMark Hutchinson was only 52 when he died unexpectedly last year after suffering two strokes \"out of the blue\".\n\nParty leader John Swinney's strategy is to focus on winning a majority of MSPs at next year's election.\n\nOfficers carried out searches in Bonnyrigg and at addresses in Dumfries and Galloway.\n\nThe multi-agency meeting will look at ways to improve resilience and prevent future blazes.\n\nThe short-eared owl was found on the Noble Patriot platform 180 miles (290km) off Shetland.\n\nPolice believe the trailer became detached from a Mitsubishi Outlander and struck a pram on the pavement.\n\nThe woman was assaulted by two men on Sunday evening in a building in the Camelon area.\n\nAround 3000 athletes will compete for 215 gold medals at the Commonwealth Games next summer after the Glasgow 2026 schedule is confirmed.\n\nRangers compile a new shortlist containing more than two candidates after Steven Gerrard rules himself out of the running for the vacant head coach's role.\n\nEx-Scotland captain Stuart Hogg, who pleaded guilty to domestic abuse of his ex-wife, says retiring to save his marriage was the \"biggest mistake\" of his life.\n\nFormer Manchester United midfielder Paul Scholes hints Rangers have held talks with Ole Gunnar Solskjaer, with key Ibrox figures split over whether to progress talks with another managerial candidate.\n\nDanny Rohl appears to be the frontrunner for the Rangers job. We examine whether he would be a good fit - or just more of the same.\n\nBig stories from across the country\n\nThe BBC's Scottish news podcast.\n\nMore from the day’s top stories and communities across Scotland.\n\nThe nation's morning news programme.\n\nA review of the front page stories from the daily newspapers in Scotland.\n\nExperienced shipbuilder Duncan Anderson will take on the role on an interim basis.\n\nThe announcement came during the first minister's keynote speech at the SNP conference in Aberdeen.\n\nEnergy company SSEN Transmission said it would replace the overhead power line between Dunoon and Loch Long.\n\nA review of the front page stories from the daily newspapers in Scotland.\n\nThe rotors, first used in 1925 on a journey to Scotland, are being revived to help emissions in shipping.\n\nA review of Scotland's newspaper front pages.\n\nThe first minister will declare a mandate for a second independence referendum, if the SNP wins a majority of seats in the 2026 Holyrood election.\n\nA review of Scotland's newspaper front pages.",
  "url": "https://www.bbc.com/news/scotland",
  "scraped_timestamp": "2025-10-14T16:00:16.496039",
  "content_length": 4253,
  "word_count": 694,
  "source_domain": "www.bbc.com"
}