{
  "title": "NewsNews",
  "content": "Trump's Middle East visit was a victory lap - but peace does not emerge just because a president decides it.\n\nA major hostage and prisoner exchange marks a significant step towards ending two years of war in Gaza.\n\nThe United Nations Development Programme (UNDP) says over 80% of all buildings in the territory are destroyed or damaged.\n\nAt least 27 people have been killed in one of the most violent internal confrontations since Israeli troops withdrew.\n\nThe Israeli military says 20 living hostages have been released by Hamas and have returned to Israel.\n\nA major hostage and prisoner exchange marks a significant step towards ending two years of war in Gaza.\n\nRotem Cooper, whose father Amiram's body has not been returned, calls on mediators to put pressure on Hamas to release the remaining bodies.\n\nBipin Joshi tried to save fellow Nepalese students before being taken hostage, his mourning friend tells the BBC.\n\nThe United Nations Development Programme (UNDP) says over 80% of all buildings in the territory are destroyed or damaged.\n\nThe US president says the ceasefire will hold and the second phase of negotiations for a lasting peace are under way.\n\nThe US president's single-day tour was a victory lap rather than an exercise in setting out detail, writes the BBC's Tom Bateman.\n\nAll living Israeli hostages have returned home and a ceasefire is in place. What happens next in Gaza?\n\nFor the first time since the Hamas attacks on Israel two years ago, there is a realistic chance of ending the horrors\n\nTrump's unique style and his relationships with key players helped but there were also factors beyond his control.\n\nPeople in Tel Aviv describe how they feel, after all remaining living hostages are released by Hamas.\n\nThousands of people gather in Gaza and the West Bank to welcome Palestinian prisoners and detainees freed by Israel.\n\nFamilies say it ends \"two years of hell\" and a journey of \"healing and rehabilitation\" will now begin.\n\nVideo released by the Israeli military shows Mor smiling and embracing two relatives.\n\nIsrael says it has released 1,968 prisoners and detainees as part of a ceasefire deal with Hamas.\n\nIsrael warns it will restrict aid convoys into Gaza because of delays returning the remaining bodies.\n\nCBS News, the BBC's US partner, conducted an exclusive interview with the Israeli prime minister in a hospital tending to freed hostages.\n\nThe first four deceased hostages to be returned are Guy Illouz, Bipin Joshi, Yossi Sharabi and Daniel Peretz.\n\nTrump's Middle East visit was a victory lap - but peace does not emerge just because a president decides it.\n\nRotem Cooper, whose father Amiram's body has not been returned, calls on mediators to put pressure on Hamas to release the remaining bodies.\n\nThe United Nations Development Programme (UNDP) says over 80% of all buildings in the territory are destroyed or damaged.\n\nBipin Joshi tried to save fellow Nepalese students before being taken hostage, his mourning friend tells the BBC.\n\nPeople in Tel Aviv describe how they feel, after all remaining living hostages are released by Hamas.\n\nThe US president's single-day tour was a victory lap rather than an exercise in setting out detail, writes the BBC's Tom Bateman.",
  "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
  "scraped_timestamp": "2025-10-15T10:25:27.799659",
  "content_length": 3220,
  "word_count": 531,
  "source_domain": "www.bbc.com"
}