{
  "title": "NewsNews",
  "content": "Both the Tories and Liberal Democrats are calling on the government to publish evidence it submitted in the now-collapsed case.\n\nThe PM says the Gaza deal belongs to Trump - but insists the UK played a key role behind the scenes.\n\nThe energy secretary says the UK's reliance on fossils fuels is a major \"weakness\" in a conference speech.\n\nBut the UK is also predicted to suffer the highest rate of inflation in the G7 both this year and next.\n\nThe tougher rules will come in force in January as part of wider plans to cut immigration.\n\nThe PM says the Gaza deal belongs to Trump - but insists the UK played a key role behind the scenes.\n\nThe Council of Europe's human rights commissioner warns the government about policing of demonstrations.\n\nEx-Lords speaker Baroness D'Souza complained to Sir Mark Rowley she could lose her licence after a speeding fine.\n\nThe energy secretary says the UK's reliance on fossils fuels is a major \"weakness\" in a conference speech.\n\nSteve Reed said he was \"horrified\" that women were barred from mosque-run London charity event.\n\nThe former education secretary tells the Covid inquiry there was a \"lack of seriousness\" in government.\n\nThe Reform UK leader has described the threats made in a TikTok video as \"pretty chilling\".\n\nThe former PM is among those in favour of targeted screening for men most at risk, but some medical experts are sceptical.\n\nTrump's Middle East envoy also says the UK played a \"vital role\" in the peace agreement.\n\nThe government is facing questions about why the case collapsed just weeks before a trial was due to go ahead.\n\nThere is a renewed emphasis on independence as the party meets less than a year before the Scottish election.\n\nKemi Badenoch says a future Conservative government would scrap stamp duty, but what might the impact be?\n\nSome experts think the government may break its promise not to increase income tax, NI or VAT for working people.\n\nA guide to the politicians competing in, arguably, the most interesting devolved Welsh by-election.\n\nThe SNP are not only hopeful of victory at next year's Scottish election, but are even talking of an outright majority.\n\nThe Tory leader's conference speech included a new pledge to scrap stamp duty on the purchase of main homes.\n\nThe Conservative Party, so often and for so long the dominating force in British politics, is a shrivelled version of its usual self.\n\nAgainst the backdrop of grief after the Manchester attack, there is debate about which tenets should be fundamental in our society, writes Chris Mason.\n\nWith this speech, the prime minister reminded his internal critics who won Labour's whopping majority in the election 15 months ago.\n\nAs the party's annual conference begins, there are reasons for the current leadership to be gloomy, writes Laura Kuenssberg.\n\nAhead of Labour's annual conference, Laura Kuenssberg talks to ministers, MPs and advisers about Starmer's position.\n\nHow did we reach a point where the UK is being compared to a 'tin pot Third World dictatorship'?\n\nMonths of preparations have gone into this state visit - but the Lord Mandelson question is not the only concern troubling insiders.\n\nThe start of this political season has been wild, writes Laura Kuenssberg, and Labour now has Reform UK breathing down its neck.\n\nEducation Secretary Bridget Phillipson says it's unacceptable that Jewish young people feel they need to conceal their identity on campus.\n\nThe sudden death of Hefin David triggered a by-election in Caerphilly.\n\nKemi Badenoch made the announcement at the parties conference in Manchester during her first keynote speech as Conservative Party leader.\n\n'The vibe is flat' at Conservative Party conference",
  "url": "https://www.bbc.com/news/politics",
  "scraped_timestamp": "2025-10-15T09:49:34.492468",
  "content_length": 3683,
  "word_count": 608,
  "source_domain": "www.bbc.com"
}