{
  "title": "Next steps for Israel and Gaza unclear after hostage and detainee release",
  "content": "• The next steps for Israel and Gaza areunclear, even as US President Donald Trump hailed the end of the war and took a victory lap for the ceasefire deal. Despite thesigning of an agreementto seek peace in the Middle East, there is no sign of when high-level talks on next steps will take place and key pointsremain unresolved.\n\n• Bereaved families have said they were “shocked and dismayed” after the bodies of onlyfour hostageswere returned from Gaza. This came after the first phase of the deal succeeded in securing the return of all20 living hostagesto Israel on Monday, as well as the release of more than1,700 Palestinian detaineesand 250 prisoners.\n\n• In Gaza itself, the World Food Programme (WFP) saidit aims to scale up aid supplies into the enclaveby end of today by restoring passage through more border crossings.\n\nFormerhostages and hostage families have reacted to the formal identification of deceased hostages, saying they hoped the return of their loved ones would bring closure after more than two years of uncertainty.\n\nThe Hostages and Missing Families Forum said in a statement that they “embrace the families of Guy Illouz and Bipin Joshi, along with two additional families whose loved ones were recently returned for proper burial.”\n\n“Alongside the grief and the understanding that their hearts will never be whole, the return of Guy and Bipin, may their memories be a blessing, together with two additional deceased hostages, brings some measure of comfort to families who have lived with agonizing uncertainty and doubt for over two years,” the statement continued.\n\nThe group also said that they “will not rest until all 24 hostages are brought home.”\n\nIllouz and Joshi’s names were on thelist from Hamasof four bodies it was returning to Israel on Monday. The hostage families had not expected all of the bodies to be handed over yesterday but was “shocked and dismayed” that the number was so small.\n\nA spokesperson for the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) in Gaza said the ceasefire has brought hope to people in the enclave as aid deliveries begin to arrive.\n\n“The scale of destruction is really staggering. But amid all of this, people have this ray of light,” Olga Cherevko told CNN’s Rosemary Church.\n\n“It’s a moment of a lot of hope, in which people can finally look forward to something and discuss their future. Something that they weren’t able to do for a long, long time.”\n\nCherevko said aid trucks were crossing into Gaza for hours at a time for the first time in over seven months — whenIsrael ordered a total blockade on suppliesentering the enclave.\n\nShe said OCHA’s assistance plan is in action despite infrastructure damage making it a difficult task. “This is going to be a very long journey… Things are not going to be easy.”\n\nCherevko said that OCHA will focus on the most vulnerable in Gaza for the first 60 days, aiming to provide nutrition treatment and assistance to half a million people, and water and sanitation programs for 1.4 million people.\n\nAnother focus for OCHA in the coming weeks is education, as Palestinian children have been without school for more than two years.\n\n“We’re reopening temporary learning centers to make sure kids have a chance to be kids again, go back to school, learn and do the things that they normally would do here.”\n\nUS President Donald Trump has touched down in Washington, DC, after returning from yesterday’s whistle-stop trip to the Middle East, as this footage above shows.\n\nHe spoke to reporters on Air Force One, where he declined to directly address whether he supports recognizing a Palestinian state.\n\nAs we’ve reported, Trump and several other world leaders signeda Gaza ceasefire dealduring a summit in Egypt yesterday.\n\n“I’m not talking about single state or double state or two state, we’re talking about the rebuilding of Gaza,” Trump told reporters aboard Air Force One during his return flight from the Middle East. “A lot of people like the one-state solution. Some people like the two-state solutions. We’ll have to see,” he said, adding, “I haven’t commented on that.”\n\nEgyptian President Abdel Fattah el-Sisi, speaking at the summit ahead of Trump, emphasized the urgency of the moment, calling it a “unique, perhaps last, historic opportunity to achieve a Middle East free of anything that threatens its stability and progress.” He reaffirmed that a two-state solution “must be achieved in a manner that ensures ensures our shared vision of embodying joint cooperation among the peoples of the region, and cooperation among all countries.”\n\nTrump’s reluctance to weigh in comes just weeks after he criticized growing international support for Palestinian statehood.\n\nLast month during a speech at the United Nations General Assembly, the US president referred to the momentum behind a two-state solution as a “reward” for Hamas.\n\nHostages Bipin Joshi and Guy Illouz, whose bodies were released by Hamas and handed over to Israeli authorities on Monday, have been formally identified.\n\nFour of the 28 deceased hostages were returned to Israel after the 20 living hostages were released earlier on Monday.\n\nThe IDF said the other two deceased hostages that were transferred in coffins Monday had been formally identified but was waiting for their families’ permission before releasing their names – although Hamas named them yesterday as Daniel Peretz and Yossi Sharabi.\n\nThe Israel Defense Forces (IDF) assessed that Joshi was killed in captivity during the first months of the war, but said that “final conclusions will be determined” following a complete post-mortem at the National Center of Forensic Medicine.\n\nJoshi, a 23-year-old Nepali student, was working at a farm in kibbutz Alumim in southern Israel when he was kidnapped by Hamas-led militants on October 7, 2023.\n\nIllouz, the IDF said, died from his wounds after not receiving proper medical treatment while in Hamas captivity.\n\nHe was 26 when he was kidnapped from the Nova music festival.\n\nThe Israel Defense Forces (IDF) has said it opened fire in Gaza after observing multiple individuals crossing the “yellow line” — the initial Israeli withdrawal line as shown on a ceasefire map released by the White House.\n\nIt marked the first known instance of Israel opening fire in Gaza since the truce took effect.\n\n“Earlier today (Tuesday), several suspects were identified crossing the yellow line and approaching IDF troops operating in the northern Gaza Strip, which constitutes a violation of the agreement,” the military said in a statement.\n\n“Attempts were made to distance the suspects. The suspects did not comply and continued approaching the troops, who opened fire to remove the threat.”\n\nThe Israeli military called on Gaza residents to adhere to instructions and avoid approaching deployed troops in the area.\n\nFor a few fleeting moments as the world’s attention turned to a global summit in the small Egyptian resort town of Sharm el-Sheikh, there was hope that US President Donald Trump might give clarity to his plan for “peace in the Middle East.”\n\nBut the US leader left the region with the same unanswered questions as when he arrived.\n\nThe first phase of Trump’s Gaza plan succeeded yesterday, securing the release of hostages, freeing Palestinian prisoners and stopping the fighting in Gaza. The more complex second phase, dismantling Hamas and determining Gaza’s governance – has yet to be negotiated.\n\nAmong the pressing issues: what the next phase of negotiations on Gaza will look like; who will make up the multinational force to keep the peace and what its mandate is; and whether a Palestinian state will ever be formed.\n\nThat such a large summit could even be organized as quickly as it was underlined the eagerness of key Arab countries to keep up the momentum for diplomacy and keep Trump engaged.\n\nBut amid the haste, the summit was clouded by vagueness. Vagueness about the conference’s agenda, about what Trump planned to announce, and even as to who the participants would be.\n\nReadhere for the full analysis.\n\nThe World Food Programme (WFP) aims to scale up aid supplies into Gaza by restoring passage through more border crossings by the end of Tuesday, its director told CNN.\n\nOnly two of the seven border crossings into Gaza have been available for the delivery of food, water and medical supplies since the ceasefire came into place on Friday, Antoine Renard, WFP representative and country director, told CNN.\n\n“I hope that today we’ll have all the crossings open and we’re (doing) everything to make it happen,” Renard said.\n\nHe said access through other crossings had been hindered by unexploded ordnance and damaged infrastructure, but his colleagues are scrambling to clear roads for trucks to pass through.\n\nUS President Donald Trump hailed a “historic dawn of a new Middle East” in his address before the Israeli parliament yesterday — but there are still several unresolved aspects of his 20-point ceasefire plan.\n\nTrump also co-hosted a Gaza summit in Egypt attended by more than two dozen world leaders, where he co-signed an agreement with ceasefire mediators to work toward peace in the region.\n\nSome of the sticking points include how the largely destroyed Gaza Strip will be governed after the war, as well as how Hamas’ disarmament and Israel’s withdrawal from Gaza will be carried out.\n\nThe full withdrawal of the Israeli military is contingent on Hamas’ disarmament, according to the agreement, leaving some wiggle room for Israeli Prime Minister Benjamin Netanyahu to say his country has the freedom to resume fighting.\n\nHamas’ chief negotiator, Khalil al-Hayya, said last week that the group has received guarantees from the US and international mediators that this deal means “the war has ended permanently,” rather than representing a temporary ceasefire. But it’s not clear in what form those guarantees came.\n\nA key unanswered question is what will happen to Hamas, according to Burcu Ozcelik, senior research fellow for Middle East security at the Royal United Services Institute (RUSI), a British think tank.\n\n“You have what looks like a pathway to Palestinian statehood … but this, ultimately, is a Palestinian state that does not seem to have any place for Hamas. To what extent Hamas will agree to this and comply with this in the weeks and months to come – I think that is a big question,” Ozcelik told CNN.\n\nThe remains of only four out of 28 dead hostages were returned from captivity yesterday, to the anguish of those still hoping to start the process of closure.\n\nWhile the public did not expect all of the bodies to return on Monday, the Hostages and Missing Families Forum said it was “shocked and dismayed” by the news that only four would be released.\n\nHamas released four bodies, naming Daniel Peretz, Yossi Sharabi, Guy Illouz and Bipin Joshi as the hostages whose remains were handed over.\n\nUnder the agreement brokered by the US, Hamas and its allies were meant to release all of the remaining hostages, alive and dead, within 72 hours of the ceasefire being announced.\n\nBut, as CNN reported last week, Israel has assessed that Hamasmay not be able to find and returnall the remaining dead hostages in Gaza.\n\nSo what will happen to the bodies of hostages that Hamas can not find?\n\nAn international committee will help locate the bodies that Hamas may be unable to find, Shosh Bedrosian, a spokesperson for Israel’s Prime Minister’s Office said Sunday.\n\nIt is unclear what that taskforce will look like at this time.\n\n“The Prime Minister (Benjamin Netanyahu) insists that we will act to locate all of these hostages as soon as possible, and we will do that as a sacred duty of communal responsibility,” Bedrosian said.\n\nWelcome back to our coverage of events in the Middle East.\n\nThe last 20 living hostages held in Gaza werereleasedyesterday, tearfully reuniting with their families as world leaders gathered in Egypt to discuss the future of Gaza and the next phases of the US-brokered ceasefire deal.\n\nMore than 1,700 Palestinian detaineesreleased by Israel as part of the deal returned to jubilant crowds in Gaza. Israel also released 250 Palestinians serving long-term sentences, with some returning to the West Bank and over 150deported to Egypt.\n\nHours later, US President Donald Trump was joined bymore than two dozen world leadersin Egypt, where he co-signed an agreement with ceasefire mediators to aim for peace in Gaza.",
  "url": "https://edition.cnn.com/world/live-news/israel-gaza-ceasefire-deal-hostages-10-14-25",
  "scraped_timestamp": "2025-10-14T16:33:06.530607",
  "content_length": 12426,
  "word_count": 2045,
  "source_domain": "edition.cnn.com"
}