{
  "title": "Nor’easter set to slam East Coast with heavy rain and power outages; DC braces for impact",
  "content": "A powerful Nor’easter is hitting theEast Coastthis weekend, bringing sheets of rain, howling winds, and flooding. Fox Weather reports that the slow-moving storm is stretching from the Carolinas to Maine, putting tens of millions under rough skies. Travel disruptions are expected, and cities like Washington, D.C., Philadelphia, and New York could be dealing with outages before the storm is over.\n\nFox Weather says the system will drag through Sunday, keeping the rain and wind locked in before slowly backing off.\n\nAlso read:Nor'easter set to cause coastal flooding and disrupt air travel around US, New Jersey declares state of emergency\n\nInWashington, forecasters expect anywhere from half an inch to an inch and a half of rain. The heavier stuff will hit east of the bay. Winds are expected to be around 15 to 20 miles an hour, but they will increase in speed through the night. By Sunday, gusts near 40 mph are likely.\n\nFlooding is a concern for neighborhoods near thePotomacand Anacostia Rivers, especially at high tide. Outdoor plans for Saturday, including Snallygaster, should still hold up. The storm’s core will not arrive till later. Constant rain, stronger winds, and traffic snarls across the region are expected on Sunday, as per Fox Weather.\n\nEarly Sunday morning, heavy rains will lash the East Coast. Onshore winds will push hard, at 20 to 25 mph, with 40 mph gusts along the coast.\n\nThe runners participating in the Army Ten-Miler will face slick pavement and near-zero visibility. Water levels could rise one to two feet higher than usual along the Potomac and Anacostia.\n\nAlso read:Optical Illusion: Only eagle-eyed can spot hidden cat in this viral Reddit post in 15 seconds?\n\nBy Monday, the storm will shift offshore. Skies will stay cloudy, and a few showers might persist, but things will finally start improving by evening.\n\nFox Weather says the Commanders game should go on under cool, overcast skies, with no major rain by kickoff.\n\nThis Nor’easter is one of the stronger early-season storms of 2025, as per Fox Weather, with flooding, power outages, and travel disruptions up and down the East Coast. Power crews are on alert, and local officials are telling residents to watch forecasts and steer clear of high water till it is safe.\n\nThe storm is expected to linger through Sunday, with gradual improvement by Monday.\n\nGusts could reach 40 mph in parts of the D.C. area and along the coast.\n\nCoastal and low-lying spots near the Potomac and Anacostia Rivers may see minor flooding.\n\nSaturday events may proceed, but Sunday’s weather will likely cause disruptions.",
  "url": "https://www.hindustantimes.com/world-news/us-news/noreaster-set-to-slam-east-coast-with-heavy-rain-and-power-outages-dc-braces-for-impact-101760199704746.html",
  "scraped_timestamp": "2025-10-11T23:46:03.554396",
  "content_length": 2595,
  "word_count": 426,
  "source_domain": "www.hindustantimes.com"
}