{
  "title": "Nor'easter set to cause coastal flooding and disrupt air travel around US, New Jersey declares state of emergency",
  "content": "A nor'easter, a powerful coastal storm, is forming off the Southeast US and is expected to bring treacherous seas, torrential rain, and tropical hurricane-force wind gusts to most of theEast Coastuntil the first part of next week.\n\nAs it intensifies and shifts north, the storm will be quite powerful. Aside from the heavy rain and perhaps destructive wind, it will cause significant coastal flooding that could flood houses and roads and erode beaches.\n\nStrong winds are predicted to cause delays and cancellations by Monday, making it an absolute nightmare for air travel in key hubs like Boston, New York City, Washington, andWashington, DC.\n\nNor'easter: New Jersey declares state of emergencyActing Governor Tahesha Way declared on Friday that a state of emergency would be imposed on New Jersey Saturday night in anticipation of the storm's most devastating effects.In a statement, Way urged all residents ofNew Jerseyto act with caution, keep an eye on local weather warnings and predictions, research about evacuation procedures, and avoid driving unless absolutely required.In certain areas of the Southeast, the nor'easter has already caused some effects, pushing Friday's highest tides of the month even higher. In Charleston, South Carolina, officials made some city parking facilities free and advised residents in low-lying neighborhoods to relocate their cars as seawater poured ashore.Climate change is intensifying the strongest nor'easters, which can occur at any time of year and typically bring torrential rain instead of snowstorms in the winter.Also Read:Who is Tylar Jarod Goodloe? 18-year-old Mississippi town shooting suspect's photo surfaced, manhunt underway\n\nActing Governor Tahesha Way declared on Friday that a state of emergency would be imposed on New Jersey Saturday night in anticipation of the storm's most devastating effects.\n\nIn a statement, Way urged all residents ofNew Jerseyto act with caution, keep an eye on local weather warnings and predictions, research about evacuation procedures, and avoid driving unless absolutely required.\n\nIn certain areas of the Southeast, the nor'easter has already caused some effects, pushing Friday's highest tides of the month even higher. In Charleston, South Carolina, officials made some city parking facilities free and advised residents in low-lying neighborhoods to relocate their cars as seawater poured ashore.\n\nClimate change is intensifying the strongest nor'easters, which can occur at any time of year and typically bring torrential rain instead of snowstorms in the winter.\n\nAlso Read:Who is Tylar Jarod Goodloe? 18-year-old Mississippi town shooting suspect's photo surfaced, manhunt underway\n\nNor'easter impactThe coast ofNorth Carolinamay see up to half a foot of rain beginning on Saturday, along with violent winds of up to 45 mph. In addition, the nor'easter will exacerbate the current beach erosion in the state's Outer Banks, where strong wave action and erosion from recent storms have caused at least nine vacant houses to crumble into the Atlantic since September 30.With a couple inches of rain expected along the remainder of the mid-Atlantic coast and into southernNew England, destructive weather is expected to move further north on Sunday and Monday. There could be isolated flash flooding in any places that receive several rounds of this torrential rain.Strong winds are expected to accompany the rain, with extended gusts of 40 to 50 mph. Much of the Southeast and portions of the mid-Atlantic coast will see their maximum winds later Saturday or early Sunday. Some of the greatest gusts, reaching 60 mph, are expected to hit southern New England and New Jersey on Sunday and Monday. Despite not being a tropical cyclone, these wind gusts are just as powerful as those produced by one.These powerful gusts could cause power outages in coastal locations. Additionally, winds that are less strong but still perceptible ought to travel farther inland to locations with higher population densities.\n\nThe coast ofNorth Carolinamay see up to half a foot of rain beginning on Saturday, along with violent winds of up to 45 mph. In addition, the nor'easter will exacerbate the current beach erosion in the state's Outer Banks, where strong wave action and erosion from recent storms have caused at least nine vacant houses to crumble into the Atlantic since September 30.\n\nWith a couple inches of rain expected along the remainder of the mid-Atlantic coast and into southernNew England, destructive weather is expected to move further north on Sunday and Monday. There could be isolated flash flooding in any places that receive several rounds of this torrential rain.\n\nStrong winds are expected to accompany the rain, with extended gusts of 40 to 50 mph. Much of the Southeast and portions of the mid-Atlantic coast will see their maximum winds later Saturday or early Sunday. Some of the greatest gusts, reaching 60 mph, are expected to hit southern New England and New Jersey on Sunday and Monday. Despite not being a tropical cyclone, these wind gusts are just as powerful as those produced by one.\n\nThese powerful gusts could cause power outages in coastal locations. Additionally, winds that are less strong but still perceptible ought to travel farther inland to locations with higher population densities.",
  "url": "https://www.hindustantimes.com/world-news/us-news/noreaster-set-to-cause-coastal-flooding-and-disrupt-air-travel-around-us-new-jersey-declares-state-of-emergency-101760197940647.html",
  "scraped_timestamp": "2025-10-11T23:46:10.015527",
  "content_length": 5315,
  "word_count": 829,
  "source_domain": "www.hindustantimes.com"
}