{
  "title": "NSG hub in Ayodhya soon to counter terror: Amit Shah",
  "content": "A new hub of the National Security Guard (NSG) is being established in Ayodhya to give a “befitting response to any terror attack”, Union home minister Amit Shah announced on Tuesday\n\n“A hub will be set up in Ayodhya. At these hubs, NSG commandos will be present round-the-clock throughout the year. Around the periphery of the area, a zone will be prepared and the special composite group will always be there to give a befitting response to any terror attack. In a way, across the six hubs of the NSG(strategically spread across different zones), the force will be there to protect the country. Additionally, at the NSG’s headquarters in Manesar, training will be conducted for the counterterrorism forces of the country,” he said at the 41st Raising Day of the anti-terror commando force at its headquarters in Manesar, Haryana.\n\nHe added that the Narendra Modi government would soon introduce major reforms to strengthen the elite commando force’s operational capabilities.\n\nThe Ram Temple in Ayodhya is one of the most vulnerable and secured religious sites in the country. Earlier this year, following Operation Sindoor, the CRPF (the force guards the temple along with UP police) had also conducted another security survey and fixed the critical gaps.\n\nThis will be the sixth regional hub of the National Security Guard (NSG) after the existing hubs of Mumbai, Chennai, Kolkata, Hyderabad and Gandhinagar. The force also has a small unit called “task force” in Jammu. The hubs were opened in 2009 post the 26/11 Mumbai attacks, when the then government was criticised for failing to airlift NSG commandos on time, and the lack of regional hubs in vulnerable locations.\n\nOfficials in NSG and in the Uttar Pradesh government, who asked not to be named, said that the hub is likely to start by end of this year or early next year, for which the UP government has allotted 8 acres of land. On July 4, 2025, the UP government, citing enhanced security requirements, allotted the land in Ayodhya Cantonment for the NSG hub. The decision was taken in a cabinet meeting chaired by chief minister Yogi Adityanath.\n\nAlso on Tuesday, Shah inaugurated the ground breaking ceremony for the Special Operations Training Centre (S.O.T.C.) within the NSG’s Manesar campus. The Centre, which is being built on 8 acres of land at a cost of Rs. 141 crore, will provide state-of-the-art training to special commandos combating terrorism. “At the S.O.T.C, not only NSG personnel but also anti-terror units established within police forces across the country will be trained with cutting-edge technology to prepare them for the fight against terrorism. In a vast country like India, the central government alone cannot tackle terrorism; rather, all state governments, special units of state police forces, NSG, and all Central Armed Police Forces (CAPFs) must work together to ensure the country’s safety. He added that this S.O.T.C will, in the coming days, sharpen the nation’s fight against terrorism and keep our forces ever-ready,” Shah said.\n\nNSG, India’s elite counterterror force, is used only in exceptional circumstances. NSG commandos are selected from the Army, the Central Armed Police Forces (CAPFs) and state police. NSG personnel have been deployed during the 26/11 Mumbai attack and the 2016 Pathankot attack.",
  "url": "https://www.hindustantimes.com/india-news/nsg-hub-in-ayodhya-soon-to-counter-terror-amit-shah-101760468934323.html",
  "scraped_timestamp": "2025-10-15T09:43:17.536811",
  "content_length": 3310,
  "word_count": 537,
  "source_domain": "www.hindustantimes.com"
}