{
  "title": "Nuclear capable, 5000 km range: India successfully test-fires Agni-5 in big boost for country’s defence",
  "content": "India has successfully carried out the test-firing of its Intermediate Range Ballistic Missile, Agni-5, in Odisha’s Chandipur on Wednesday.\n\nIn an official statement, the Ministry ofDefencesaid, “Intermediate Range Ballistic Missile ‘Agni 5’ was successfully test-fired from the Integrated Test Range, Chandipur in Odisha on August 20, 2025.”\n\nSuccessful test-firing of ‘Agni 5’ Intermediate Range Ballistic MissileIntermediate Range Ballistic Missile ‘Agni 5’ was successfully test-fired from the Integrated Test Range, Chandipur in Odisha on August 20, 2025The launch validated all operational and technical…\n\n“The launch validated all operational and technical parameters. It was carried out under the aegis of the Strategic Forces Command,” it added.\n\nAgni-5 is nuclear payload missile that reportedly has a range of over 5,000 km.\n\nThe test-fire comes more than a year after the country saw the successful flight test of the home-made missile under mission ‘Divyastra’ or the ‘weapon of the Gods’. In March 2024, the missile laden with multiple warhead capability was launched to the skies from Dr APJ Abdul Kalam Island off the Odisha coast.\n\nThe Defence Research and Development Organisation (DRDO) had then said the missile was equipped with Multiple Independently Targetable Re-Entry Vehicle (MIRV) capability.\n\n“Various Telemetry and radar stations tracked and monitored multiple re-entry vehicles. The mission accomplished the designed parameters,” it added.\n\nThe nuclear-capable Agni 5 reportedly has a rage of about 5,000-7,000 km, which means it can strike whole of China, including some parts of Europe. India has been test-firing the Agni 5 since 2016, a report stated. However, the missile has not been deployed yet.\n\nNew Delhi already has Agni 1 (700-1,200 km range), Agni 2 (2,000-3,000 km), Agni 3 (3,500-5,000) and Agni 4 (3,000-4,000) in its arsenal. Apart from this, Agni 6 (7,000-10,000) is also said to be in the developmental stage.\n\nThe test comes at a time when India has stepped up its efforts to focus and work in the direction of ‘Aatmanirbharta’ (self reliance), especially after the US levied heavy tariffs on Indian imports to America. Prime Minister Narendra Modi, during his Independence Day speech urged people to be “vocal for local”, and pledge to use products made by Indians within the country.\n\nNotably, defence sectors is one of the areas where India has been heavily dependence on imports. However, for the last decade, the intensified research and development has led to a decline in imports. Moreover, New Delhi has also starting selling the defence tech like the Brahmos missile, which reportedly played a significant role during India’s Operation Sindoor against Pakistan.",
  "url": "https://www.financialexpress.com/business/defence/agni-5-successfully-test-fired-india-chandipur-odisha-icbm-nuclear-capable-range/3952599/",
  "scraped_timestamp": "2025-09-26T15:59:43.288584",
  "content_length": 2720,
  "word_count": 417,
  "source_domain": "www.financialexpress.com"
}