{
  "title": "October 10, 2025 - Israel-Hamas war",
  "content": "• Ceasefire in effect:The Israeli military said aceasefire is now in effectin Gaza, asits forces pull backin accordance with the deal approved by the government overnight.\n\n•What’s next:The72-hour periodfor therelease of the hostagesheld by Hamas has begun, and nearly 2,000 Palestinian prisoners and detainees in Israel will also be freed as part of the agreement. In a televised address, Israel’s Prime Minister Benjamin Netanyahu implied for the first time thatnot all the deceased hostagesheld in Gaza may return.\n\n•On the ground:Thousands of Palestinians have been seenwalking from the south of Gaza toward Gaza City. An Israel Defense Forces spokesperson saidtroops would still be presentin various areas of Gaza, warning people to avoid approaching them.\n\nOur live coverage of the situation in Gaza following the ceasefire agreement has concluded for the day. Please scroll through the updates below for all of Friday’s developments.\n\nThe United Nations Population Fund (UNFPA) has hundreds of trucks waiting to enter Gaza with medical supplies and hospital equipment, as well as thousands of kits to address the dire hygiene and reproductive health situation in the enclave, a Gaza-based youth program officer with the agency told CNN.\n\nAmany Haniya, who is currently based in Deir al-Balah in central Gaza, said the distribution of medical kits such as menstrual hygiene management kits and postpartum kits is essential to women and girls in the enclave. Israel’s aid blockade has deprived women of essential supplies like sanitary pads, tampons and soap, and access to clean water remains scarce.\n\nHaniya, a mother of three who’s been displaced seven times throughout the war, expressed relief with the “long-awaited” ceasefire.\n\n“This is the first time we had this calmness and peace since days and months and years,” Haniya told CNN. “Maybe my kids today will have a moment of peace to sleep without nightmares.”\n\nThough she plans to continue her studies outside the strip, Haniya said, “Gaza will stay in my heart, and I will never abandon it.”\n\nTens of thousands of Palestinians have begun to return to their homes in northern Gaza as Israeli troops withdraw. But the widespread destruction from the war lingers.\n\nWatch a report from CNN’s Jeremy Diamond below:\n\nPresident Donald Trump told reporters Friday that he thinks the Gaza peace plan will hold because countries involved in and affected by the conflict are “all tired of the fighting.”\n\n“They’re all tired of the fighting,” the president said. “Don’t forget, you had October 7, which was a horrible day, 1200 people killed, but Hamas has lost 58,000 people. That’s big retribution. That’s big retribution. People understand that.”\n\nAccording to the Ministry of Health in Gaza, more than 67,000 Palestinians have been killed since the war began following the Hamas-led attacks  two years ago.\n\n“I think they’re all tired of fighting. And this really gives the whole Middle East, this is beyond Gaza – Gaza is very important, but this is beyond Gaza, this is peace of the Middle East, and it is a beautiful thing,” he continued.\n\nThe Israeli military said a ceasefire is now in effect in Gaza, as its forces pull back in accordance with the deal approved by the government overnight.\n\nThe 72-hour period for the release of the hostages held by Hamas has now begun, and nearly 2,000 Palestinian prisoners and detainees in Israel will also be freed as part of the agreement.\n\nThe anticipated release of hostages and Palestinian prisoners in the first phase of the peace plan is the “easy part,” Israel’s ambassador to the United Nations said today, “because it is very clear what we are receiving, what we are giving in exchange.”\n\nBut, that means the more “complex part” will come next, as both sides navigate out how to implement the second phase, including demilitarization of Gaza, said Ambassador Danny Danon.\n\nRight now, a ceasefire period for the release of hostages has begun in the enclave. Hostages are expected to be handed over before the deadline Monday at 12 p.m.\n\nDanon said it is possible that could happen over the weekend. “We hope it will start even tomorrow,” he told CNN today.\n\nWhen asked if he knew who was in charge in the enclave, Danon said it is still “a war zone” and is “chaotic.” He said Hamas is in the process of “collecting the hostages” and preparing to release them.\n\nIsraeli troops have moved to new lines as part of the first phase of the peace agreement. Danon said throughout the next precarious steps, “we will still be around watching very carefully what’s happening.”\n\n“We know that we are dealing with Hamas. That is why the withdrawal of the forces of the IDF is gradual. What we did last night, we pulled back, but not completely,” he said.\n\nFamilies of Israeli hostages held prayers and Friday night dinner at Hostage Square in Tel Aviv as they awaited the return of their loved ones.\n\n“Dear people of Israel, we are in days when we need you more than ever – tense and nerve-wracking days. We are experiencing a storm of emotions. We are worried and don’t know anything beyond what you also know,” Einav Zangauker, the mother of hostage Matan Zangauker, told a crowd of supporters.\n\nThe event featured morning prayers, songs and an orchestra performance in the day.\n\nAt night, hundreds of Israelis joined hostages’ families for Shabbat dinner, an important weekly meal in Jewish and Israeli culture that marks the start of the Sabbath.\n\nPalestinian paediatricianDr. Hussam Abu Safiya, whom Israeli forces detained last year, will not be released as part of a ceasefire and hostage release agreement with Hamas, according to a source from the militant group.\n\n“The occupation refused to release Dr Hussam Abu Safiya,” a Hamas official told CNN on Friday.\n\nDr. Marwan Al Hams, the director of field hospitals in Gaza, will also not be released, the official added. The senior doctor was detained from the enclave July, according to the Palestinian Ministry of Health there.\n\nAs part of the deal reachedon Wednesday, Hamas must release the remaining 48 hostages held in the enclave — 20 of whom are believed to be alive. Israel must free 250 Palestinian prisoners who hold life sentences, as well as 1,700 Palestinians from Gaza detained after October 7, 2023.\n\nAbout Dr. Safiya:Israeli forces detained himduring a raid in December as it shut down Kamal Adwan Hospital in Beit Lahiya. At the time, Israel claimed without providing evidence that he was “suspected of being a Hamas terrorist operative.” He has not been brought before a judge, interrogated or informed of the legal grounds of his detention since March, Physicians for Human Rights Israel (PHRI) said. Just last month, PHRI said Israel hadinflicted starvation, abuse and invasive cell searches on Safiya.\n\nCNN reached out to the Israel Prison Service at the time for comment on the allegations.\n\nThis post has been updated with additional information\n\nPalestinians shared sweets, offered prayers and shouted takbir – Islamic declarations of faith – in Tal al-Hawa, Gaza City, on Friday, as they awoke to the prospect of a permanent end to Israeli hostilities.\n\nRaghad Izzat Hamouda, a 20-year-old woman displaced in the neighborhood, recalled “an indescribable feeling,” after Israel and Hamas agreed the first phrase of a ceasefire deal on Wednesday.\n\n“People are screaming with joy in the streets,” Hamouda told CNN. “Imagine that you survived the genocide that lasted for two whole years under the bombing, hunger, destruction, fear.”\n\nBut for others, feelings of euphoria were transient. Now, they are gripped by the anxiety of how they will rebuild their lives – following nearly 740 days of bombing and siege.\n\nMore than 90% of housing units in Gaza have been damaged or destroyed, the UN reported onOctober 7. Just on Friday, at least 132 bodies of Palestinians were recovered from the rubble, according to hospital officials there.\n\nJamal Al Rozzi, a Palestinian aid worker in his 50s, told CNN he fears people will struggle “when they wake up and they start to look at their lives, what they lost, what they don’t have.”\n\n“The shock will start,” said Al Rozzi, who fled the Gaza Strip to the Egyptian capital of Cairo in April of 2024.\n\n“Your children did not go to school for two years. You have just lost somebody from the family… You have no home, you have no work, no income,” he said Thursday. “The suffering could go on for years.”\n\nIsraeli security officials told CNN that 600 aid trucks will be allowed into Gaza every day as part of the ceasefire agreement’s humanitarian clause.\n\nThe trucks will come from “the UN-approved international organizations, the private sector, and donor countries,” according to the officials.\n\nThe supplies will include cooking gas, food, medical supplies, shelter supplies and more, they added.\n\nIn addition, equipment “for the repair of critical infrastructure such as water lines, sewage systems, and bakeries,” will also be allowed in, the officials said, though crucially they were unable to say when the increase in deliveries would begin.\n\nUN aid teams say they are ready to bring thousands of tons of supplies into Gaza but two UN officials in the region - from UNICEF and OCHA - told CNN on Friday the expected surge in aid deliveries following the Israeli government’s approval of the ceasefire plan had not yet materialized.\n\nThe Israeli security officials also said that Palestinians will be able to leave and enter Gaza through the Rafah crossing, with the border of Egypt.\n\nExiting Gaza through the Rafah crossing will follow “Israeli security approval” and will be under the supervision of a European Union mission, they said. The mechanism will be “similar to the January 2025 mechanism,” they said, referring to the exit pathway Palestinians took in coordination with the UN and international organizations at the time.\n\nThe ability for Palestinians to re-enter Gaza again is a new development. People who want to return to their homes in the enclave will be “subject to Israeli approval and to a specific mechanism that will be coordinated later with the Egyptian side,” the officials said.\n\nSome context:A UN-backed initiative said that Israel’s war in Gaza has pushed parts of the enclave into a “man-made famine.”\n\nIsrael disputes this and said the report was biased.\n\nHumanitarian workers told CNN last year that COGAT - the Israeli body responsible for determining what is allowed into Gaza from Israel - arbitrarily prevented essential items such as maternity kits, crutches, sanitary pads and water filtration systems from entering the Strip.\n\nUnder the terms of the ceasefire resolution, the72-hour periodfor the release of hostages held by Hamas began early this morning.\n\nForty-seven hostages remain in Gaza, with at least 20 believed to be alive. The remains of another hostage, Israel Defense Forces (IDF) soldier Hadar Goldin, have been held there since 2014, when he was killed and his body taken to the strip.\n\nA ceasefire period has begun in Gaza with Israeli troops moving tonew linesin the enclave. Information is also emerging about the release of hostages ahead of the Monday deadline.\n\nA Doctors Without Borders (MSF) emergency coordinator based in central Gaza told CNN that the psychological consequences facing the population, particularly the children, is as consequential and worthy of humanitarian attention as the physical destruction in the enclave.\n\nJacob Granger reported a permeating sense of “despair about what Gaza has become” amid cautious optimism regarding the ceasefire. He also pointed to significant behavioral changes among some of Gaza’s children as a result of a lack of shelter and schooling, characterizing it as “abnormal” and “very aggressive” in relation to their young age.\n\n“The question we have is: what will be the consequences for these children, and how can we help to reconstruct Gaza, but also its human beings.” Granger told CNN.\n\nThe MSF emergency coordinator stressed the importance of maintaining a long-term ceasefire to allow for an unimpeded entry of aid.\n\n“People here are a bit torn apart between the hope of having finally peace, and the fact that there is no Gaza, there’s no home anymore,” Granger said.\n\nUS Middle East envoy Steve Witkoff appeared to wear a yarmulke printed with the famous “Fight” image of US President Donald Trump while praying at the Western Wall today.\n\nWitkoff wore the yarmulke while visiting the wall in Jerusalem, photos from the Western Wall Heritage Foundation show. The wall is functionally the holiest site in Judaism, and visiting politicians and dignitaries often stop there to pray.\n\nThephotograph of a bloodied Trumpwith his fist raised, taken by Associated Press photographer Evan Vucci, quickly became a totem among Trump supporters after the president narrowly escaped death in July 2024. A painting of thephotographeven hangs in the foyer of the White House.\n\nThe picture has been printed on t-shirts, posters and, evidently, yarmulkes. An Etsy listingappears to match the one worn by Witkoff, with the word “FIGHT” printed in large, sans serif type above Trump’s face.\n\nWitkoff has been pictured with a similar yarmulke before. A photo from January 2025 at a Manhattan synagogue shows the envoy brandishing one with a smaller, painted image of Trump.\n\nUS forces have begun arriving in Israel as part of an effort to establish a civil-military coordination center amid the ceasefire in Gaza, a US official said.\n\nCNN reported Thursday that up to 200 US troops were going to be on the ground in Israel to monitor the Gaza plan’s implementation, though no US forces will be in Gaza. That full group of roughly 200 service members are expected to be in place by Sunday, the US official said.\n\nSome of the 200 personnel are coming from the Middle East having already been overseas, while others are coming from commands in the US, the official said. They are still scoping out sites to determine where the coordination center will be, they added, emphasizing that the effort is in the very early stages and will take time to establish.\n\n“It’s going to take some days — weeks — to full get this set up,” the official said. “This won’t happen overnight.”\n\nThe troops will be focused on assisting with the flow of humanitarian and logistical aid, as well as security assistance, into Gaza, the official said. The US service members will also be monitoring “the efforts towards achieving civilian governance in Gaza,” the official added.\n\nThe coordination center will be used by a multitude of international partners, including other countries, NGOs and private sector partners.\n\n“It’s for everyone to meet, collaborate, and coordinate so you don’t have a bunch of people flooding in trying to do right, but it’s chaos and they actually do more harm because they’re not working in the same direction and they’re not coordinating,” the official said.\n\nPresident Donald Trump is expected to convene world leaders for a summit in Egypt next week during his visit to the country, two Trump administration officials familiar with the event told CNN.\n\nThe officials said that a number of European and Arab leaders are planning to attend. Trump and his team worked on the list of attendees in conjunction with the Egyptians who are organizing the event, one of the officials said.\n\nSo far leaders from France, Germany, and Italy are expected to attend, as well as leaders from Qatar, Saudi Arabia and the UAE.\n\nIt was not immediately clear if Israeli Prime Minister Benjamin Netanyahu would be in attendance.\n\nOn Monday afternoon, the president is expected to participate in a signing ceremony for the ceasefire agreement between Israel and Hamas. Egyptian President Abdel Fattah el-Sisi, as well as the leaders of Qatar and Turkey, are expected to participate.\n\nAxioswas first to report on the summit.\n\nWe’re learning more about the 250 Palestinians serving life sentences in Israeli prisons who are set to be released under the ceasefire agreement.They have a range of affiliations.\n\nThe list states that 142 of the prisoners will be deported. The rest will return either to the occupied West Bank or East Jerusalem.\n\nFifteen hold Israeli citizenship.\n\nUNICEF’s James Elder said trauma weighs heavily on Palestinian children, and education is fundamentally critical in the effort to rebuild Gaza.\n\nThe United Nations Children’s Fund spokesperson, who has been to Gaza several times since 2023, said driving through the enclave yesterday was heartening, as children were joyous and wearing “wall-to-wall smiles.” But he said the impact of war will likely be visible for many years to come.\n\nSpeaking of the famine experienced in Gaza, Elder said that “malnourished children end up, quite frequently, being stunted. That has a cognitive decline.”\n\n“So we are looking at irreversible damage if this doesn’t stop,” he added.\n\nThe spokesperson said that the immune systems of the children have been severely compromised, describing the youngsters as “shattered.” He added that a third of all births in the first half of this year were to malnourished babies, or babies who went straight into incubators.\n\n“The level of trauma, which is unprecedented, we can’t even start to treat the post-traumatic stress disorder in children because it’s being intersected — there is no ‘post’ yet, it’s day-to-day trauma — that has to start with the classroom,” Elder said.\n\nWhile missed education is bound to affect each child, Elder stressed that the role education can play in the restoration of Gaza is crucial in elevating the quality of life for the entire population. He said, “If Gaza is to rebuild, if Palestinians are to take agency again, education is that bedrock.”\n\nIsraeli Prime Minister Benjamin Netanyahu has visited a medical center preparing for the arrival of the hostages set to be released from Gaza in the coming days, his office said today.\n\nNetanyahu visited the Sheba Medical Center at Tel HaShomer in the outskirts of Tel Aviv as part of “Operation Returning Home,” the Prime Minister’s Office said.\n\nWhile there, Netanyahu met with Israeli soldiers who were wounded in the war in Gaza, calling them “heroes” and saying that he has “boundless appreciation” for them.\n\nThe first phase of the deal between Israel and Hamas is in effect as the two move forward cautiously amidmutual distrust.\n\nVideo shows thousands ofPalestinians moving on footfrom the south of Gaza toward Gaza City along a coastal road. Last month, the Israel Defense Forces ordered the evacuation of Gaza City, which was estimated then to have a population of about 1 million people.\n\nHere’s everything you need to know:\n\nA program coordinator for INARA (International Network for Aid, Relief and Assistance) who is living in a tent in Gaza with her children has spoken of the fatigue felt by people in the enclave — and their hope for a better future.\n\nYousra Abu Sharekh told CNN’s Becky Anderson that the most recent period of the war has been the hardest on Palestinians.\n\n“The ceasefire is just in time because people on the Gaza Strip are so exhausted, overwhelmed and also drained,” she said, adding most now feel “a glimpse of hope.”\n\nSharekh said the first phase in the framework agreed upon by Israel and Hamas marks a long-awaited end to the ongoing bombardment of Gaza, but not an end to the suffering of civilians.\n\n“It’s an ending for the bleeding, but it’s just the start for Palestinians who lost their beloved ones, their houses, their normality,” she said.\n\nThe aid worker also said that “families are in need of everything,” adding that many have lived for months without shelter.\n\n“It’s the start to think of how to rebuild Gaza better. Not only the buildings, not only the neighborhoods, but most importantly, the souls … the health and the mental health,” Sharekh said of her vision for Gaza.\n\n“We hope we will have the environment to enable us to achieve sustainable and more impactful result on the mental health and social support,” she added.",
  "url": "https://edition.cnn.com/world/live-news/israel-hamas-gaza-ceasefire-agreement-10-10-25",
  "scraped_timestamp": "2025-10-11T23:47:54.597708",
  "content_length": 19980,
  "word_count": 3290,
  "source_domain": "edition.cnn.com"
}