{
  "title": "October 14, 2025 – Gaza ceasefire news",
  "content": "• US President Donald Trumpwarned that Hamas must disarmor “we will disarm them,” comments that come as major questions remain about the path forward after the release yesterday of the final20 living Israeli hostagesand more than1,700 Palestinian detaineesand 250 prisoners.\n\n• The remains offour more hostagesarrived Tuesday at the National Institute for Forensic Medicine in Tel Aviv, bringing to eight the number of deceased Israelis,out of a total of 28, returned from Gaza since Monday.\n\n• Humanitarian organizations said they are lookingto scale up aid suppliesinto Gaza. But Israeli authorities said the amount of trucksallowed into the enclave will be reduced or delayeddue to the limited number of deceased hostages released so far, a UN spokesperson said.\n\nOur live coverage of the Gaza ceasefire deal has concluded for the day. Please scroll through the posts below to learn about all the developments today.\n\nDisplaced Palestinians slowly resume daily routines following the Gaza ceasefire and hostage release deal.\n\nJust hours after the 20 remaining living hostages were released by Hamas and brought back toIsraelon Monday, the speaker of the Israeli parliament took off his yellow ribbon pin, an emblem of solidarity and an omnipresent reminder of the nation’s commitment to securing the captives’ return.\n\nAs he turned to thank US PresidentDonald Trump– who had arrived earlier to thunderous applause in the Knesset for brokering the ceasefire deal – Amir Ohana said he was “honored to take it off.”\n\nOhana’s pin was given to him by the father of one of the newly released hostages.\n\nYet, the celebratory moment felt deeply inappropriate to some of those still waiting for their loved ones to return, some of whom were sitting in the very same room.\n\n“It was disrespectful – no sympathy,” said Ruby Chen, the father of American-Israeli hostage Itay, who was taken captive to Gaza and later confirmed dead.“It was part of the narrative that he wishes to push, which is the deal is done – the prime minister (Benjamin Netanyahu) got the deal done and that it’s over,” he told CNN, adding: “Well, it’s not – because there’s still (hostages inside Gaza).”\n\nBy Tuesday evening, just eight of the 28 deceased hostages still in Gaza had been released by Hamas, adding anguish to many families who watched the country celebrate the return of the living captives as a great success.\n\nFury has been growing among the public – and the Israeli government – over how few of the deceased hostages had been returned by Hamas.\n\nA convoy transporting the remains of four deceased hostages has arrived at the National Institute for Forensic Medicine in Tel Aviv, Israeli police said.\n\nIdentification procedures of the bodies will be carried out at the facility, Israeli officials have said.\n\nThe bodies of 45 deceased Palestinianstransferredfrom Israel to the Nasser Medical Complex in Khan Younis have not been identified, the hospital’s forensic department told CNN on Tuesday.\n\nThe International Committee of the Red Cross transported the bodies on Monday as part of the exchange of detainees and hostages between Israel and Gaza.\n\nIt’s unclear where, when, or how the 45 Palestinians died. CNN asked the Israel Defense Forces (IDF) about the circumstances around the deaths.\n\nThe Palestinian Ministry of Health in Gaza said Israel has not provided a list of deceased Palestinians’ names. The ministry has previously suggested that either Israel knows the names but refuses to provide them or that Israel could have recovered the bodies while searching for Israeli hostages and did not determine their identities.\n\nAll of the bodies arrived at the facility with their hands and legs cuffed, the hospital said. The remains were being held in refrigerators in Israel and came with numbers marking them, rather than names, according to the hospital.\n\n“Some are blindfolded, and there are signs of gunshot wounds in some cases, while others have been run over by tanks,” Nasser hospital said.\n\nThe hospital said it will ask the families of missing persons to help identify them.\n\nIn a statement, the Palestinian Center for the Missing and Forcibly Disappeared Persons called on Israel to provide all available information on the bodies being handed over “including the names of the victims and details about the circumstances of their deaths.”\n\nCNN has reached out to the Israeli government for comment.\n\nCNN’s Dana Karni contributed to this report.\n\nThe Israeli military has just said that four coffins containing the remains of deceased hostages have now crossed the border into Israel.\n\nThe deceased hostages are on their way to the National Institute for Forensic Medicine, the Israel Defense Forces (IDF) and Israel Security Agency (ISA) said in a statement, where identification procedures will be carried out.\n\nPolice forces are accompanying the coffins on their journey to the institute, Israeli police said in a statement.\n\nThe remains of four deceased hostages have now been received by the Israel Defense Forces (IDF) and Shin Bet security agency in Gaza, according to the Israeli Prime Minister’s Office.\n\n“Israel has received, via the Red Cross, four fallen hostages who were handed over to IDF and Shin Bet forces inside the Gaza Strip,” the office said in a statement.\n\nThe deceased hostages will now be transferred to Israel, the office said, where they will be received in a military ceremony before being identified.\n\nUS President Donald Trump said today that “phase two” of the Gaza ceasefire dealbegins nowbut added that “job is not done” as he called for the return of all deceased Israeli hostages.\n\nTrump also warnedthat Hamas must disarm or “we will disarm them.” The comments come as major questions remain about the path forward for Israel and Gaza.\n\nMeanwhile, a working-level delegation has stayed in the Egyptian resort town of Sharm el-Sheikh, since initial negotiations began and has remained there for continued discussions on next steps, an Israeli source told CNN.\n\nIf you’re just joining us, here are the latest headlines from today:\n\nThe Israel Defense Forces (IDF) told Palestinians on Tuesday not to approach any military “deployment sites” in Gaza following earlier reports that the IDF had opened fire in the territory.\n\n“IDF troops continue to be deployed in specific locations throughout the Gaza Strip,” Avichay Adraee, the IDF’s Arabic-language spokesperson, posted on X. “Do not approach IDF troops at any of their deployment sites.”\n\nEarlier today, the IDF said itopened fire in Gazaafter observing multiple individuals crossing the “yellow line” — the initial Israeli withdrawal line as shown on a ceasefire map released by the White House.\n\nIt marked the first known instance of Israel opening fire in Gaza since the truce took effect.\n\n“Attempts were made to distance the suspects. The suspects did not comply and continued approaching the troops, who opened fire to remove the threat,” the IDF said earlier.\n\nCNN’s Eugenia Yosef and Lauren Said-Moorhouse contributed to this post.\n\nVicky Cohen felt a tide of relief, exhaustion and apprehension over the “long journey” to a “normal life” for her son – an Israeli soldier who was freed by Hamas on Monday.\n\n“After two years, I can finally breathe,” Vicky told reporters at Ichilov Hospital in Tel Aviv, Israel, on Tuesday. “A wonderful thing happened last night. The whole family, including Nimrod, just slept.”\n\nHer son, 21-year-old Nimrod Cohenwas takenfrom a tank near kibbutz Nirim, close to the Gaza perimeter fence, in the Hamas-led October 7, 2023, attacks. He was 19 at the time – making him one of the youngest hostages.\n\nNimrod appeared in a Hamas video posted online on March 1 this year. His family was able to identify him thanks to a tattoo on his arm, Vicky told CNN at the time.\n\n“Yesterday was the most sentimental day of my life,” she said at the hospital press conference on Tuesday. “Nimrod returned to us extremely thin, tired, and exhausted – but with a huge smile on his face.\n\n“But don’t let the smile fool you – the road ahead is still long,” she added. “We are all committed to this mission: to help Nimrod return to as normal a life as possible. We will embrace him, wrap him in love, and together, hand in hand, we will accompany him on this long journey.”\n\nThe Israeli military said Tuesday that four coffins carrying the remains of deceased hostages have now been handed to the Red Cross in Gaza.\n\nThe coffins are on their way to the forces of the Israel Defense Forces (IDF) and the Israel Security Agency (ISA) in Gaza, the IDF said in a statement.\n\nSince reuniting with his family, freed hostage Omri Miran is processing and enjoying time together again, his brother-in-law Moshe Lavi told CNN.\n\n“It’s been such a beautiful time for our family,” he said. “In a way, we rose from a state of despair to a state of joy – and now everyone is united again.”\n\nIn some of Miran’s first moments with his family, Lavi said he shared some of the stories from his captivity.\n\n“I’m so glad and relieved that he’s no longer held captive in a tunnel, isolated, at times starved, tortured by captors who had complete disregard to his humanity,” Lavi said.\n\nHe went on to add that he thinks pressure should come from the Arab world to return the remaining hostages.\n\n“I think with diplomatic pressure, we can achieve the results needed and we can continue with the ceasefire and the prospects of a larger peace arrangement in the region,” he said.\n\nA smile flashed across Rivka Bohbot’s face at a press conference in Tel Aviv, Israel, on Tuesday as she recalled her husband’s return home.\n\n“My husband, Elkana, is at home. These are words I’ve been waiting to say,” she told a reporters at Sheba Medical Center. “I’m still finding it hard to believe that he’s here.”\n\nElkana was taken from theNova music festivalduring the Hamas-led October 7, 2023. attacks. He attended a party with friends and spoke to his wife and his mother as the attack began to unfold, telling them he was helping to evacuate the wounded, according to Israeli media.\n\nBut after more than 740 days, the family were reunited during the latest ceasefire deal between Israel and Hamas.\n\n“Yesterday was the most exciting day of my life, more than my wedding day,” added Rivka. “Even though Elkana was weak, he couldn’t help himself and raised Reem (their son) and hugged him tightly. My boy got his dad back.”\n\nLiran Berman, the brother of two other Israeli hostages released from Gaza on Monday, can now finally breathe a sigh of relief.\n\n“They are safe, alive and back,” Liran told reporters at the hospital conference on Tuesday. “Our lives were trapped between hope and fear. Yesterday, that chapter ended.”\n\nHis twin brothers – Ziv Berman and Gali Berman – had been taken from their home inkibbutz Kfar-Azamore than two years ago.\n\n“Now, we must bring everyone back,” added Liran. “That is the only way this story can totally end.”\n\nThe Israeli military said Tuesday the Red Cross is on its way to a meeting point in southern Gaza, where “several coffins of deceased hostages will be transferred into their custody.”\n\nThe Israel Defense Forces (IDF) asked the public in its statement “to act with sensitivity and wait for official identification (of the bodies), which will first be provided to the families of the deceased.”\n\nIt did not say how many bodies the Red Cross is expected to receive.\n\n“Hamas is required to fulfill its part of the agreement and make the necessary efforts to return all the hostages and deceased for a dignified burial,” it added.\n\nUS President Donald Trump warned Tuesday that Hamas must disarm or “we will disarm them,” comments that come as major questions remain about the path forward for Israel and Gaza.\n\n“They said they were going to disarm, and if they don’t disarm, we will disarm them,” Trump told reporters during a meeting with his Argentinian counterpart, Javier Milei, at the White House.\n\nAsked how he would do that, Trump said, “I don’t have explain that to you, but if they don’t disarm, we will disarm them. They know I’m not playing games.”\n\nTrump said that could happen “quickly and perhaps violently.”\n\nPressed on a timeline for disarmament, Trump said it would be “a reasonable period of time. Pretty quickly,” but did not provide specifics.\n\nFor more than two years, Lishay-Miran Lavi promised her young daughters they would seetheir fatheragain and “get a hug that will heal everything.”\n\nThat promise was “finally completed” on Monday, according to Lavi, the wife of Omri Miran, an Israeli hostage who was freed by Hamas on Monday.\n\nHer 48-year-old partner was taken from kibbutz Nahal Oz during the Hamas-led October 7, 2023 attacks. Lavi and her daughters Roni and Alma survived – after which the family were separated for nearly 740 days.\n\nLavi reflected on a “difficult” period for her community during a press conference at Ichilov Hospital in Tel Aviv, Israel, on Tuesday.\n\nIn her address, she paid tribute to her 80-year-old father-in-law, Dani Miran, describing him as “an iron man with a heart of gold.”  “You were the first to arrive at each protest, and the last to leave,” said Lavi. “I hope you’ll have some peace.”\n\nIn April 2024, Hamas released a video showing Omri Miran alongside American-Israeli hostage Keith Siegel, who was released during the second ceasefire between Israel and Hamas,in January.\n\nLavi also honored the Hostages and Missing Families Forum, adding, “This moment would not have happened if it wasn’t for you.” She thanked volunteers and demonstrators who have repeatedly called on the Israeli government to broker the hostages’ release from Gaza.\n\n“I am glad we arrived at this agreement, otherwise there would be a devastating end,” Lavi said.\n\nHostage Daniel Peretz, whose body was released by Hamas and handed over to Israeli authorities yesterday, has been formally identified.\n\nThe Hostages and Missing Families Forum named Peretz on Tuesday as one of the four deceased hostages returned to Israel after the20 living hostageswere released yesterday.\n\nThe Israeli Prime Minister’s Office (PMO) also confirmed Tuesday that the identification process had been completed for all four deceased hostages so far returned to Israel: Daniel Peretz, Yossi Sharabi, Guy Illouz and Bipin Joshi.\n\nPeretz, a soldier in the Israel Defense Forces (IDF), was killed in action on October 7, 2023, and his body was taken to Gaza, according to an obituary published by the IDF.\n\nThe brother of hostageYossi Sharabi, whose body was released by Hamas and handed over to Israeli authorities yesterday, said that this is a moment of closure for the family.\n\n“Now, we’ll finally have a grave to cry on,” his brother Eli Sharabi, a former Israeli hostage who wasreleased earlier this year,told CNN’s Dana Bash.\n\n“It was very, very important to our family. And, you know, and this period of time finished now of the, you know, the battle to to bring him back. And now we start to grieve … and to have a new reality that Yossi is gone forever,” Eli Sharabi said.\n\nYossi Sharabi was kidnapped alive from kibbutz Be’eri. The Israel Defense Forces said in January 2024 that he had been killed in Gaza and his body was held hostage by Hamas.\n\nEli Sharabi also described an emotional moment of reuniting with hostage Alon Ohel yesterday. Eli Sharabi and Ohel were held captive together in Gaza, and Sharabi has described Ohel as an adoptive son.\n\n“It was very emotional moment for us, but we know it will stay with us. Of course, we hugged each other and cried,” he said, “… I’m very, very happy that he came back to his family. And, from now on … I’ll be ready for him whenever he need(s) me. And I really, really love him. And I missed him a lot,” he said.\n\nAsked on Tuesday if Hamas is holding up its end of the ceasefire deal, President Donald Trump told reporters, “We’ll find out.”\n\nHis comments come shortly aftera Truth Social postin which he said “phase two” of the deal is now beginning.\n\nA father who loved surfing and extreme sports, Yossi Sharabi was a “kind-hearted man,” his wife, Nira, recalled.\n\n“We miss our Yossi so deeply,” she said in a statement shared by the Hostages and Missing Families Forum today. “Now we can finally bring closure to the nightmare that began over two years ago.”\n\nThe 53-year-old Sharabi was one of four of the 28 deceased hostages who were returned to Israel by Hamas earlier Monday.\n\nHe was taken alive from kibbutz Be’eri on the Hamas-led October 7, 2023 attacks, along with his brother Eli, his daughter’s partner Ofir Engel, and 16-year-old Amit Shani, the statement added.\n\nEli Sharabi — who was releasedfrom Gazain February after 491 days — wondered if “this circle has finally closed,” inan Instagram post today. “Until all the fallen return home, we will not stop,” he wrote.\n\nIn January 2024, Sharabi was killed “apparently from IDF bombing of a nearby building,” Nira Sharabi said in the forum statement.\n\n“We call on everyone to continue fighting for the return of all the deceased hostages still held captive, until the very last one comes home,” she added.",
  "url": "https://edition.cnn.com/world/live-news/israel-gaza-ceasefire-deal-hostages-10-14-25",
  "scraped_timestamp": "2025-10-15T10:24:13.306246",
  "content_length": 17064,
  "word_count": 2857,
  "source_domain": "edition.cnn.com"
}