{
  "title": "Opposition bloc negotiations continue as seat pact remains unclear, Congress forms panel",
  "content": "With just three days remaining in filing of nomination for the first-phase polling in Bihar, the seat-sharing talks in Opposition grand alliance was yet to take a final shape till Tuesday, even as the Congress central election committee (CEC) finalised names on several seats and formed a four-member panel led by AICC treasurer Ajay Maken to finalise remaining names of candidates.\n\nThe CEC, the party’s top body to pick candidates for elections, cleared names of candidates on 18-20 seats in its second meeting on Tuesday. It had cleared around 25 names last week.\n\nAmbiguity over the number of seats the party would contest as part of the Mahagathbandhan as well as the choice of seats has led to confusion in finalising the candidates. “The queries about how many seats we are getting and which seats came up during the meeting but there was no clarity. The Bihar leadership of our party said they are hopeful of sealing a seat deal with the RJD very soon,” a senior member of the CEC said, declining to be named.\n\nOctober 17 is the last date of filing nomination for the first phase of polling scheduled on November 6.\n\nBesides Maken, the panel comprises party in-charge for Bihar Krishna Alavaru, state unit chief Rajesh Kumar and legislative party leader Shakeel Ahmad Khan as members.\n\n“We had a meeting for three hours but couldn’t finalise all candidates. Therefore, a smaller panel has been formed so that they can quickly meet, as against calling the full CEC, and give their recommendations to the party leadership about the potential candidates,” a second leader said, also requesting anonymity.\n\nTwo leaders present in the meeting on Tuesday said the Congress is aiming to contest in around 60 seats.\n\nMeanwhile, insiders in Mahagathbandhan indicated that RJD leader Tejashwi Yadav will file his nomination papers from his sitting Rahopur seat on Wednesday.\n\nRJD chief Lalu Prasad had given party symbols to several ticket aspirants on Monday evening, though there were reports that some of them were later asked to return the symbol on instructions from Tejashwi Yadav apparently over the ongoing dispute on a few seats with Congress and other allies.\n\n“We have already given tickets to over one dozen candidates who contested in the last 2020 polls. There is no dispute on these seats. The nomination for seats where polling is in first phase would be completed in the next two days,” a senior RJD leader aware of the matter said.\n\nOn Tuesday, some CPI-ML (Liberation) candidates, including its sitting Darauli MLA and some seats in Siwan, Ara and Paliganj filed their nominations, even before a final announcement by the party.\n\nCPI-ML (Liberation) general secretary Dipankar Bhattacharya said that 18 out of 19 seats the party had contested in the 2020 polls have got final clearance from all allies and negotiations were still going on for a few seats more. The party also released a list of 18 names on Tuesday, but withdrew it later, citing that talks on a few seats remain underway.\n\n“We want a few more seats in different districts other than those areas we contested in 2020 polls. Talks are still going on. But 18 seats have been cleared from where our candidates have started filing nominations,” Bhattacharya said.\n\nPeople familiar with the matter said there was a dispute over the Aurai seat, where the CPI-ML had contested in 2020 polls but it is still not cleared by the RJD. Gaighat, Barachatti, Rajgir, Hayaghat, Benipatti and Pipra (Supaul) are among other seats being demanded by the party, the people added.",
  "url": "https://www.hindustantimes.com/india-news/opposition-bloc-negotiations-continue-as-seat-pact-remains-unclear-congress-forms-panel-101760468095992.html",
  "scraped_timestamp": "2025-10-15T09:43:24.882668",
  "content_length": 3543,
  "word_count": 594,
  "source_domain": "www.hindustantimes.com"
}