{
  "title": "Ottawa, New Delhi have found a way to address ‘mutual concerns’: Canada NSIA",
  "content": "Toronto:In contrast to the flurry of accusations under the previous government, Canada is taking a far more collaborative attitude towards India, as evidenced by remarks made by its National Security and Intelligence Adviser (NSIA) on Thursday.\n\n“We have found a way to address mutual concerns and for leaders to be able to talk about trade relationships,” NSIA Nathalie G Drouin told reporters in Ottawa on Thursday.\n\nAsked about her meeting with India’s National Security Adviser Ajit Doval in New Delhi on September 18, Drouin said, “It was a productive meeting where we established a channel of communication to talk about respective concerns.”\n\n“We have a common understanding and common goal here. They want us to be very clear in terms of One India and the respect of the integrity of their territory and what we want is safer streets in Canada,” she added.\n\nShe also confirmed that Minister of Foreign Affairs Anita Anand will be travelling to India in the weeks ahead for a bilateral visit. In an interview with Bloomberg earlier this week, Anand, currently in New York for the United National General Assembly, said she planned to travel to India and China soon to “ensure” that Canada has “a bilateral relationship with significant economic powers in the Indo-Pacific”. Dates for that visit have yet to be announced but will be the latest step in the graduated approach that has been adopted towards resetting ties between Ottawa and New Delhi since Mark Carney took over as Prime Minister.\n\nShe indicated that India has signalled cooperation between law enforcement agencies to take investigations forward. “I think it is in their interest and also in our interest to see better safety in our streets. And that message was clearly passed to India.”\n\nHowever, she refused to be drawn into responding on the specific case of the killing of pro-Khalistan figure Hardeep Singh Nijjar in Surrey, British Columbia, on June 18, 2023.\n\nThe months later then Canadian Prime Minister Justin Trudeau cratered bilateral ties after he stated in the House of Commons that there were “credible allegations” of a potential link between India agents and the killing. India described those accusations as “absurd” and “motivated” and has continued to deny any link to the murder.\n\nAmong the early measures announced during the breakthrough bilateral meeting between Carney and Prime Minister Narendra Modi on the margins of the G7 leaders’ summit in Kananaskis in June was the restoration of High Commissioners to the two capitals. That has now taken place with India’s High Commissioner Dinesh Patnaik formally presenting his credentials to Canada’s Governor General Mary Simon on Thursday. In a post, India’s High Commission in Ottawa said they “exchanged views on strengthening India- Canada bilateral relations”.\n\nCanada’s new High Commissioner in New Delhi is Christopher Cooter.\n\nMeanwhile, India’s Civil Aviation Minister Ram Mohan Naidu is also currently visiting Canada, though for the multilateral 42nd General Assembly of the International Civil Aviation Organization or ICAO in Montreal. However, the Minister held roundtable discussions with aviation industry representatives on Wednesday. The event was organised by the High Commission in association with the Canada-India Business Council or C-IBC. The High Commissioner posted that the discussions “with leading Canadian aviation stakeholders focused on strengthening bilateral cooperation and exploring investment & partnership opportunities in India’s dynamic aviation sector.” He also toured a manufacturing plant of Bombardier Aircrafts in Montreal.\n\nThe Minister’s trip to Canada was the first standalone visit by a member of Modi’s Cabinet since Commerce Minister Piyush Goyal’s came to Ottawa and Toronto in May 2023. External Affairs Minister S Jaishankar had accompanied Modi for the G7 summit.",
  "url": "https://www.hindustantimes.com/world-news/ottawa-new-delhi-have-found-a-way-to-address-mutual-concerns-canada-nsia-101758878709932.html",
  "scraped_timestamp": "2025-09-26T16:00:20.307541",
  "content_length": 3863,
  "word_count": 602,
  "source_domain": "www.hindustantimes.com"
}