{
  "title": "Overall security situation normal in Ladakh: LG",
  "content": "Leh, The overall security situation remained normal in the Union Territory of Ladakh, Lt Governor Kavinder Gupta said on Thursday, a day after four people died and 90 others were injured in clashes between protesters and security personnel in Leh town.\n\nGupta also reiterated that his administration has taken all necessary steps including arresting those responsible for Wednesday’s violence.\n\nTalking to PTI Videos here, the LG said some people do not want peace and development and are making attempts to disturb the law and order situation in the region.\n\n“The violence that has taken place the previous day was promptly brought under control. The situation has improved and there was no untoward incident reported from anywhere after 4 pm yesterday,” he said.\n\nGupta said various necessary measures including strict implementation of section 163 of BNSS were taken to thwart attempts by inimical elements to disturb the situation.\n\n“Out of 90 injured persons, only 19 are still admitted in the hospital and rest were discharged. Many of those admitted will be discharged by tomorrow morning,” he said, reiterating his appeal to the residents of Ladakh to isolate those who are trying to disturb the situation.\n\n“We are keeping a close watch on such persons and some of them have been arrested,” he said.\n\nHe said there was a bandh call in Kargil district which passed off peacefully. “Overall the situation across Ladakh remained normal.”\n\nWithout identifying anyone, he said some people do not want peace and development in Ladakh and are trying to disturb the situation.\n\n“They have made references to the unrest in Bangladesh, Sri Lanka and Nepal to instigate the local youth and their actions should not be tolerated. Action will be taken against them,” he said, in an apparent reference to the reported speeches of climate activist Sonam Wangchuk.\n\nThe LG said the Ministry of Home Affairs had already issued a detailed statement on the violence and role of some people in it.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/overall-security-situation-normal-in-ladakh-lg-101758811884379.html",
  "scraped_timestamp": "2025-09-26T00:23:58.259286",
  "content_length": 2080,
  "word_count": 339,
  "source_domain": "www.hindustantimes.com"
}