{
  "title": "Page 47 of Defence",
  "content": "According to official sources, Prime Minister Modi will not be attending the SCO Summit in person\n\nKenyan police reacted to the across the country dissents strongly. Reportedly, live rounds, rubber bullets and tear gas were used…\n\nThe last bilateral annual summit between India and Russia occurred in 2021 when Russian President Vladimir Putin visited India.\n\nOn its way back from Alaska after joining in the ‘Red Flag’ exercise, the IAF contingent landed in Egypt.\n\nThis collaboration signifies a major advancement in the industry\n\niDEX has achieved a historic milestone by signing its 350th contract on June 25, 2024, in New Delhi\n\nThis partnership, focusing on cooperative efforts, is seen as crucial for global security and economic prosperity for both nations.\n\nExternal Affairs Minister S Jaishankar highlighted a remarkable annual growth of nearly 15% in passport and related services\n\nThe Air Force plans to request ten Tapas drones from the Ministry of Defence, with six allocated to the Air…\n\nThis catastrophic event, caused by a bomb planted by Khalistani terrorists based in Canada, remains the worst terror attack in…\n\nRussia and China have emerged as these other powers with aggressive domestic policies and assertive foreign posturing\n\nThe vessels, which will be 120 meters long and 17 meters wide with a maximum draft of 6.75 meters, are…\n\nThe LAC that was ‘relatively peaceful’ until a decade ago, has metamorphosed into an active front with looming war threats\n\nA new bill was recently passed at the U.S. House of Representatives introduced by prominent Republican and Democratic lawmakers and…\n\nThe Fifteenth Finance Commission was tasked with making recommendations for the fiscal period 2020-21 to 2024-25\n\nPrime Minister Narendra Modi, standing alongside Prime Minister Hasina at Hyderabad House in New Delhi, declared that an Indian technical…\n\nBoth nations acknowledge the interdependence of their progress and prosperity, committing to guide their bilateral ties towards realizing their respective…\n\nDefense cooperation was another critical topic of discussion",
  "url": "https://www.financialexpress.com/business/defence/page/47/",
  "scraped_timestamp": "2025-09-26T00:47:16.455144",
  "content_length": 2085,
  "word_count": 319,
  "source_domain": "www.financialexpress.com"
}