{
  "title": "Page 44 of Defence",
  "content": "The main focus of the meet was to tackle ongoing border tensions in Eastern Ladakh and explore ways to stabilize…\n\nIndia’s SEBEX 2 explosive, developed by Economic Explosives Limited and certified by the Indian Navy, is 2.01 times more lethal…\n\nThe report further says that there are plans to replace these with the newer 40-tonne Type 96B tanks.\n\nSERA, a US-based organization, will provide six seats on an upcoming mission of New Shepard, Blue Origin’s reusable suborbital rocket.\n\nThis promotes the exchange of best practices in tactics, techniques, and procedures for joint operations.\n\nDuring his four-day visit, Admiral Tripathi engaged in crucial discussions with Bangladesh’s top military officials, including his counterpart Admiral M…\n\nThis issue was brought to the forefront during the talks between Russia’s Foreign Minister Sergey Lavrov and India’s Foreign Minister…\n\nIn a major green initiative, the Indian Army will procure 113 electric buses to improve troop transportation. This move underscores…\n\nThis development marks a notable step in the deepening defence and diplomatic relations between the two nations.\n\nUdupi Cochin Shipyard Limited (UCSL) secures a major contract from Norway’s Wilson ASA for four 6300 TDW Dry Cargo Vessels,…\n\nOne of the primary focuses of the SCO Summit is regional security. Member states are expected to discuss comprehensive strategies…\n\nThe SCO aims to foster regional stability, combat terrorism, separatism, and extremism, and promote economic cooperation.\n\nPrime Minister Narendra Modi’s vision of SECURE, which stands for Security, Economic development, Connectivity, Unity, Respect for sovereignty and territorial…\n\nAccording to Pavel Muravienko, the Chief of the Belarusian Army and Deputy Defense Minister, ten battalion tactical groups of NATO,…\n\nRudram-1 is integrated with the IAF’s Sukhoi-30MKI fighter jets, serving as the launch platform. The missile features INS-GPS navigation and…\n\nThese strategic appointments aim to bolster the Army’s operational capabilities and streamline command structures.\n\nExercise MAITREE aims to enhance military cooperation between India and Thailand\n\nThe historical and ongoing disputes with these neighbours necessitate robust defence preparedness, with specific budgetary allocations aimed at enhancing border…",
  "url": "https://www.financialexpress.com/business/defence/page/44/",
  "scraped_timestamp": "2025-10-14T14:46:11.807754",
  "content_length": 2308,
  "word_count": 331,
  "source_domain": "www.financialexpress.com"
}