{
  "title": "Page 2 of Defence",
  "content": "Two infantry brigades near the border have already been changed into Rudra units. These will also get specially designed logistics…\n\nIndia successfully flight-tested the UAV Launched Precision Guided Missile (ULPGM)-V3 in Kurnool, Andhra Pradesh, a significant boost to indigenous defence…\n\nIn a statement, the spokesperson said the UK remains very grateful for the support and collaboration of the Indian authorities…\n\nThe delivery is part of a larger contract signed between Boeing and the Indian government to supply a total of…\n\nNavy chief admiral says he is optimistic that Nistar will carry forward the legacy of the original ‘Nistar’ ship, which…\n\nThe two-day trial was conducted at an altitude of over 15,000 feet in eastern Ladakh, where the Akash Prime successfully…\n\nThe developments also come amid speculation that neighbouring Pakistan will soon induct Chinese fifth-generation fighter jets.\n\nCDS General Anil Chauhan last month strongly refuted Pakistan’s claims of shooting down six Indian aircraft, including Rafales, calling the…\n\nThe Defence Acquisition Council has approved military equipment purchases worth Rs 1.05 lakh crore, all from domestic sources. The acquisitions…\n\nBrazil has shown keen interest in India’s Garuda 105 v2 artillery system developed by Bharat Forge’s Kalyani Strategic Systems. The…\n\nThe Indian Air Force will get at least half-a-dozen Tejas Light Combat Aircraft by March 2026, Hindustan Aeronautics Ltd CMD…\n\nThe defence ministry has concluded 13 contracts to boost the Indian Army’s operational readiness in countering cross-border terrorism.\n\nThis comes days after the US military jets were spotted in Iranian skies, and President Trump said that they now…\n\nBharat Forge signs MoU with France’s Turgis Gaillard to locally produce AAROK UAVs for Indian armed forces. The high-endurance drone…\n\nThe SIPRI report says India slightly expanded its nuclear stockpile in 2024 and continued developing new nuclear delivery systems. One…\n\nChina, which holds the rotating presidency of the SCO this year, has formally invited Singh to the summit.\n\nPakistani Defence Minister Khawaja Muhammad Asif had earlier claimed that Pakistani forces downed five Indian aircraft including three Rafales and…\n\nBabushkin also said that Russian Foreign Minister Sergey Lavrov may visit India soon, although final dates have yet to be…",
  "url": "https://www.financialexpress.com/business/defence/page/2/",
  "scraped_timestamp": "2025-10-14T14:21:37.264728",
  "content_length": 2357,
  "word_count": 352,
  "source_domain": "www.financialexpress.com"
}