{
  "title": "Pakistan accused at UN of using blasphemy laws to oppress communities",
  "content": "At the 60th session of the United Nations Human Rights Council (UNHRC), Alejandra Martinez Otero, the Human Rights Officer of the Global Human Rights Defence (GHRD), in her oral intervention, has raised alarm about Pakistan's blasphemy laws, warning that these provisions are being increasingly misused to subjugate minorities and stifle free expression.\n\nAddressing the UNHRC, she stated the urgent need for legal reform and the safety of the vulnerable communities.\n\nShe highlighted thatPakistan's blasphemy statutes, which allow for the death penalty, have left dozens facing extreme punishments.\n\nAt least 53 individuals are currently on death row for blasphemy-related charges, she stated, and within that, minorities, particularly Ahmadis, Christians, and Hindus, are disproportionately accused, with many cases linked more to personal grievances or entrenched bias than to genuine religious offences.\n\nShe also raised concerns over the role of digital platforms in fuelling violence. Online activity and social media posts have frequently triggered mob attacks, sometimes with deadly consequences.\n\nIn 2024, civil society organisations reported several suspected extrajudicial killings tied to blasphemy allegations. Despite the severity of these crimes, those responsible are rarely brought to justice, creating what she described as a climate of impunity.\n\nAnother area of grave concern is the vulnerability of minority girls, who are at heightened risk of abduction and forced marriage.\n\nShe asserted that threats and false blasphemy charges are often used as tools to justify or conceal these abuses, compounding the dangers faced by young women and girls in minority communities. She called on the Council and its mechanisms to engage directly with Pakistan to press for reform.\n\nIts recommendations included revising or repealing blasphemy provisions, ensuring fair trials for the accused, releasing those unfairly imprisoned, safeguarding communities at risk, and holding perpetrators of violence accountable.",
  "url": "https://www.hindustantimes.com/world-news/pakistan-accused-at-un-of-using-blasphemy-laws-to-oppress-communities-101758874514092.html",
  "scraped_timestamp": "2025-09-26T17:33:05.666607",
  "content_length": 2023,
  "word_count": 290,
  "source_domain": "www.hindustantimes.com"
}