{
  "title": "Pakistan defence minister Khawaja Asif fumbles 7 times at UNSC: 'Vital to riks'",
  "content": "Pakistan defence minister Khawaja Asif's speech at the United Nations Security Council (UNSC) turned out to be rather disastrous as he fumbled multiple times. He spoke about the challenges posed by Artificial Intelligence, but also mentioned the India-Pakistan skirmishes and recent flare-ups in a discussion on use of Artificial Intelligence (AI) in warfare.\n\nHe said that AI is reshaping the world at a breathtaking pace, only that he fumbled at “breathtaking”, “space”, “reshaping our world” - all in one sentence.\n\nAt one point he mispronounced risk as “riks”. He was speaking at the AI Innovation Dialogue chaired by UN Secretary-General Antonio Guterres, where the Pakistan defence minister warned that artificial intelligence lowers the threshold of conflict, compresses decision-making, and narrows the scope for diplomacy.\n\nOn AI, Asif said that while the technology can accelerate socioeconomic growth, but can also deepen the digital divide if not used responsibly. “In the absence of global normative standards and legal guard rails, the AI revolution risks reinforcing digital divides, entrenching new forms of dependency and imperiling peace,” he said as he fumbled on risk.\n\n“In the recent conflict in the subcontinent between India and Pakistan, for the first time autonomous loitering munitions and high-speed dual capable cruise missiles were used by one nuclear armed state against another during the military exchange which manifests the dangers which can which AI can pose,” he said, incoherently mentioning AI through his speech.\n\nAsif mentioned India’s Operation Sindoor, highlighting the use of autonomous loitering munitions, high-speed cruise missiles, and drones as examples of how modern AI-driven warfare can cause dangerous escalation.\n\nIn May 2025, India launched Operation Sindoor in response to terrorist attack in Kashmir's Pahalgam in which 26 tourists were killed. As the situation between two nuclear-armed neighbours worsened, a ceasefire was announced on May 10.",
  "url": "https://www.hindustantimes.com/world-news/pakista-defence-minister-khawaja-asif-fumbles-7-times-at-unsc-vital-to-riks-101758858964019.html",
  "scraped_timestamp": "2025-09-26T16:15:47.998964",
  "content_length": 2001,
  "word_count": 299,
  "source_domain": "www.hindustantimes.com"
}