{
  "title": "Pete Hegseth's mystery meeting order includes all top commanders: ‘We might be going to war’",
  "content": "Pete Hegseth and the Pentagon have ordered an emergency meeting next week, asking all military leaders worldwide to fly to Virginia, Fox News reported on Thursday, citing multiple officials. While the agenda is unclear at the moment, the order has sparked speculations on social media.\n\nA meeting of this kind is highly unusual and would usually take place on a secure video teleconference. There are around 800 generals and admirals stationed in the US and around the world.\n\nRead More:‘Can buy from any nation, not Russia’: US energy secretary on India's oil purchase, tariffs\n\nAccording to AF Post, a media outlet with nearly 300k followers on X, a senior Pentagon correspondent said, \"I've never seen anything like this in the past 30 years. We might be going to war.\"\n\n“WAR? Secretary Pete Hegseth has the Washington media freaking out as he orders his generals and admirals to attend an all-hands meeting in Quantico on Tuesday,\" another person added on X, platform formerly known as Twitter.\n\n“Does this mean the war drums are beating? If so, where is the next big conflict? Ukraine, Iran, Israel, Russia, Venezuela???” a third one asked.HT.com cannot verify these claims at the moment.\n\nNeither the Defense Department nor Hegseth has confirmed the details. “The Secretary of War will be addressing his senior military leaders early next week,” chief Pentagon spokesperson Sean Parnell told Huffpost.\n\nThe Washington Post first reported this story. Hegseth’s order applies to ‘all senior officers with the rank of brigadier general or above, or their Navy equivalent, serving in command positions and their top enlisted advisers,’ insiders told the Post. The report added that the urgent order does not apply to military officers who hold staff positions.\n\n“People are very concerned. They have no idea what it means,” one source told WaPo. “Are we taking every general and flag officer out of the Pacific right now? All of it is weird,\" another one added.",
  "url": "https://www.hindustantimes.com/world-news/us-news/pete-hegseths-mystery-meeting-order-includes-all-top-commanders-we-might-be-going-to-war-101758816675711.html",
  "scraped_timestamp": "2025-09-26T00:24:14.677105",
  "content_length": 1963,
  "word_count": 321,
  "source_domain": "www.hindustantimes.com"
}