{
  "title": "Phone-tapping case: SC directs former Telangana SIB chief to submit iCloud password",
  "content": "New Delhi, The Supreme Court on Tuesday directed former chief of Special Intelligence Bureau in Telangana T Prabhakar Rao, an accused in the phone-tapping case, to submit password of his iCloud account to the state police in the presence of forensic experts.\n\nA bench comprising Justices B V Nagarathna and R Mahadevan also extended interim protection from coercive action to Rao and directed him to appear before the investigation officer, and cooperate in the investigation.\n\nDuring the hearing, Solicitor General Tushar Mehta told the court that the investigation was not progressing due to Rao's “non-cooperation”and alleged that he had formatted electronic devices and destroyed vital evidence while under the court's protective order.\n\n\"He was intercepting phones of important people, not just politicians. After filing of anticipatory bail application he formatted the device. It is as good as a new device. It is not my surmise. The Central Forensic Science Laboratory says that.\n\n\"It is our case that he has a backup because he purchased 15 hard discs. But he says he doesn't have anything. He is not cooperating because of the protective umbrella of this court's interim protection,\" Mehta told the court.\n\nSenior advocate D S Naidu, appearing for Rao, vehemently refuted the allegations and said Rao was fully cooperating with the probe.\n\nNaidu contended that investigation was politically motivated and alleged that “outsiders, politicians, MPs and MLAs” were allowed to question him during interrogation.\n\nJustice Nagarathna then remarked,\"It cannot be a 'tamasha'. How can MPs and MLAs come in and interrogate? They cannot be spectators or part of the investigation.”\n\nThe apex court on May 29 granted interim protection from coercive action to Rao and directed him to give an undertaking that he would return to India within three days after the receipt of his passport.\n\nRao has moved the top court challenging an order of the Telangana High Court which dismissed his plea seeking anticipatory bail.\n\nOn May 22, a Hyderabad court issued a proclamation order against Rao in the phone tapping case.\n\nAccording to the order, Rao may be declared a \"proclaimed offender\" if he does not appear before the court by June 20.\n\nIf a person is declared a proclaimed offender, the court can order attachment of properties of the accused.\n\nA suspended DSP of SIB was among four police officials who were arrested by Hyderabad Police since March 2024, for allegedly erasing the intelligence information from various electronic gadgets as well as for alleged phone-tapping during the previous BRS regime. They were subsequently granted bail.\n\nThe accused are part of the alleged conspiracy in which they \"misused\" the resources of SIB for political purposes by putting citizens from different walks of life under surveillance, police had said.\n\nThose named as accused in the case along with others had allegedly developed profiles of several persons unauthorisedly and were accused of monitoring them clandestinely and illegally in SIB and using them in a partisan manner to favour a political party at the behest of some persons and also conspiracy in destroying the records to cause disappearance of evidence of their crimes, police earlier said.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/phonetapping-case-sc-directs-former-telangana-sib-chief-to-submit-icloud-password-101760434406624.html",
  "scraped_timestamp": "2025-10-14T15:36:15.695067",
  "content_length": 3343,
  "word_count": 531,
  "source_domain": "www.hindustantimes.com"
}