{
  "title": "PM Modi to inaugurate BSNL’s indigenous 4G network, commission nearly 1 lakh towers",
  "content": "New Delhi:Prime Minister Narendra Modi on Saturday will inaugurate Bharat Sanchar Nigam Limited’s (BSNL) Swadeshi 4G network in Odisha’s Jharsuguda, and will commission over 97,500 mobile 4G towers spread across the country, built at a cost of₹37,000 crore, communications minister Jyotiraditya Scindia said on Friday.\n\nScindia said that the initiative reinforces India’s telecom self-reliance at a time when only four other countries have their own 4G technology stack—Sweden, South Korea, China, and Finland. “India is now the fifth country and the sixth company—Centre for Development of Telematics [C-DOT]—to produce telecom equipment in the history of the world,” Scindia said, adding that the network will use a Radio Access Network (RAN) developed by Tejas Networks and integrated by Tata Consultancy Services. It is fully upgradable to 5G\n\nThe government will also launch the Digital Bharat Nidhi-backed 4G saturation project. Over 4,723 towers have been funded by private operators Reliance Jio and Bharti Airtel, and another 14,180 towers by BSNL’s indigenous 4G stack, which together cover 26,700 remote and border villages, reaching an estimated two million new users. Scindia added that “no part of India will be left untouched.”\n\n“In 2020, he [PM Modi] took a very bold decision, where tenders were put out for 4G equipment, and instead of purchasing foreign equipment, we would produce our own 4G stack in India. And over a record 22 months, a country that was historically dependent on foreign technology innovated and engineered its own domestic 4G stack,” said Scindia.\n\nAfter three years of development and large-scale trials, BSNL rolled out the first towers in Punjab in 2023. “As of now, the network is carrying traffic for about 22 million subscribers and 4 petabytes of data every single day,” government officials said.\n\nFor BSNL, which is celebrating its 25th anniversary on October 1, the project is being described as a turnaround moment after years of losses and outdated infrastructure. BSNL has shown back-to-back quarterly profits of₹262 crore and₹280 crore, with subscriber numbers rising from 8.7 crore to 9 crore, and 4G users jumping from 0.8 crore to 2 crore, said the government.",
  "url": "https://www.hindustantimes.com/india-news/pm-modi-to-inaugurate-bsnl-s-indigenous-4g-network-commission-nearly-1-lakh-towers-101758880149605.html",
  "scraped_timestamp": "2025-09-26T16:00:17.834810",
  "content_length": 2217,
  "word_count": 347,
  "source_domain": "www.hindustantimes.com"
}