{
  "title": "Polish hotelier and home-builder offers rewards to couples who conceive in his properties",
  "content": "APolishhotelier and property developer is offering to throw a party for customers who conceive while staying with them, in a bid to boost his country’slow birth rate.\n\nWładysław Grochowski, who owns one of Poland’s largest hotel and property chains, has pledged to host a free celebration – such as a christening party – for anyone who becomes pregnant during a stay at one of the 23 hotels in his Arche group.\n\nHe has also promised to pay a cash bonus of 10,000 zlotys (around $2,750) to any staff or customers who have a child within five years of buying one of the company’s properties to live in.\n\nIn an interview with financial sitemoney.pl, Grochowski said: “Every couple who conceives a child during their stay at one of the 23 Arche hotels will receive a complimentary family celebration, such as a christening, in one of our event rooms or restaurants.”\n\nHe said that some of the chain’s properties feature renovated churches that can be used to host weddings or baptisms, while others have parks where a tree will be planted for each eligible birth recorded.\n\n“Parents of the first child born under this program will also receive a stroller and a special welcome package,” he said.\n\nCNN has reached out to Arche for further comment.\n\nPro-natalist movement believes higher birthrates will help society\n\nIncommonwith many countries around the world, Poland is struggling to deal with a declining birth rate. In 2023, it recorded 1.2 live births per woman, which was down from 1.33 in 2021 and 2.06 in 1990, according to the European Union’s statistics agency,Eurostat.\n\nExplaining the rationale behind his unusual package of incentives, Grochowski said in the interview withmoney.pl: “Businesses should become more involved in social issues, including supporting the reversal of the negative demographic trend in our country. In 2026, Poland will spend nearly 5% of its GDP on defense, which nominally could translate to over 200 billion złoty, but what good is that if demographics will wipe us out?”\n\nThe company, which Grochowski set up in the early 1990s, has a portfolio of more than 4,000 hotel rooms and 27 restaurants, and it has built more than 10,000 apartments to date.\n\nSouth Korea’s birth rate rose for the first time in 9 years. Is the world’s lowest fertility rate on the rebound?\n\nA scroll through Arche’s website reveals that it is highly engaged with social issues, involving itself in a range of initiatives, including ones to preserve the local heritage, protect the environment and promote sporting events.\n\nSeparately, the entrepreneur and his wife, Lena, set up the Lena Grochowska Foundation in 2014 to focus on humanitarian work. As part of that, they have helped provide safety and shelter for some of the many Ukrainian refugees who have crossed into Poland since the war broke out in 2022. The work earned the couple a prestigious United Nations award in 2023 – they were regional winners for Europe of theUNHCR Nansen Refugee Award.\n\nIn an interview on theUNHCR website, Grochowski explained the motivation behind his operations: “Making money never interested me. I always wanted to be useful or get involved somewhere. I operate on emotions.”",
  "url": "https://edition.cnn.com/world/europe/poland-hotelier-conceive-intl-scli",
  "scraped_timestamp": "2025-09-26T16:28:44.571345",
  "content_length": 3181,
  "word_count": 526,
  "source_domain": "edition.cnn.com"
}