{
  "title": "Politics",
  "content": "Farooq Abdullah called for immediate talks between the central government and the people of Ladakh. He emphasized Ladakh's sensitivity, citing China's presence and land occupation. Abdullah supported Sonam Wangchuk and highlighted the frustration of Ladakh's youth. He cautioned against using force, stating that the people's patience had run out. He urged the government to resolve the issue quickly through dialogue.\n\nCongress asserts that the recent violence in Ladakh, resulting in fatalities, reveals the central government's failure to deliver on promises of normalcy following the revocation of Article 370.\n\nFarooq Abdullah called for immediate talks between the central government and the people of Ladakh. He emphasized Ladakh's sensitivity, citing China's presence and land occupation. Abdullah supported Sonam Wangchuk and highlighted the frustration of Ladakh's youth. He cautioned against using force, stating that the people's patience had run out. He urged the government to resolve the issue quickly through dialogue.\n\nCongress asserts that the recent violence in Ladakh, resulting in fatalities, reveals the central government's failure to deliver on promises of normalcy following the revocation of Article 370.\n\nThe CPI re-elected D Raja, 76, as general secretary at its Chandigarh party Congress, granting him an exemption from the 75-year age cap on leadership posts. Raja sought to continue in the role, making an emotive appeal citing his background and experience.\n\nAndhra assembly Speaker C Ayyannapatrudu addressed the Assembly. He stated that YSRCP does not have enough MLAs. Therefore, YS Jagan Mohan Reddy cannot be granted the Leader of Opposition status. The party only has 11 MLAs. Rules require a minimum of 18 MLAs for the recognition. Ayyannapatrudu emphasized adherence to regulations.\n\nTamil Nadu Chief Minister M K Stalin and Telangana Chief Minister Revanth Reddy launched a Rs 1,000 monthly assistance scheme. This scheme is for first-year college students. It is for the academic year 2025-26. The 'Pudhumai Penn' and 'Tamil Pudhalvan' schemes will benefit over 2.6 lakh students. The event highlighted Tamil Nadu's educational initiatives.\n\nSrinagar: Speaking on Ladakh protest, PDP Chief Mehbooba Mufti on September 25 warned Centre against turning Ladakh into an ‘open jail’. “Ladakh fears that their land will be snatched from them, the culture there will change. This fear has to be addressed by the government through actions, not 'jumlas'. If you (Centre) want to convert Ladakh into an open jail, then its consequences will be really bad. To hide their (Centre) failure, they are making others the scapegoats. I condemn the levelling of accusations at Sonam Wangchuk,” said Mehbooba Mufti.\n\nThe CBI has contested Lalu Prasad Yadav's plea in the Delhi High Court to quash the FIR in the land-for-jobs scam, citing delays and the availability of alternative legal remedies. The CBI argues that Yadav should have approached the sessions court first and that the plea was filed after the limitation period.\n\nAssam Chief Minister Himanta Biswa Sarma anticipates BJP's performance in the Bodoland Territorial Council (BTC) elections will surpass previous results, despite campaign disruptions due to a singer's death. He predicts NDA partners will dominate the 40 seats, with potential government formations involving UPPL, BPF, and BJP. Sarma acknowledges the election's political importance, especially before the upcoming Assam assembly polls.\n\nJammu and Kashmir National Conference President Farooq Abdullah on Thursday advised the BJP-led Central government to take a lesson from the recent violence in Leh, Ladakh. The unrest stemmed from long-standing demands for statehood and inclusion in the Sixth Schedule. In a press conference, Farooq attributed the violence to frustration over unfulfilled promises, emphasising that similar assurances had been made to Jammu and Kashmir regarding statehood. He stressed the unrest reflects local grievances, not external influences, highlighting Sonam Wangchuk's peaceful protests, including a hunger strike and barefoot march from Leh to Delhi.\n\nMaharashtra Chief Minister Devendra Fadnavis lauded Prime Minister Narendra Modi's leadership, dismissing age as a barrier due to his capabilities. He criticized Rahul Gandhi's relevance to the youth and addressed caste issues in his political career. Fadnavis affirmed his commitment to Maharashtra and the BJP's alliance for the 2029 elections, while also tackling challenges like Maratha quota and flood relief.",
  "url": "https://economictimes.indiatimes.com/news/politics",
  "scraped_timestamp": "2025-09-26T00:13:27.453284",
  "content_length": 4553,
  "word_count": 676,
  "source_domain": "economictimes.indiatimes.com"
}