{
  "title": "Politics",
  "content": "The BJP is finalizing seat-sharing for the Bihar assembly elections with allies, aiming for an NDA alliance agreement despite some minor disagreements. While the BJP signaled an intact alliance, smaller parties indicated talks are ongoing. The party is also accelerating its candidate selection process for the first phase.\n\nBJP leader Suvendu Adhikari criticizes Chief Minister Mamata Banerjee's upcoming visit to North Bengal. He claims her trip is for relaxation and enjoyment. Adhikari alleges police are focused on party flag arrangements instead of rescue work. He states police were absent during the disaster. Trinamool Congress defends the Chief Minister's prompt response and relief operations.\n\nOdisha CM Mohan Majhi has blamed \"vested interests\" for attempts to tarnish the state's peaceful image amidst rising law and order concerns. Recent incidents, including communal tensions in Cuttack and the murder of a BJP leader in Berhampur, have drawn criticism. The CM has directed police to stay vigilant and engage with community leaders to ensure peace.\n\nMadhya Pradesh's Mohan Yadav government faces scrutiny after over 20 children died, allegedly from 'Coldrif' cough syrup manufactured in Tamil Nadu. Chief Minister Yadav accused the TN government of non-cooperation in the investigation. TN Health Minister countered, blaming past neglect of drug inspections under the previous administration.\n\nBJP leader Suvendu Adhikari criticizes Chief Minister Mamata Banerjee's upcoming visit to North Bengal. He claims her trip is for relaxation and enjoyment. Adhikari alleges police are focused on party flag arrangements instead of rescue work. He states police were absent during the disaster. Trinamool Congress defends the Chief Minister's prompt response and relief operations.\n\nA medical student from Odisha was allegedly gang-raped in Durgapur, West Bengal, sparking strong criticism from the BJP against the state government's handling of women's safety. Protests erupted as the victim receives treatment, with authorities investigating the abduction and assault.\n\nSenior BJP leaders, including Amit Shah and J.P. Nadda, met with allies to finalize seat-sharing for the Bihar polls. The BJP state chief indicated an announcement by Sunday, with formulas for JD(U) and LJP(RV) nearly settled. Discussions continue with HAM(S) and RLM, aiming for a united NDA front.\n\nUddhav Thackeray has called the Maharashtra government's farmer relief package a 'joke'. He demanded a complete loan waiver for farmers affected by rains and floods. Deputy Chief Minister Eknath Shinde accused Thackeray of shedding crocodile tears. The state government announced a compensation package of Rs 31,000 crore. Thackeray claimed the actual aid was much lower.\n\nSpeculation about a cabinet reshuffle in Karnataka is rife as the Congress government approaches its halfway mark. Deputy Chief Minister D K Shivakumar has called these rumours, emphasizing that the party high command holds the decision-making power. Sources suggest Chief Minister Siddaramaiah's camp is pushing for changes. This potential move could impact Shivakumar's aspirations for the chief minister's chair.\n\nCongress leader Priyanka Gandhi Vadra on Saturday urged Prime Minister Narendra Modi to clarify his stand on the exclusion of women journalists from a press conference held by visiting Afghan Foreign Minister Amir Khan Muttaqi in New Delhi.\n\nWomen journalists were barred from an Afghan Foreign Minister's press conference in New Delhi. Senior Congress leader P Chidambaram expressed shock. He suggested male journalists should have boycotted the event. Karti Chidambaram criticized the government's role. The Afghan minister is on a week-long visit to India. India announced new healthcare projects for Afghanistan.\n\nSamajwadi Party leaders allege Facebook suspended party chief Akhilesh Yadav's account, calling it an attack on democracy and an undeclared emergency by the BJP. Party officials, including Fakhrul Hasan Chaand and Rajeev Rai, condemned the move, stating it suppresses opposition voices. MLA Pooja Shukla and leader Pawan Pandey also criticized Facebook for silencing a leader representing millions.",
  "url": "https://economictimes.indiatimes.com/news/politics",
  "scraped_timestamp": "2025-10-11T23:53:27.216903",
  "content_length": 4188,
  "word_count": 612,
  "source_domain": "economictimes.indiatimes.com"
}