{
  "title": "Politics",
  "content": "The CBI has apprehended Amit Das, an accused who had been absconding in connection with the murder of BJP leader Abhijit Sarkar. Sarkar was killed in Kolkata during post-poll violence in West Bengal in May 2021. Das was arrested on Thursday based on intelligence and technical analysis, and he will be presented in court today.\n\nThe Supreme Court has eased travel restrictions for MLA Abbas Ansari. He can now travel outside Uttar Pradesh with prior notice. The court wants to ensure trials against him proceed without delay. Ansari must cooperate in these legal proceedings. The court clarified that restrictions on speaking about sub-judice cases do not prevent him from discussing public welfare.\n\nThe CBI has apprehended Amit Das, an accused who had been absconding in connection with the murder of BJP leader Abhijit Sarkar. Sarkar was killed in Kolkata during post-poll violence in West Bengal in May 2021. Das was arrested on Thursday based on intelligence and technical analysis, and he will be presented in court today.\n\nThe Supreme Court has eased travel restrictions for MLA Abbas Ansari. He can now travel outside Uttar Pradesh with prior notice. The court wants to ensure trials against him proceed without delay. Ansari must cooperate in these legal proceedings. The court clarified that restrictions on speaking about sub-judice cases do not prevent him from discussing public welfare.\n\nUnion Home Minister Amit Shah inaugurated a Durga Puja pandal in Kolkata. The pandal's theme is \"Operation Sindoor\", a tribute to the Indian Army. Shah prayed for a new government in West Bengal after the 2026 elections. He hopes to restore the state's glory. Abhishek Banerjee criticized Shah's promises. Banerjee questioned the release of funds owed to West Bengal.\n\nRahul Gandhi voiced his support for Uttarakhand students protesting a paper leak, alleging a connection between unemployment and \"vote chori.\" He accused the BJP of prioritizing power over youth employment, labeling them \"paper chor.\" Gandhi claimed the BJP steals votes to stay in power despite the ruined dreams of hardworking youth due to repeated paper leaks.\n\nArvind Kejriwal has criticized the central government. He alleges harassment of Sonam Wangchuk. Wangchuk protested for statehood and inclusion in the Sixth Schedule in Ladakh. Restrictions are imposed in Leh under Section 163. The government is actively engaged with Apex Body Leh and Kargil Democratic Alliance. A High-Powered Committee meeting is scheduled for October 6.\n\nThe Allahabad High Court dismissed Rahul Gandhi's plea, upholding the order to reconsider an FIR application against him. The case originates from statements Gandhi allegedly made in the US, claiming an unfavorable environment for Sikhs in India. The court's decision directs the magistrate court to re-evaluate the matter, focusing on whether a prima facie case exists for investigation.\n\nJai Ram Thakur, Leader of Opposition, accuses the ruling Congress party of misusing government resources by distributing funds to women through the Kangra Cooperative Bank during the Dehra by-elections, violating the code of conduct. BJP alleges funds were allocated to mahila mandals under a government scheme.\n\nMirwaiz Umar Farooq, the Hurriyat Conference chairman, stated he was once again prevented from leading Friday prayers at Srinagar's Jamia Masjid. He condemned the repeated house arrest, marking the third consecutive Friday, as a violation of fundamental rights and an obstruction of his religious duties.\n\nUnion Home Minister Amit Shah inaugurated the Durga Puja pandal of Santosh Mitra Square in Kolkata, praying for a new government in West Bengal post-2026 to restore its 'Sonar Bangla' glory. He wished for a safe, peaceful, and prosperous Bengal, fulfilling Tagore's dream.\n\nDefence Minister Rajnath Singh paid a heartfelt tribute to the legendary MiG-21 fighter jet, describing it as more than just an aircraft. Calling it a living testament to India’s enduring defence ties with Russia, Singh recalled the fighter’s historic role in shaping India’s military legacy.“Who can forget the 1971 war?” Singh asked, as he revisited the jet’s defining moments. “During the war with Pakistan, despite adverse circumstances, the MiG-21 struck the Governor’s House in Dhaka. That very attack outlined the outcome of the conflict. Throughout its long history, the MiG-21 has repeatedly proven its decisive strength.”",
  "url": "https://economictimes.indiatimes.com/news/politics",
  "scraped_timestamp": "2025-09-26T16:14:58.294525",
  "content_length": 4425,
  "word_count": 682,
  "source_domain": "economictimes.indiatimes.com"
}