{
  "title": "Politics",
  "content": "Karnataka Minister Priyank Kharge reported receiving threats and abuse after advocating a ban on RSS activities in government-owned public spaces. He stated his resolve to continue advocating for a society based on equality and compassion, despite the backlash. Chief Minister Siddaramaiah has initiated a study into similar measures adopted by Tamil Nadu.\n\nThe BJP has unveiled its initial list of candidates for the upcoming Bihar assembly elections. These elections are scheduled to commence on November 6. The party will be contesting 101 out of the total 243 seats. This decision was finalized during a meeting of the Central Election Committee in Delhi. Prime Minister Modi and other senior leaders were present.\n\nKarnataka Minister Priyank Kharge reported receiving threats and abuse after advocating a ban on RSS activities in government-owned public spaces. He stated his resolve to continue advocating for a society based on equality and compassion, despite the backlash. Chief Minister Siddaramaiah has initiated a study into similar measures adopted by Tamil Nadu.\n\nFollowing the suspected death by suicide of a young IT professional in Kerala, Rashtriya Swayamsevak Sangh-Dakshin Kerala denied the allegations of sexual abuse, calling them \"dubious and baseless.\"\n\nThe Congress criticised the government after US President Donald Trump praised Pakistan Army Chief Asim Munir, questioning the signal sent to India despite Prime Minister Modi's efforts to appease Trump.\n\nCongress leader Rahul Gandhi visited the family of Haryana IPS officer Y Puran Kumar. Kumar allegedly committed suicide on October 7. His family claims senior officers discriminated against him. They demand action against these officers. The family has refused postmortem and cremation until their demands are met. Several political leaders have visited the family.\n\nKarnataka Minister Priyank Kharge has clarified his position on Rashtriya Swayamsevak Sangh activities. He stated that RSS should not use government schools, colleges, or state-owned temples for its programmes. Kharge believes such activities should be confined to private spaces. Chief Minister Siddaramaiah has ordered a review of Tamil Nadu's actions regarding a similar ban on RSS in government areas.\n\nJD(U) MLA Gopal Mandal protested outside Bihar Chief Minister Nitish Kumar's residence. Mandal, seeking a party ticket for the upcoming assembly polls, sat on a dharna with supporters. He stated he would not leave until he received the party symbol from the CM. Security personnel prevented his entry to the premises.\n\nAn RSS ideologue asserts the current government follows Shyama Prasad Mookerjee's vision. He links Mookerjee's past statements to the Citizenship Amendment Act, emphasizing the need to protect Hindus. He also connects Mookerjee's ideas to the National Education Policy and the Aatmanirbhar Bharat program. The Kerala government has previously criticized the Raj Bhavan for hosting such lectures.\n\nKannan Gopinathan, a former Indian Administrative Service officer, has joined the Congress party. He resigned from the IAS in 2019 over the situation in Jammu and Kashmir. Gopinathan stated that the Congress offers him a platform to serve the people and speak against injustice. His joining was announced in New Delhi in the presence of senior party leaders.\n\nMumbai Congress leadership has urged the party high command to contest the upcoming civic elections solo, citing a desire to strengthen grassroots networks. While local leaders favor going it alone, the final decision rests with the Delhi leadership, which will consider the UBT Shiv Sena's stance and the broader goal of defeating the BJP.\n\nThe Supreme Court has refused to entertain a PIL seeking a Special Investigation Team probe into Rahul Gandhi's allegations of voter list anomalies. A division bench stated the petitioner could pursue their remedy elsewhere, not through a PIL in court. The bench also declined to direct the Election Commission of India (ECI) to decide the petitioner's representation.",
  "url": "https://economictimes.indiatimes.com/news/politics",
  "scraped_timestamp": "2025-10-14T15:52:41.382324",
  "content_length": 4043,
  "word_count": 610,
  "source_domain": "economictimes.indiatimes.com"
}