{
  "title": "Politics",
  "content": "Jan Suraaj Party founder Prashant Kishor vowed to confiscate the wealth of Bihar's top 100 corrupt politicians and bureaucrats within his first month in power. He also criticized the NDA government for rampant corruption, highlighting Deputy Chief Minister Samrat Choudhary's alleged involvement in a murder case.\n\nJan Suraaj Party founder Prashant Kishor announced he will not contest the upcoming Bihar assembly elections, citing the larger interest of the party. He stated the decision would allow him to focus on organizational work, emphasizing the potential nationwide impact of his party's victory.\n\nFormer Manipur CM N. Biren Singh stated President's Rule, imposed 11 times previously, has improved the law and order situation since February. He emphasized that decisions on forming a popular government rest with the national BJP leadership, not the state, and assured that people's views are being conveyed to the central leadership.\n\nBrijeshwar Kashyap, son of former BJP MP Virender Kashyap, faces rape and criminal intimidation charges. A woman accused him of sexual exploitation under a false marriage promise. Police registered a case under the Bharatiya Nyaya Sanhita. This follows another high-profile arrest of Ram Kumar Bindal, brother of Himachal BJP President Rajiv Bindal, for alleged rape. Investigations are ongoing.\n\nA Dalit IPS officer's alleged suicide in Haryana has put the ruling BJP in a difficult spot. The incident has intensified caste tensions and drawn attention from political leaders. Investigations are ongoing, with family members demanding action against officials named in the officer's note. The BJP is closely monitoring the situation, concerned about potential political fallout in poll-bound Bihar.\n\nWest Bengal's CEO office is accelerating booth mapping for Special Intensive Revision, with data for Jhargram, West Midnapore, and Alipurduar now uploaded. Voters can check their details online. The process, based on the 2002 SIR benchmark, aims for completion before Diwali holidays, with District Magistrates urged to expedite efforts.\n\nOn President of Mongolia Khurelsukh Ukhnaa's visit to India, Secretary (East) P Kumaran said, \"The President of Mongolia Khurelsukh Ukhnaa is on a state visit to India from 13th to 16th October 2025. This is his first visit to India in his capacity as President of Mongolia, and it takes place at a particularly meaningful moment as India and Mongolia commemorate 70 years of the establishment of diplomatic relations this year.  We also mark 10 years of our strategic partnership this year. The President is accompanied by a large delegation... His visit reflects the depth of the political relationship and the importance that both sides attach to this strategic partnership anchored in ancient civilizational ties, shared Buddhist heritage, democratic values...\"\n\nIn a dramatic turn of events, the Delhi High Court has allowed the Enforcement Directorate one last opportunity to make its case against former Chief Minister Arvind Kejriwal, who is currently free on bail due to a Supreme Court ruling. This marks the ED's ninth request for adjournment, a move that Kejriwal's legal counsel vehemently disputes.\n\nBihar's ruling NDA coalition leaders have confirmed seat allocation is settled. Discussions on specific constituencies are in the final stages. Despite some dissatisfaction, all parties stand united under Narendra Modi and Nitish Kumar. The NDA is ready to contest the upcoming assembly elections. The coalition aims to win and uphold Bihar's pride.\n\nKarnataka Minister Priyank Kharge reported receiving threats and abuse after advocating a ban on RSS activities in government-owned public spaces. He stated his resolve to continue advocating for a society based on equality and compassion, despite the backlash. Chief Minister Siddaramaiah has initiated a study into similar measures adopted by Tamil Nadu.\n\nFollowing the suspected death by suicide of a young IT professional in Kerala, Rashtriya Swayamsevak Sangh-Dakshin Kerala denied the allegations of sexual abuse, calling them \"dubious and baseless.\"\n\nThe Congress criticised the government after US President Donald Trump praised Pakistan Army Chief Asim Munir, questioning the signal sent to India despite Prime Minister Modi's efforts to appease Trump.",
  "url": "https://economictimes.indiatimes.com/news/politics",
  "scraped_timestamp": "2025-10-15T10:21:45.500212",
  "content_length": 4311,
  "word_count": 646,
  "source_domain": "economictimes.indiatimes.com"
}