{
  "title": "Policy",
  "content": "Former CJI Sanjiv Khanna urged a more nuanced approach to financial fraud laws, advocating for distinctions between intentional fraud, unintentional error, and procedural lapses. He emphasized that mental intent is the key differentiator and cautioned against reverse burden of proof provisions in financial legislations.\n\nIndia's economy shows strong resilience amid global uncertainty. Robust domestic demand and sound policies are driving significant growth. India is set to contribute a substantial portion to global GDP expansion. The nation is actively pursuing fair trade agreements, securing its interests. Structural reforms and strategic positioning underpin this economic strength, navigating a changing world order.\n\nUsage of cheques has plunged since the Covid pandemic. The growth in the value of cheques processed by banks fell 10% between 2019 and 2024. In the same period, the value of funds transferred via RTGS increased 12%. Meanwhile, the number of UPI transactions crossed 20 billion in August, reaching nearly Rs 25 lakh crore, underscoring its high usage for retail payments.\n\nThe government is proposing significant amendments to the Electricity Act, aiming to introduce cost-reflective tariffs and phase out cross-subsidies for industries within five years. These changes seek to boost manufacturing competitiveness and address the financial stress in the distribution sector. The draft bill also proposes easing rules for multiple distribution licensees and establishing a high-level council for sector reforms.\n\nThe Reserve Bank of India has proposed to repeal approximately 9,000 circulars to reduce regulatory burden and compliance costs. This move consolidates existing instructions into 238 Master Directions, aiming to simplify the regulatory framework. The central bank is seeking public comments on these draft consolidation documents.\n\nIn its Tax Policy Working Paper Series - II: Towards India’s Tax Transformation: Decriminalisation and Trust-Based Governance, released on Friday, the Aayog said decriminalisation, rationalisation of punishments, and emphasis on proportionate sanctions will collectively align India’s income-tax law with the vision of a fair, accessible, and modern compliance regime.\n\nIndia’s markets continue to reflect a balance between global confidence and domestic conviction, Sebi chief Tuhin Kanta Pandey said. While FPIs may move with the tides of global liquidity, India’s structural story -- built on steady growth, evolving regulation, and deepening investor participation -- remains intact, he added.\n\nThe Reserve Bank of India's new real-time cheque clearance system is experiencing glitches, with customers reporting delays due to inadequate staff training and tech integration issues. While aiming for same-day clearance, some cheques are being rejected or processed with old schedules, negating the system's benefits. Bankers anticipate these teething problems will be resolved within weeks.\n\nThe Reserve Bank of India has reshuffled portfolios among its four deputy governors. New deputy governor Shirish Chandra Murmu takes charge of key departments. T Rabi Sankar, Swaminathan Janakiraman, and Poonam Gupta also receive new departmental responsibilities. Gupta will oversee Monetary Policy. Sankar is assigned 12 departments including IT and foreign exchange. Janakiraman will manage supervision and financial inclusion.\n\nThe Reserve Bank of India is proposing new rules for bank loans. These changes aim to reward good credit habits.  Banks will have lower capital requirements for certain loans. This could lead to more lending.  Credit card users who pay on time will benefit.  Big home loans may see tighter rules.  These proposals are for future implementation.\n\nThe RBI has launched four digital payment initiatives at the Global Fintech Fest to enhance customer convenience. These include AI-based UPI HELP for payment assistance and dispute resolution, and IoT Payments for transactions from connected devices. Additionally, 'Banking Connect' offers interoperable net banking, and 'UPI Reserve Pay' allows users to manage credit limits for specific purposes.\n\nThe Reserve Bank of India has launched a retail sandbox for its central bank digital currency (CBDC), enabling fintech firms to develop and test solutions for the ongoing pilot. This initiative follows the commencement of the e-rupee pilot on December 1, 2022, which has already garnered approximately 7 million users in India.\n\nThe Coal Ministry is proposing a new law for coal workers' social security and pensions. This legislation will replace an act from 1948. It will address industrial disputes, working conditions, and digitalization. Stakeholders are invited to comment on the draft bill. The new framework aims for greater accountability and effectiveness in the coal sector.\n\nRecent tax reliefs are expected to stimulate domestic consumption. This could lead to a broad-based rebound in private investment within three to four months. Simplification of GST will also benefit businesses, especially MSMEs, by improving working capital. The government's focus on capex and innovation continues. Watch for sustained consumption pickup.\n\nThe MSME ministry is planning a nationwide survey to understand the challenges faced by micro and small enterprises. This initiative aims to gather feedback at the cluster level to identify sector-specific problems. The findings will help design policies to boost competitiveness and cost-effectiveness for these businesses.\n\nReserve Bank of India Deputy Governor T Rabi Sankar warned at the Global Fintech Fest 2025 that while AI offers immense financial sector benefits, it also poses unprecedented risks if unchecked. He stressed the need for \"safety by design\" and rigorous oversight for AI integration, highlighting the RBI's MuleHunter.ai as a successful anti-fraud tool.",
  "url": "https://economictimes.indiatimes.com/news/economy/policy",
  "scraped_timestamp": "2025-10-11T23:53:39.977593",
  "content_length": 5866,
  "word_count": 846,
  "source_domain": "economictimes.indiatimes.com"
}