{
  "title": "Policy",
  "content": "Economists anticipate the Reserve Bank of India (RBI) to maintain policy rates next week, despite potential for cuts, due to uncertainties from US tariffs and GST impacts. While some advocate for proactive rate cuts given low inflation, the majority prefers retaining options, awaiting clearer signs of economic slowdown and assessing the effects of recent GST reductions on inflation and growth.\n\nGST 2.0 will cut household taxes by 27–30%, easing budgets and making essential and discretionary items more affordable, according to a FICCI CASCADE-TARI report. The progressive tax structure benefits higher-income groups, supports MSMEs, and promotes formalisation. The number of items taxed at 5% has nearly tripled to 149, helping curb smuggling and counterfeit goods.\n\nThe Reserve Bank of India has released final guidelines for digital payment authentication, effective April 1, 2026, to enhance security and encourage fraud prevention innovation. Issuers can implement risk-based checks beyond two-factor authentication. The framework promotes new technologies while retaining SMS-based OTPs and mandates additional authentication for specific cross-border transactions.\n\nPrime Minister Narendra Modi emphasized the advantages of lowered GST rates and affirmed the ongoing nature of GST reforms to bolster India's economic growth. He highlighted that these structural reforms will simplify GST registration, reduce tax disputes, and expedite refunds for MSMEs. Modi expressed confidence that as the economy strengthens, the tax burden on citizens will further decrease.\n\nTax authorities are set to leverage new provisions in the Companies Act to access data stored on servers located outside India. The government has instructed tax officials to utilize these rules, requiring companies to maintain daily backups of their books of account on Indian servers, even if primary storage is offshore.\n\nNirmala Sitharaman launched the Goods and Services Tax Appellate Tribunal. GSTAT aims to reduce tax litigation. It will provide a single tax regime. The focus is on simplified decisions and digital filings. GSTAT and GST reforms will unlock capital. It will reduce legal issues. This will facilitate faster cash flow for MSMEs. It will help exporters and investors.\n\nThe RBI’s monthly report said tax reforms, GST simplification, and accommodative monetary policy are expected to support sustained consumption, ease of doing business, and investment, boosting growth optimism for H2 FY26 despite US tariff headwinds.\n\nNirmala Sitharaman inaugurated the Goods and Services Tax Appellate Tribunal. This aims to speed up dispute resolutions between businesses and tax authorities. Businesses can now file cases on the portal. Hearings are expected to begin in December. The tribunal will act as a one-stop forum for GST disputes. The limitation period for filing appeals is extended.\n\nThe RBI Bulletin said the recent GST reforms are expected to boost ease of doing business, lower retail prices, and strengthen consumption. The September 3 GST Council meeting streamlined rates from four slabs to mainly two (5% and 18%), rationalised sectors, addressed inverted duties, and simplified processes like registration, returns, and refunds, benefiting MSMEs, startups, and consumers.\n\nThe Comptroller and Auditor General of India (CAG) and the Central Board of Direct Taxes (CBDT) have signed a MoU to boost operational effectiveness through collaboration in training, research, and technology. CAG K Sanjay Murthy highlighted that this partnership will enhance professional cooperation and capacity building, especially in data-driven technology.\n\nThe Union Cabinet has approved Rs 69,725 crore for shipping and maritime development. This includes a maritime development fund and shipbuilding financial assistance. The cabinet also approved highway and railway line projects in Bihar. Railway employees will receive a productivity-linked bonus. These measures aim to boost domestic shipbuilding and attract significant investment.\n\nThe Reserve Bank of India has reaffirmed its dedication to the FX Global Code. This code promotes integrity in the foreign exchange market. It establishes guidelines for effective operations. The RBI's commitment ensures its FX market activities align with the code's principles. The Global Foreign Exchange Committee maintains and updates the code.\n\nMaharashtra is considering monetizing anonymized, non-personal data from its 'Samanvay' platform, containing details of welfare scheme beneficiaries. This 'Golden Data,' accessible via a unique 'MahaID,' aims to improve welfare delivery and eliminate ineligible recipients. The government believes this data can aid private companies in market research, though a final decision is pending.\n\nPrice reductions under the GST overhaul have accelerated demand for higher-end products, companies report. Sales of 55–65 inch TVs, five-star ACs, premium cars, and ₹1,000–2,500 apparel and footwear have surged, while entry-level models remain flat. Online platforms like Amazon, Flipkart, and JioMart saw a 30–35% jump in sales of items most affected by the tax cuts, with offline retailers expecting similar trends during Dussehra.\n\nFederation of Indian Micro and Small & Medium Enterprises requests government action. They want an automatic refund system for input tax credit under GST. FISME also suggests a lower tax rate on raw materials. This applies if the final product has a lower tax rate. The goal is to address challenges faced by MSMEs due to the inverted tax structure.\n\nFollowing the GST rate changes on September 22, the government is reviewing industry concerns, particularly regarding group insurance and the paper sector, for potential discussion at the next GST Council meeting. The focus is on smooth transition, automated returns and refunds, and invoice management.",
  "url": "https://economictimes.indiatimes.com/news/economy/policy",
  "scraped_timestamp": "2025-09-26T17:01:55.592705",
  "content_length": 5859,
  "word_count": 853,
  "source_domain": "economictimes.indiatimes.com"
}