{
  "title": "Policy",
  "content": "The government has extended the 16th Finance Commission's tenure by one month to November 30. Chaired by Arvind Panagariya, the commission, which was constituted on December 31, 2023, will recommend tax distribution between the Centre and states for the 2026-2031 period. It will also review disaster management financing arrangements.\n\nReserve Bank of India is launching a Digital Payments Intelligence Platform (DPIP) that will use AI to detect and prevent payment frauds in real time. Initially, a negative registry will flag suspicious entities, with the platform expanding to analyze transactions and assign risk scores for preventive measures.\n\nThe Centre has relaxed loan conditions for states' capital expenditure. A larger portion of funds is now untied, offering states more project flexibility. States that have utilized initial loan installments can access remaining funds without further conditions by onboarding the single nodal agency system. This move aims to boost transparency and encourage reform adoption.\n\nThe Ministry of Labour and Employment will launch an annual index in 2026 to evaluate states and union territories on their implementation of labour welfare measures. This index will rank them based on inclusiveness, efficiency, and innovation, aiming to foster competitive federalism and attract investments.\n\nEPFO has extended the deadline for filing EPF returns for September to October 22, 2025, to accommodate employers adapting to the new revamped ECR system. The labour ministry stated that awareness programs and interactive sessions are being conducted to ensure a smooth transition and timely, error-free filing.\n\nAt the 238th meeting of the Central Board of Trustees (CBT) of EPFO, chaired by the labour and employment minister Mansukh Mandaviya, on Monday, the board also gave its go ahead to the ‘Vishwas Scheme’ to reduce litigation through rationalised penal damages, a comprehensive member-centric digital transformation framework, EPFO 3.0, to modernize provident fund services, EPFO’s tie-up with the India Post Payments Bank (IPPB) to provide doorstep Digital Life Certificate (DLC) services and appointment of four fund managers to manage the debt portfolio of EPFO.\n\nGlobal rating agencies S&P and Fitch have welcomed the RBI's reform package, stating it will strengthen the banking operating environment and boost credit flow. The introduction of an expected credit loss (ECL) framework and revised Basel III norms, along with relaxed risk weights for certain sectors, are expected to improve bank profitability and capital ratios, potentially driving credit growth.\n\nUnder EPFO's Employees’ Enrolment Campaign, employers can enroll all existing employees, who joined the establishment between July 1, 2017, and October 31, 2025, and who are alive and employed on the date of the declaration, but were not enrolled in the EPF scheme earlier due to any reason, whatsoever, the ministry said in a notification. While an employee's share of provident fund contribution stands waived, the employer is only required to pay their own share for such a period.\n\nAn expert team led by TV Mohandas Pai has urged the 16th Finance Commission to cap cess and surcharges at 10% of gross tax revenue to protect states' fiscal interests. They recommend mandatory sharing of collections above this cap with states, aiming to ensure equitable resource distribution and prevent overuse of these levies.\n\nThe CBIC has launched a vigilance investigation into allegations of irregularities by Chennai-based importer M/s Wintrack Inc against Chennai customs officials. Officers named in the preliminary report have been relieved of duties and transferred, while the customs broker agent's license is suspended.\n\nFormer CJI Sanjiv Khanna urged a more nuanced approach to financial fraud laws, advocating for distinctions between intentional fraud, unintentional error, and procedural lapses. He emphasized that mental intent is the key differentiator and cautioned against reverse burden of proof provisions in financial legislations.\n\nIndia's economy shows strong resilience amid global uncertainty. Robust domestic demand and sound policies are driving significant growth. India is set to contribute a substantial portion to global GDP expansion. The nation is actively pursuing fair trade agreements, securing its interests. Structural reforms and strategic positioning underpin this economic strength, navigating a changing world order.\n\nUsage of cheques has plunged since the Covid pandemic. The growth in the value of cheques processed by banks fell 10% between 2019 and 2024. In the same period, the value of funds transferred via RTGS increased 12%. Meanwhile, the number of UPI transactions crossed 20 billion in August, reaching nearly Rs 25 lakh crore, underscoring its high usage for retail payments.\n\nThe government is proposing significant amendments to the Electricity Act, aiming to introduce cost-reflective tariffs and phase out cross-subsidies for industries within five years. These changes seek to boost manufacturing competitiveness and address the financial stress in the distribution sector. The draft bill also proposes easing rules for multiple distribution licensees and establishing a high-level council for sector reforms.\n\nThe Reserve Bank of India has proposed to repeal approximately 9,000 circulars to reduce regulatory burden and compliance costs. This move consolidates existing instructions into 238 Master Directions, aiming to simplify the regulatory framework. The central bank is seeking public comments on these draft consolidation documents.\n\nIn its Tax Policy Working Paper Series - II: Towards India’s Tax Transformation: Decriminalisation and Trust-Based Governance, released on Friday, the Aayog said decriminalisation, rationalisation of punishments, and emphasis on proportionate sanctions will collectively align India’s income-tax law with the vision of a fair, accessible, and modern compliance regime.",
  "url": "https://economictimes.indiatimes.com/news/economy/policy",
  "scraped_timestamp": "2025-10-14T14:54:51.699598",
  "content_length": 5978,
  "word_count": 875,
  "source_domain": "economictimes.indiatimes.com"
}