{
  "title": "Politics",
  "content": "Bihar Chief Minister Nitish Kumar criticized Lalu Prasad for prioritizing his family. Kumar highlighted the NDA government's focus on women's empowerment and state development since 2005. He contrasted this with the previous government's actions. Prime Minister Narendra Modi launched the Mukhya Mantri Mahila Rojgar Yojana. The scheme aims to promote self-employment for women. The launch occurred virtually, with many participants.\n\nDelhi Chief Minister Rekha Gupta, addressing students at Deen Dayal Upadhyaya College, urged them to embrace Hindi, adopt swadeshi, and uphold Antyodaya principles for a developed India by 2047. She assured the college of consistent funding, praised Pandit Deen Dayal Upadhyaya's guiding influence, and emphasized patriotism alongside academic excellence.\n\nBihar Chief Minister Nitish Kumar criticized Lalu Prasad for prioritizing his family. Kumar highlighted the NDA government's focus on women's empowerment and state development since 2005. He contrasted this with the previous government's actions. Prime Minister Narendra Modi launched the Mukhya Mantri Mahila Rojgar Yojana. The scheme aims to promote self-employment for women. The launch occurred virtually, with many participants.\n\nDelhi Chief Minister Rekha Gupta, addressing students at Deen Dayal Upadhyaya College, urged them to embrace Hindi, adopt swadeshi, and uphold Antyodaya principles for a developed India by 2047. She assured the college of consistent funding, praised Pandit Deen Dayal Upadhyaya's guiding influence, and emphasized patriotism alongside academic excellence.\n\nA Sambhal court has scheduled October 28 as the next hearing date in a case against Rahul Gandhi concerning his remarks made during the AICC office inauguration earlier this year. The case, filed by Hindu Shakti Dal's Simran Gupta, alleges that Gandhi's statement hurt public sentiments.\n\nChief Minister Siddaramaiah has set an October 7 deadline for the socio-economic and educational survey, urging enumerators to cover 10% of families daily. Despite a slow start due to technical issues, the CM emphasized the importance of surveying every household, especially in Bengaluru.\n\nKarnataka Chief Minister Siddaramaiah announced that technical glitches affecting the state's caste census have been largely resolved, ensuring the survey proceeds at full speed. He emphasized that the survey, scheduled to conclude on October 7, will not be extended, despite concerns over its slow pace. The High Court has directed the commission to maintain data confidentiality and ensure voluntary participation.\n\nThe CBI has apprehended Amit Das, an accused who had been absconding in connection with the murder of BJP leader Abhijit Sarkar. Sarkar was killed in Kolkata during post-poll violence in West Bengal in May 2021. Das was arrested on Thursday based on intelligence and technical analysis, and he will be presented in court today.\n\nThe Supreme Court has eased travel restrictions for MLA Abbas Ansari. He can now travel outside Uttar Pradesh with prior notice. The court wants to ensure trials against him proceed without delay. Ansari must cooperate in these legal proceedings. The court clarified that restrictions on speaking about sub-judice cases do not prevent him from discussing public welfare.\n\nUnion Home Minister Amit Shah inaugurated a Durga Puja pandal in Kolkata. The pandal's theme is \"Operation Sindoor\", a tribute to the Indian Army. Shah prayed for a new government in West Bengal after the 2026 elections. He hopes to restore the state's glory. Abhishek Banerjee criticized Shah's promises. Banerjee questioned the release of funds owed to West Bengal.\n\nRahul Gandhi voiced his support for Uttarakhand students protesting a paper leak, alleging a connection between unemployment and \"vote chori.\" He accused the BJP of prioritizing power over youth employment, labeling them \"paper chor.\" Gandhi claimed the BJP steals votes to stay in power despite the ruined dreams of hardworking youth due to repeated paper leaks.\n\nArvind Kejriwal has criticized the central government. He alleges harassment of Sonam Wangchuk. Wangchuk protested for statehood and inclusion in the Sixth Schedule in Ladakh. Restrictions are imposed in Leh under Section 163. The government is actively engaged with Apex Body Leh and Kargil Democratic Alliance. A High-Powered Committee meeting is scheduled for October 6.",
  "url": "https://economictimes.indiatimes.com/news/politics",
  "scraped_timestamp": "2025-09-26T17:43:02.423681",
  "content_length": 4390,
  "word_count": 649,
  "source_domain": "economictimes.indiatimes.com"
}