{
  "title": "Pre-certify ads, ECI directs parties",
  "content": "The Election Commission of India (ECI) has directed all political parties and candidates contesting the upcoming Bihar Assembly elections and bye-elections in six states and the Union Territory of Jammu and Kashmir to obtain pre-certification for all political advertisements released on electronic and social media platforms.\n\nThe directive follows the announcement of the Bihar Assembly election schedule on October 6. In a notification issued on Tueaday, the Commission stated that every registered, national, and state political party, as well as individual contesting candidates, must submit all political advertisements for approval by the Media Certification and Monitoring Committee (MCMC) before publication or broadcast.\n\nThe ECI has constituted MCMCs at both state and district levels to scrutinize and certify advertisements in line with its existing guidelines. These committees are also tasked with monitoring media content for instances of paid news and taking appropriate action where violations are suspected.\n\nThe Commission clarified that no political advertisements can be released on any internet-based media, including social media platforms, without pre-certification from the concerned MCMC. This measure, according to officials, is part of the Commission’s continuing framework to ensure that election campaigns remain transparent and comply with the Model Code of Conduct.\n\nAcknowledging the increasing role of digital campaigning, the ECI has also instructed candidates to provide details of their authentic social media accounts at the time of filing nomination papers. This requirement aims to prevent impersonation and to enable proper monitoring of campaign-related online activity.\n\nThe directive draws upon provisions under Section 77(1) of the Representation of the People Act, 1951, which governs election expenditure, and follows earlier Supreme Court directions mandating transparency in political spending on digital platforms.\n\nUnder these rules, political parties must submit a detailed statement of expenditure on internet-based campaigning within 75 days of the completion of the Assembly elections. The statement must include all payments made to internet companies and websites for advertisements, along with the costs related to developing digital campaign content and maintaining social media operations.",
  "url": "https://www.hindustantimes.com/india-news/precertify-ads-eci-directs-parties-101760468335787.html",
  "scraped_timestamp": "2025-10-15T09:58:35.933041",
  "content_length": 2350,
  "word_count": 329,
  "source_domain": "www.hindustantimes.com"
}