{
  "title": "Rajasthan man arrested for sharing sensitive info on army to Pakistan",
  "content": "A man has been arrested in Rajasthan for allegedly sending confidential information related to the Indian Army to the Pakistani intelligence agency ISI, an official said on Thursday.\n\n47-year-old Hanif Mir Khan, a resident of Jaisalmer, has been booked under the Official Secrets Act and taken into custody, ANI reported. Jaisalmer district in Rajasthan lies close to the India-Pakistan border.\n\nVishnukant, IGP of CID (Security), said that a team of Rajasthan CID found Khan's activities suspicious, following which an investigation was launched. The probe revealed that Kan was in constant contact with the Pakistani intelligence agency through social media.\n\nThe accused is a resident of Basanpir Juni in Jaisalmer district and currently resides in Mohangarh area of the district.\n\nThe investigation revealed that Hanif Khan had easy access to border areas and possessed information about important military installations and troop movements, sources in the Rajasthan Police told ANI.\n\nThe sources further said that he was in contact with a Pakistani handler ever during the Operation Sindoor, which India launched against terror infrastructure in Pakistan and Pakistan-occupied Kashmir in May.\n\nThey said that Khan was sharing information about troop movements to the Pakistani agency in exchange for money.\n\nAn interrogation by intelligence agencies at the Central Interrogation Centre, Jaipur, and an investigation of his mobile phone also revealed that he was providing military strategic information to the ISI.\n\nThe Indian agencies have arrested at least one dozen people from several states, including Punjab, Haryana, Uttar Pradesh for espionage activities linked to Pakistan.",
  "url": "https://www.hindustantimes.com/india-news/rajasthan-man-arrested-for-sharing-sensitive-info-related-to-army-to-pakistan-101758817370270.html",
  "scraped_timestamp": "2025-09-26T00:56:11.406740",
  "content_length": 1687,
  "word_count": 251,
  "source_domain": "www.hindustantimes.com"
}