{
  "title": "Rajasthan announces Diwali bonus for state government employees | Details",
  "content": "RajasthanChief Minister Bhajanlal Sharma on Tuesday announced an ad hoc bonus for around six lakh state government employees on the occasion of Diwali.\n\nThe Chief Minister said that the bonus would be extended to those working at pay level L-12 or with a grade pay of₹4,800 or less. He said that each eligible employee would receive a maximum ad hoc bonus of₹6774.\n\nIn a post on X, the Chief Minister wrote, “Special Gift for State Government Employees on the Occasion of Diwali! Our government, dedicated to good governance, has announced the provision of an ad hoc bonus for approximately 6 lakh employees on the auspicious occasion of Diwali.”\n\n\"This bonus will be given to those state government employees who are working at pay level L-12 or grade pay₹4800 and below salary scales. Each eligible employee will receive a maximum ad hoc bonus of₹6774. The benefit of this decision will also extend to employees of Panchayat Samiti and District Council,\" the CM further wrote.\n\nA day earlier, the Chief Minister Bhajanlal Sharma inspected preparations in Jaipur ahead of Union Home MinisterAmit Shah'svisit to attend the inauguration programme of the exhibition on new criminal laws.\n\nThe exhibition, marks one year since the implementation of the new criminal laws--the Bharatiya Nyaya Sanhita, Bharatiya Nagarik Suraksha Sanhita, and Bharatiya Sakshya Adhiniyam--which came into effect on July 1, 2024. The exhibition will run from October 13 to 18.\n\nSpeaking to the reporters, Director General of Police (DGP) of Rajasthan, Rajeev Sharma, urged the public to visit the upcoming exhibition on India's new criminal laws. \"Union Home Minister Amit Shah will attend the inauguration program of the exhibition on new criminal laws. The public should visit the exhibition to get information regarding them,\" DGP Sharma said.\n\nThe three new criminal laws were conceptualised with the vision of the Prime Minister to replace colonial-era laws that persisted post-independence and to reform the judicial system by shifting the focus from punishment to justice.\n\nThe theme of the program is \"Secure Society, Developed India- From Punishment to Justice\". New Criminal Laws replaced the Indian Penal Code (IPC), the Code of Criminal Procedure (CrPC), and the Indian Evidence Act.",
  "url": "https://www.hindustantimes.com/india-news/rajasthan-announces-diwali-bonus-for-state-government-employees-details-101760422378138.html",
  "scraped_timestamp": "2025-10-14T15:03:05.778665",
  "content_length": 2272,
  "word_count": 359,
  "source_domain": "www.hindustantimes.com"
}