{
  "title": "Rajnath takes part in special cleanliness drive at Army Headquarters Unit Run Canteen",
  "content": "New Delhi, Defence Minister Rajnath Singh on Thursday led a special cleanliness initiative at the Army Headquarters Unit Run Canteen here, and highlighted cleanliness is not just about tidiness but a \"way of life\" that reflects discipline and responsibility.\n\nThe drive was part of 'Swachhotsav 2025', held under the ongoing 'Swachhata Hi Seva' mega campaign across the Ministry of Defence from September 17 to October 2, the ministry said.\n\nSingh led the special cleanliness initiative, 'Ek Din, Ek Ghanta, Ek Saath' at the Army Headquarters Unit Run Canteen. The event highlighted the power of collective effort in creating a clean, green, and healthy environment.\n\nThis year's theme connects with the festive spirit of the nation while reinforcing the vision of a cleaner India, the ministry said in a statement.\n\nDuring the event, Singh took the 'Swachhata Sankalp', reaffirming his commitment to cleanliness.\n\nHe also honoured 'Safai Mitras' for their dedication to sanitation and participated in a tree-plantation drive to promote an eco-friendly, zero-waste environment, it said.\n\nIn a symbolic gesture, he flagged off a 'Safai Run' with 100 NCC cadets, highlighting the role of youth in advancing the 'Swachh Bharat Abhiyaan'.\n\nAddressing the gathering, the Union minister said cleanliness is not just about tidiness but a \"way of life\" that reflects discipline and responsibility. He pointed out that clean surroundings improve health, mental well-being, and inner peace, while unclean spaces can spread disease and negativity.\n\nDrawing on India’s traditions, he noted that cleanliness has always been valued as a mark of a civilised society.\n\nThe Ministry of Defence is contributing through collective drives, waste-to-wealth initiatives, and transforming camps and offices into model centres of cleanliness.\n\nHe also expressed pride that all military camps are now \"open-defecation free\", reflecting the discipline of the armed forces and dedication of the civilian workforce.\n\nSingh added that a healthy, clean, and conscious society is a pillar of national security and urged everyone to adopt cleanliness as a national duty, inspiring others to contribute to a clean, healthy, and developed India.\n\nThe drive saw participation from Chief of Defence Staff Gen Anil Chauhan, Chief of Army Staff Gen Upendra Dwivedi, IAF Chief A P Singh, DRDO chairman Samir V Kamat, along with other senior officials and army personnel, it said.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/rajnath-takes-part-in-special-cleanliness-drive-at-army-headquarters-unit-run-canteen-101758823062724.html",
  "scraped_timestamp": "2025-09-26T00:23:37.838551",
  "content_length": 2534,
  "word_count": 389,
  "source_domain": "www.hindustantimes.com"
}