{
  "title": "Rape or gang-rape? Big twists and turns after CCTV footage, new arrest in Durgapur horror",
  "content": "The investigation into the alleged rape of a 23-year-old medical student in Durgapur took a dramatic turn on Tuesday after the Bengal police arrested her male classmate, the sixth person to be held in the case, andclaimed that the assault appeared to have been carried out by a single accused, HT reported earlier.\n\nThe classmate, a resident of Malda district, was detained on October 11 and arrested on Tuesday after investigators found “glaring inconsistencies” in his statements.\n\nHis arrest came hours after Asansol-Durgapur Police commissioner Sunil Kumar Choudhary ruled out gangrape, saying, “Investigation and medical reports have so far indicated the involvement of only one person. The roles of the others are being reviewed. The friend of the victim is not above suspicion.”\n\nAlso Read |‘No gangrape, friend arrested’: Major twist in Durgapur case in Bengal | Key points\n\nAddressing a press conference earlier in the day, Sunil Kumar Choudhary said, “That one person is among the suspects. The victim’s friend was taken to the place of occurrence along with the five others. The clothes he was wearing (during the incident) were seized and sent for forensic test along with the clothes of the other suspects.”\n\nHe added that the “statement of the victim was recorded by a magistrate on Tuesday afternoon\".\n\nAlso Read |CCTV footage shows Durgapur survivor, friend walking back to campus together\n\nThe woman, a resident of Jaleshwar in Odisha, is admitted at the private IQ City Medical College Hospital where she is a student. Her medical tests were done at the same hospital.\n\nSecurity camera footage from the private medical college showed the survivor and her male friend leaving the campus at 7.54pm on October 10. The footage revealed the friend returning alone around 8.42pm, loitering for a few minutes, leaving again at 8.48pm, and coming back with the survivor at 9.29pm.\n\nDespite the apparent gap, the friend “did not report the incident to anyone\", police said.\n\nThe survivor later alleged that the accused called her friend from her phone after she was raped and demanded₹3,000 to return the mobile device. The phone was recovered from one of the suspects.\n\nThe survivor’s father, who lodged a police complaint on October 11, also named her classmate as a suspect. “I am sure that her friend definitely has some kind of involvement in the crime. He accompanied my daughter out of the college. I think this could be pre-planned, or else this could not have happened,” he alleged.\n\nPolice said the arrested student will be produced before the Durgapur court on Wednesday.\n\nFive local villagers, Sheikh Safiqul (30), Sheikh Nasiruddin (23), Apu Bauri (21), Firdous Sheikh (23), and Sheikh Riazuddin (31), were earlier arrested based on phone call records and circumstantial evidence. All are daily wage labourers from nearby villages.\n\nTwo of them were remanded in police custody for nine days, while the remaining three were sent to custody for 10 days.\n\nHowever, investigators later found “several discrepancies” between the survivor’s statements, medical reports, and testimonies of the accused.\n\n“In her initial statement to the doctor, the survivor mentioned three persons and alleged that only one committed the crime, but later told the police that five persons dragged her to the forest and gangraped her,” an officer told HT, adding that “evidence did not point to gangrape\".\n\nThe case has sparked a political storm between West Bengal and Odisha, where the survivor hails from.\n\nOdisha chief minister Mohan Charan Majhi spoke to the survivor’s father and promised full legal and administrative support. “The culprits must face the severest punishment,” Majhi said.\n\nOdisha State Commission for Women (OSCW) chairperson Sovana Mohanty announced that a team would visit Durgapur to assess the survivor’s safety. Calling the incident “barbaric, condemnable, and painful,” Mohanty alleged, “The girl and her male friend had gone out to have puchka in the evening when three miscreants accosted them, demanded money, and later took turns to rape her after the boy fled.”\n\nShe further accused the Bengal government of allowing a “complete collapse of law and order” and claimed that “persons belonging to the minority community” were involved, remarks that drew sharp criticism from Trinamool Congress leaders for “communalising” the issue.\n\nWest Bengal chief minister Mamata Banerjee faced backlash for questioning why the student had gone out late at night. “She was studying in a private medical college. Whose responsibility is it? How did she come out at 12.30 at night?” she asked, suggesting hostel students “should avoid venturing out late at night\".\n\nReacting sharply, Odisha BJP MP Pratap Chandra Sarangi, who met the survivor at the hospital, said, “Today, I checked with the authorities, and they told me that the victim had gone out within the permissible time. Then how could the Bengal CM claim she was out at 12:30 at night? This is only to protect the criminals.”\n\nFollowing petitions from hospital authorities, the Calcutta High Court on Tuesday barred the entry of outsiders, including political leaders, into the Durgapur Medical College and Hospital, citing disruptions to classes and patient care. “No outsider, other than the investigating officers, can enter the premises without the hospital’s permission,” a lawyer present at the hearing said.\n\nThe court also ordered police to set up pickets outside the hospital and ensure security in the area.\n\nBJP leaders from Odisha and West Bengal have continued protests in Durgapur, demanding justice for the survivor.\n\nMeanwhile, forensic and medico-legal reports are awaited. “According to the technical evidence available with us and the statement of the victim, the rape was committed by one person. We are probing the exact nature of involvement and the role played by others in this heinous crime,” said Commissioner Choudhary.\n\nThe survivor remains under treatment at the IQ City Medical College Hospital in Durgapur, while her family has sought permission to take her back to Odisha, citing safety concerns. “I have lost trust. I fear for her life here,” her father said.",
  "url": "https://www.hindustantimes.com/india-news/rape-or-gang-rape-big-twists-and-turns-after-cctv-footage-new-arrest-in-durgapur-horror-case-101760503152730.html",
  "scraped_timestamp": "2025-10-15T11:21:23.353288",
  "content_length": 6170,
  "word_count": 985,
  "source_domain": "www.hindustantimes.com"
}