{
  "title": "RG Kar victim's father slams Mamata govt over rape of medical student in Bengal's Durgapur: ‘This admin still…'",
  "content": "The father of the trainee doctor who was raped and murdered at the RG Kar Medical College in Kolkata last year has reacted to the alleged rape of a 23-year-old womannear a campusof a private medical college in West Bengal's Durgapur on Friday night.\n\nHe criticised the West Bengal administration for failing to ensure the safety of doctors and questioned the NCRB data, which labelled West Bengal's Kolkata as the safest place.\n\n“They are doctors, first-class citizens of society, and (the government) cannot ensure their safety... This administration still raises all questions against the victim. Those who lack the ability to protect them should take the responsibility and resign from their posts,” he said, according to news agency ANI.\n\nAlso Read |‘A disturbing pattern’: Medical student's rape in West Bengal's Durgapur sparks political slugfest\n\n\"But, these people are greedy... This administration is not doing its job properly, that's why all these incidents are happening day in and day out... Despite all that's happening, a national report (NCRB) has come out calling West Bengal the safest… How do they make these reports?... How does West Bengal come at number one in this report?\" he said, according to the agency.\n\nSeparately, speaking toThe Indian Express, he said that the Durgapur victim, who belongs to Odisha's Jaleswar, came to Bengal with the dream to build a career and become a doctor.\n\n“Is this an example of a safe city or state? The girl came to this state with the dream to build a career, become a doctor, and serve people. But what happened? She was violated, her dreams shattered. She is alive, but imagine the trauma,” he told IE, urging the government to look into the case.\n\nThe 23-year-old medical student had stepped out with a friend to get food on Friday night when she was allegedly raped outside her college campus. She has alleged that after her friend fled from the spot, the unknown men forcibly took her to a nearby forest where one of them raped her.\n\n“She went out to have food on her friend’s request outside the campus. Three people started following them. Her friend abandoned her and fled. My daughter also started running but couldn’t trace her friend. When the three men found my daughter alone they took her to a nearby forest area. Two more people joined them. One of them committed the crime and snatched her mobile. She was threatened that he would be killed if she dared to shout,” the woman’s mother told the media.\n\nThe police have said that it has registered a first information report (FIR) in the case and a probe has been launched.\n\nLast year, the rape and murder of the trainee doctor at state-run RG Kar Medical College and Hospital in Kolkata led to countrywide protests.\n\nOne person, Sanjay Roy, was sentenced to imprisonment for life till the end of his life by the Sealdah sessions court after having been found guilty of the rape and murder of the doctor.",
  "url": "https://www.hindustantimes.com/india-news/rg-kar-victims-father-slams-bengal-govt-over-rape-of-medical-student-in-durgapur-this-admin-still-101760190637570.html",
  "scraped_timestamp": "2025-10-11T23:53:34.742025",
  "content_length": 2927,
  "word_count": 500,
  "source_domain": "www.hindustantimes.com"
}