{
  "title": "Russia bans fuel exports until end of year after Ukrainian drone attacks on refineries",
  "content": "Russia on Thursday introduced a partial ban on diesel exports and extended an existing ban on gasoline exports until the end of the year after a series of Ukrainian drone attacks on its refineries.\n\nUkraine's drone attacks have drastically brought down Russian oil refining, which fell by almost a fifth on certain days. It also cut fuel exports from key ports, Reuters reported.\n\nRussia's deputy prime minister Alexander Novak announced the decision and said there was a small deficit of oil products. However, he said that oil stockpiles were covering the shortfall.\n\n\"We will soon extend the ban on gasoline exports until the end of the year, and a ban on diesel fuel exports for non-producers will also be introduced until the end of the year,\" Novak was quoted as saying by Interfax.\n\n\"This will allow us to further supply the market with petroleum products,\" he added.\n\nMeanwhile, the head of Russia-controlled Crimea, Sergei Aksyonov, said that disruptions in fuel supplies were related to the closure of some oil refineries.\n\nThe ban on diesel applies to re-sellers, not to producers. However, the volumes of diesel that traders export from Russia are relatively small, Reuters reported, citing industry sources.\n\nProducers ship about three-quarters of diesel exports through the North and South pipelines, which lead to Baltic and Black Sea ports, respectively.\n\nIn 2024, Russia reportedly produced almost 86 million metric tons of diesel and exported nearly 31 million tons. Russia, along with the US, remained top global exporters of diesel via the sea route.\n\nMeanwhile, the ban on gasoline exports covers both producers and re-sellers. However, it does not affect the intergovernmental agreements between Russia and other countries.\n\nThe fuel shortage across Russia is reportedly widening. According to a local newspaper, the country's No.2 oil producer, Lukoil, had banned the sale of gasoline in jerry cans at certain filling stations in Moscow.\n\nThe development gains significance against the backdrop of US President Donald Trump's reservations with other countries' purchase of Russian oil in the face of the war in Ukraine.",
  "url": "https://www.hindustantimes.com/world-news/russia-bans-fuel-exports-until-end-of-year-diesel-gasoline-after-ukrainian-drone-attacks-on-refineries-101758818962863.html",
  "scraped_timestamp": "2025-09-26T00:48:08.458764",
  "content_length": 2142,
  "word_count": 339,
  "source_domain": "www.hindustantimes.com"
}