{
  "title": "Salmonella alert: 2 US companies recall popular dog food; see list of products removed",
  "content": "Two pet food makers have recalled certain products over possible Salmonella contamination, according to federal officials. Foodynamics and Raw Bistro Pet Fare both pulled several dog food items from stores after routine testing found potential contamination.\n\nThis follows a major Listeria outbreak tied to frozen and prepared pasta meals sold atWalmart,Trader Joe’s, Kroger, and Albertsons. The source was pasta from Nate’s Fine Foods, used in the recalled products, causing 19 hospitalizations and four deaths, according to US Express daily.\n\nSalmonella can causediarrhea, vomiting, stomach pain, and fever in humans, and pets may show signs such as fatigue, loss of appetite, or fever.\n\nRaw Dog Barkery Treats for Cats and Dogs (Freeze Dried)\n\nWholeChickenHearts (3 oz., 16 oz.) Lots 030527, 040217\n\nFreeze Dried Chicken Heart Slices (3 oz.) Lot 031627\n\nFreeze Dried Sample Treats (0.1 oz.) Lots 121426, 011526\n\nFreeze Dried Chicken Heart Raw Treats (3 oz.) Lot 031627\n\nRaw Bistro Dog Fare Grass-Fed Beef Entrée, Frozen – 3 lb bags (UPC 858833002247), Lot 239, Best By 08/27/2026\n\nRaw Bistro Dog Fare Grass-Fed Beef Entrée, Bulk – 18 lb cases (UPC 858833002629), Lot 239, Best By 08/27/2026\n\nAlso read:Walmart hit by four food recalls in two months: Which products are affected?\n\nThe recalled Raw Bistro items were sold frozen in sealed packaging between September 1 and 17, 2025, in California, Colorado, Illinois, and Minnesota.\n\nBoth companies advised customers to discard affected items and disinfect any surfaces or feeding tools the food may have touched.",
  "url": "https://www.hindustantimes.com/world-news/us-news/salmonella-alert-2-us-companies-recall-popular-dog-food-see-list-of-products-removed-101760420801924.html",
  "scraped_timestamp": "2025-10-14T15:53:11.154089",
  "content_length": 1564,
  "word_count": 243,
  "source_domain": "www.hindustantimes.com"
}