{
  "title": "SC directs preservation of body of top Maoist commander killed in police encounter",
  "content": "New Delhi, The Supreme Court on Friday directed the Chhattisgarh police to preserve the body of top Maoist commander Katha Ramchandra Reddy, who was killed in an alleged fake encounter in Narayanpur district.\n\nA bench of Justices Dipankar Datta and AG Masih said the body shall not be buried or cremated till the plea alleging fake encounter and torture is decided by the high court.\n\n\"Till such time the high court decides the petition, the body shall not be cremated/buried,\" the bench directed as it requested the high court to take up the plea upon reopening after Durga Puja vacation.\n\nThe bench said it is leaving all contentions open and is not expressing any opinion on merit.\n\nSenior advocate Colin Gonsalves, appearing for petitioner Raja Chandra, submitted that his father was allegedly tortured and killed in a fake encounter and the police are trying to dispose of the body.\n\nSolicitor General Tushar Mehta, appearing for the state police, said that two persons were killed in an encounter and the father of the petitioner carried a bounty of₹7 crore placed by seven states.\n\nHe informed the bench that the body of one Maoist killed in the same encounter was given to his family and cremated while the body of the petitioner's father was in hospital.\n\nMehta said the postmortem was done under video recording and no malafide can be attributed to the police.\n\nThe bench noted that prayers in the petition is investigation of alleged fake encounter by an independent agency preferably by CBI not comprising officers from Chhattisgarh and a fresh postmortem.\n\nIt also noted that the petitioner had approached the high court but the matter could not be listed urgently as the high court was to go on a break and therefore he approached the apex court.\n\nThe bench disposed of the petition with the directions.\n\nThe plea, filed through advocate Satya Mitra, said it expresses concerns over the alleged fake encounter and killing of the petitioner's father, Katha Ramchandra Reddy.\n\nThe petitioner Raja Chandra, who has been a researcher at NALSAR University of Law at Hyderabad and sought directions to the Chhattisgarh government to preserve the body of his father in a government morgue, to conduct postmortem, and to direct the CBI to investigate the death/murder of his father through officers from outside the state of Chhattisgarh.\n\nBoth Katha Ramchandra Reddy and Kadari Satyanarayana Reddy were killed in the encounter on September 22.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/sc-directs-preservation-of-body-of-top-maoist-commander-killed-in-police-encounter-101758872802533.html",
  "scraped_timestamp": "2025-09-26T15:49:37.667164",
  "content_length": 2544,
  "word_count": 419,
  "source_domain": "www.hindustantimes.com"
}