{
  "title": "SC directs preservation of alleged Maoist commander’s body",
  "content": "The Supreme Court on Friday directed that the body of Katha Ramchandra Reddy, killed in an alleged encounter in Chhattisgarh earlier this month, be preserved in a mortuary until the Chhattisgarh High Court decides on a writ petition filed by his son challenging the encounter.\n\nReddy, described by the state as a Maoist commander carrying a bounty of nearly₹2 crore across seven states, was killed on September 22 along with another alleged Maoist, Kadari Satyanarayana Reddy, during an anti-Maoist operation by the Chhattisgarh police.\n\nHis son, Raja Chandra, alleged that the encounter was staged. He moved the Supreme Court after the high court declined to urgently hear his petition before closing for the Puja vacations. The plea sought preservation of the body so that a fresh post-mortem examination could be conducted, as well as a probe by the Central Bureau of Investigation with officers drawn from outside Chhattisgarh.\n\nA bench of justices Dipankar Datta and Ujjal Bhuyan disposed of the petition with a direction that the body not be cremated or buried until the High Court takes up the matter. The bench also requested the high court to prioritise the case once it reopens after the Dussehra holidays on October 6.\n\n“We direct that till such time the High Court decides the writ petition or passes an appropriate order, the dead body of the petitioner’s father may not be cremated or buried. Writ petition stands disposed of and we request the High Court to hear it immediately after Puja vacations. Since no affidavit has been called for, the allegations in the writ petition are deemed not to have been admitted by this Court. All points are kept open on merits,” the bench ordered.\n\nAlso Read:Create dedicated online portal to trace missing children: SC to Centre\n\nSenior advocate Colin Gonsalves, representing the petitioner, argued that the body had not yet been cremated because the family wanted it preserved for forensic examination. He pressed for an independent investigation, contending that a credible inquiry could not be expected from within the state police.\n\nOpposing the plea, Solicitor GeneralTushar Mehta, appearing for the state, said that a proper post-mortem had already been conducted under videography. “There were two persons who were killed in this firing. One family took the body, but here they are refusing to accept it. We have agreed to hand it over to them. He was a commander, and there is a bounty by seven states totalling about₹2 crore on his head,” Mehta submitted.\n\nThe Supreme Court, however, refrained from entering into the factual disputes and limited itself to ensuring preservation of the body until the high court rules on the challenge.",
  "url": "https://www.hindustantimes.com/india-news/sc-directs-preservation-of-alleged-maoist-commander-s-body-101758881890269.html",
  "scraped_timestamp": "2025-09-26T17:32:47.506598",
  "content_length": 2697,
  "word_count": 441,
  "source_domain": "www.hindustantimes.com"
}