{
  "title": "SC stays execution of death row convict in 2013 blasts case",
  "content": "New Delhi, The Supreme Court on Thursday stayed the execution of an alleged Indian Mujahideen operative who was sentenced to death in connection with the 2013 Dilsukhnagar blasts that left 18 dead and 131 injured.\n\nThe plea filed by convict Asadullah Akhtar was heard by a bench of Justices Vikram Nath, Sandeep Mehta and N V Anjaria.\n\n\"There shall be stay of execution of the death sentence of the appellant,\" the bench said.\n\nTwo powerful explosions in Hyderabad's Dilsukhnagar, a crowded shopping area, took place on the eve of February 21, 2013.\n\nThe first blast took place at a bus stop and another blast was near an eatery in Dilsukhnagar.\n\nAkhtar, lodged in a Delhi jail, challenged the April verdict of the Telangana High Court upholding the death penalty to five operatives of banned terror outfit Indian Mujahideen, including its co-founder Yasin Bhatkal, in the case.\n\nThe apex court directed the Delhi government to place before it the report of all probation officers relating to Akhtar within eight weeks.\n\n\"The superintendent of prison of the prison concerned, shall submit a report with regard to the nature of work which has been performed by the appellant while in jail and a report with regard to the conduct and behaviour of the appellant while in jail, within a period of eight weeks,\" it said.\n\nThe bench directed the jail official to get Akhtar's psychological evaluation done from a government hospital and posted the appeal after 12 weeks.\n\nThe high court verdict observed that the witness testimonies had been properly examined by the trial court, which \"recorded sound and tenable reasons\" to award the punishment to the convicts.\n\n\"Life imprisonment would be completely futile since the sentencing aim of reformation is completely unachievable. Having given due consideration to all the aggravating and mitigating circumstances, we are of the firm view that this is a fit case wherein the death penalty awarded by the sessions court needs to be confirmed,\" it said.\n\nOn December 13, 2016, the NIA court convicted the five accused Mohd Ahmed Sidibapa alias Yasin Bhatkal, Pakistani national Zia-ur-Rahman alias Waqas, Asadullah Akhtar alias Haddi, Tahaseen Akhtar alias Monu and Ajaz Shaikh.\n\nTwo separate FIRs were registered at different police stations at that time. On March 14, 2013, the NIA took over the investigation into both cases.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/sc-stays-execution-of-death-row-convict-in-2013-blasts-case-101758813349845.html",
  "scraped_timestamp": "2025-09-26T00:47:50.660613",
  "content_length": 2462,
  "word_count": 400,
  "source_domain": "www.hindustantimes.com"
}