{
  "title": "SC verdict on Karur stampede: What next for Vijay before TN polls?",
  "content": "Chennai:Following the SC verdict on Monday on the Karur stampede, what is next for actor politician Vijay ahead of the 2026 assembly elections? He remained silent when the BJP and ally AIADMK reached out to him in the aftermath of the stampede and absolved him of any wrongdoing. The NDA wants Vijay to join them given his cult status in Tamil cinema with a mass following particularly among youngsters but he’s positioned himself as the BJP’s ideological enemy and the political enemy of the ruling DMK government in Tamil Nadu. Given the change in the situation following the tragedy, Vijay’s team members say he will still not align with any major parties. But analysts say he could begin to start soft pedalling the BJP and AIADMK.\n\nSeveral leaders from the BJP and AIADMK welcomed the SC’s verdict to transfer the probe to the CBI to unearth what caused the stampede that killed 41 people including women and children at Vijay’s rally in Karur on the night of September 27. Vijay reacted to the verdict in three Tamil words on X, “Justice will Prevail.” Tamilaga Vetri Kazhagam (TVK) and others had sought a CBI probe stating that an investigation by the Tamil Nadu police would be biased.\n\nThe DMK views the transfer of probe to the federal agency, CBI as a way of the BJP-led Centre keeping Vijay close to them and on their terms. “The AIADMK and BJP are desperately trying to form an alliance with the TVK, begging for a coalition,” said DMK spokesperson A Saravanan. “And TVK has surrendered to the BJP.\n\nOn October 9, AIADMK general secretary Edappadi Palaniswami (EPS) at his rally pointed to a couple of flags from Vijay’s party’s TVK flags and said that a grand alliance will soon form in Tamil Nadu to defeat the ruling DMK. HT had on October 7 reported that the AIADMK is re-opening its channels with Vijay in the aftermath of the Karur stampede.\n\n“The verdict gives opposition parties in Tamil who are crushed by the DMK hope,” said senior BJP leader Tamilisai Soundararajan.”Whenever an Opposition party appeals for a political event, they (DMK) are so hesitant to give permission. Vijay is a victim of such atrocities of the DMK government.”\n\nVijay is being given the option of joining the NDA. He also has an option to consider joining hands with the AIADMK without the BJP. He could also contest alone as the CM candidate with smaller parties to whom he has promised a share in power. “We are not talking about alliances now. Now isn’t the time,” said a member of Vijay’s inner circle.\n\nBefore the AIADMK led by EPS re-joined the BJP in April, the party’s first option was to bring Vijay to their side. But his demands such as power sharing and being chief minister for the first half of the five year government wasn’t acceptable to the once mighty AIADMK which has weakened with factionalism, turncoats and successive electoral defeats since 2016. Though Vijay had been unsparring in his speeches against the DMK and BJP, he has not attacked EPS. Not beyond describing the AIADMK as opportunistic for being with the BJP.\n\nPolitical Maalan Narayanan opines that Vijay will contest without joining the AIADMK and BJP. “But Vijay might soft pedal and not attack them like he has been doing in his speeches,” Narayanan says. “It still looks like a major chunk of anti-DMK votes may go to Vijay and the BJP wants that share.”",
  "url": "https://www.hindustantimes.com/india-news/sc-verdict-on-karur-stampede-what-next-for-vijay-before-tnpolls-101760470794126.html",
  "scraped_timestamp": "2025-10-15T10:22:03.794966",
  "content_length": 3342,
  "word_count": 581,
  "source_domain": "www.hindustantimes.com"
}