{
  "title": "Science",
  "content": "Detailing the design of the BAS, Shukhla said that it will be similar to a \"6 BHK apartment\" that will be developed in a \"modular\" style to be expanded gradually and will house Indian astronauts to live in low-earth orbit and conduct experiments.\n\nThe United States has launched three spacecraft aboard a SpaceX Falcon 9 rocket to enhance space weather monitoring. These probes, including IMAP and SWFO-L1, will study solar particles, the heliosphere, and Earth's exosphere from the Lagrange 1 point. The goal is to improve predictions of solar storms and mitigate their potential impact on Earth's technology, power grids, and astronaut safety.\n\nGroup Captain Prashanth Balakrishnan Nair, part of India's Gaganyaan mission, announced that training is progressing with full vigor. India aims to send its first astronaut into space in 2027 after several tests, including sending the robot 'Vyom mitra'. The Gaganyaan program demonstrates India's capability to launch a crewed spacecraft into low Earth orbit for three days.\n\nChennai-based VyomIC, founded by IIT-Madras alumni, is set to build India's first private global satellite constellation for high-precision PNT services. With USD 1.6 million in pre-seed funding, the startup aims to provide centimeter-level positioning and nanosecond-level timing, crucial for various sectors. VyomIC's LEO-based system promises spoofing-proof, jamming-resistant signals and indoor PNT capabilities.\n\nWorld Health Organization refutes claims linking paracetamol use during pregnancy to autism. WHO spokesperson Tarik JaSarević states the evidence remains inconsistent. He also clarifies that vaccines do not cause autism. JaSarević emphasizes vaccines save countless lives. He adds that scientific evidence proves vaccine safety. Donald Trump had linked autism to vaccines and paracetamol use during pregnancy.\n\nIndia is developing 'bodyguard satellites' to protect its spacecraft from potential threats, prompted by a near miss with a satellite from a neighboring country in mid-2024. This initiative is part of a larger plan to enhance India's space security, including deploying surveillance satellites and collaborating with startups for advanced tracking solutions.\n\nISRO Chairman V Narayanan emphasizes hydrogen's pivotal role in India's space missions, transportation, and clean energy future. ISRO has achieved milestones in cryogenic engine technology, hydrogen fuel cell development, and collaborations for hydrogen-powered vehicles. India's National Green Hydrogen Mission aims to establish the country as a leader in green hydrogen production and reduce reliance on fossil fuels.\n\nISRO’s Vyommitra, an AI-enabled half-humanoid robot, is set to fly aboard the first uncrewed Gaganyaan mission this December. The robot will test life-support systems, safety features, and spacecraft operations ahead of India’s human spaceflight planned by early 2027.\n\nISRO's Vyommitra, an AI-powered half-humanoid robot, is set to fly on the uncrewed test mission for the Gaganyaan project by the end of December, according to Chairman V Narayanan. This mission is a crucial step towards India's goal of sending humans to a 400 km orbit for three days and ensuring their safe return.\n\nUncoded, a Premas Life Sciences initiative, is empowering Indian researchers with locally manufactured biotech tools, aligning with the 'Make in India' initiative. The newly launched R&D facility in New Delhi focuses on developing cost-effective solutions that meet global standards.\n\nIndia and the US are embarking on a new era of space collaboration, highlighted at a recent event in Washington DC. Officials and astronauts emphasized how joint ventures like the NASA-ISRO NISAR satellite and Axiom Mission-4 are paving the way for lunar and Martian expeditions.\n\nIndia has achieved significant progress in phasing out hydrochlorofluorocarbons (HCFCs), exceeding Montreal Protocol targets by achieving 67.5% reduction well in advance. The global treaty has facilitated 99% elimination of ozone-depleting substances, aiding ozone layer recovery expected by 2050. India is addressing cooling demands through action plans and indigenous development of low global warming potential refrigerants.\n\nA new WMO report indicates the ozone layer is healing, potentially reaching 1980s levels by mid-century, thanks to the Montreal Protocol's success in phasing out ozone-depleting substances. The 2024 Antarctic ozone hole is smaller than recent years, signaling initial recovery. Continued monitoring of ozone and related substances remains crucial for sustained progress.\n\nNASA's Perseverance rover has discovered intriguing rocks in a Martian river channel, potentially hinting at ancient microbial life. The rover identified organic carbon and unique mineral deposits, similar to those produced by microorganisms on Earth.\n\nEsri India and Dhruva Space collaborate to make Earth observation data easily accessible. The partnership integrates Dhruva Space's AstraView with Esri's ArcGIS technology. This aims to provide timely geospatial insights for various industries. The collaboration will help in urban planning and disaster management. It will also accelerate the use of space-based data. The goal is to improve decision-making and build resilience.\n\nISRO has formalized an agreement with HAL for the transfer of technology to produce Small Satellite Launch Vehicles (SSLV), marking a significant step in boosting industry participation in the space sector. This agreement, facilitated by INSPACe, aims to complete the technology transfer within 24 months, enabling HAL to independently realize SSLV production for domestic and international markets.",
  "url": "https://economictimes.indiatimes.com/news/science",
  "scraped_timestamp": "2025-09-26T15:49:17.898914",
  "content_length": 5671,
  "word_count": 811,
  "source_domain": "economictimes.indiatimes.com"
}