{
  "title": "Science",
  "content": "A new study suggests COVID-19 may impact future generations. Male mice infected with the virus produced offspring exhibiting increased anxiety-like behaviors. Researchers found changes in sperm RNA molecules linked to brain development. These findings, if confirmed in humans, could have significant public health implications for children born after parental infection.\n\nSpaceX's Starship rocket successfully completed its 11th test flight, traveling halfway around the world and releasing mock satellites. The massive vehicle is crucial for NASA's lunar landing plans and future Mars missions. This flight included more spacecraft maneuvering and entry tests over the Indian Ocean.\n\nGalaxEye will launch Mission Drishti, the world's first multi-sensor Earth observation satellite, in early next year. This marks the start of a satellite constellation planned over four years. The satellite offers advanced geospatial analysis for various sectors. Mission Drishti is India's largest privately built satellite and the highest resolution developed in the country.\n\nScientists have captured the first radio image of two supermassive black holes orbiting each other. This event occurred inside a quasar named OJ287, located billions of light-years away. The image validates a long-held prediction about these celestial bodies. The black holes were detected through particle jets and glowing gas. This groundbreaking observation confirms the existence of orbiting black hole pairs.\n\nGroup Captain Shubhanshu Shukla, the first Indian to visit the International Space Station, stated space is a powerful engine for India's 'Viksit Bharat 2047' dream. He expressed excitement about India's space missions like Gaganyaan and the Bharatiya Antariksh Station. These complex projects will propel India forward. Shukla's journey offered significant learning. Space is crucial for India's future development.\n\nIndia's Mangalyaan 2 mission is on track for a 2028-2030 completion. This ambitious project will attempt a Mars landing, a feat only a few nations have achieved. The journey to Mars will take ten months. ISRO aims to enhance its self-reliance and compete globally in space technology. By 2040, India plans to match developed nations in launcher and satellite capabilities.\n\nSusumu Kitagawa, Richard Robson, and Omar Yaghi were awarded the 2025 Nobel Prize in Chemistry for developing metal-organic frameworks (MOFs). These materials feature large cavities allowing molecules to pass through, enabling applications like water harvesting from desert air, pollutant removal, and carbon capture. Their work provides new avenues for chemical problem-solving.\n\nThe 2025 Nobel Prize in Chemistry honours Susumu Kitagawa, Richard Robson, and Omar M. Yaghi. Their work on metal-organic frameworks revolutionizes material science. These porous crystals offer new possibilities for gas storage and environmental solutions. The Nobel season also recognized advancements in medicine, physics, and artificial intelligence. Award ceremonies will take place on December 10.\n\nA US government shutdown has grounded NASA, furloughing thousands of employees. While essential ISS operations and astronaut safety are maintained by a core team, crucial research, new mission development, and public updates are on hold. This recurring political gridlock highlights the vulnerability of scientific progress to funding uncertainties and impacts global collaborations.\n\nAstronomers have directly imaged WISPIT 2b, a young gas giant forming within a gap of its star's protoplanetary disk. This groundbreaking discovery provides the first direct evidence that these disk gaps are indeed carved by developing planets, offering crucial insights into planetary system formation.\n\nThree physicists at UC Berkeley have been awarded the 2025 Nobel Prize in Physics.  They discovered quantum mechanical tunnelling and energy quantisation in an electric circuit.  This groundbreaking work proved quantum rules exist in visible, tangible systems.  Their collaboration combined curiosity and persistence.  This discovery paved the way for quantum computing.\n\nThe Royal Swedish Academy of Sciences has awarded the 2025 Nobel Prize in Physics to John Clarke, Michel H. Devoret, and John M. Martinis. Their groundbreaking discovery of macroscopic quantum mechanical tunnelling and energy quantisation in electric circuits has successfully bridged quantum mechanics with everyday electronics.\n\nNagaland University researchers have developed a flexible supercapacitor, a first-of-its-kind study comparing tungsten, vanadium, and cobalt doping in molybdenum diselenide, with cobalt proving most effective. This eco-friendly device offers high energy storage and durability, poised to power next-generation wearable electronics, EVs, and renewable energy systems. The innovation strengthens India's path toward self-reliant energy solutions.\n\nShimon Sakaguchi, Mary E. Brunkow, and Fred Ramsdell received the 2025 Nobel Prize in Medicine for decoding peripheral immune tolerance. Sakaguchi discovered regulatory T cells, while Brunkow and Ramsdell identified the Foxp3 gene controlling them. Their groundbreaking work transformed immunology, offering new avenues for treating autoimmune disorders, cancer, and transplant rejection.\n\nThe 2025 Nobel Prize in Physiology or Medicine has been awarded to Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi “for their discoveries concerning peripheral immune tolerance,” a breakthrough that has transformed understanding of how the body prevents the immune system from attacking its own tissues.\n\nA digital reconstruction of a million-year-old Chinese skull suggests human divergence occurred 400,000 years earlier and in Asia, not Africa. This challenges previous Homo erectus classifications, indicating a more complex, earlier evolutionary split. While provocative, experts anticipate disputes, highlighting ongoing uncertainties in human evolution.",
  "url": "https://economictimes.indiatimes.com/news/science",
  "scraped_timestamp": "2025-10-15T11:03:41.695264",
  "content_length": 5949,
  "word_count": 820,
  "source_domain": "economictimes.indiatimes.com"
}