{
  "title": "Shehbaz Sharif meets Bangladesh's Yunus, Sri Lanka's Dissanayake on UNGA sidelines",
  "content": "Pakistan Prime Minister Shehbaz Sharif held separate meetings with Chief Adviser of Bangladesh Muhammad Yunus and President of Sri Lanka Anura Kumara Dissanayake and discussed bilateral ties, it was announced Thursday.\n\nThe meetings were held on Wednesday on the sidelines of the 80th session of the UN General Assembly in New York where all three leaders were present to attend the session.\n\nDuring Sharif's “warm and cordial” meeting with Yunus, the two leaders reviewed the current state ofPakistan-Bangladeshbilateral relations and discussed ways to further strengthen cooperation in diverse areas including trade, regional connectivity and people-to-people exchanges, according to an official statement by Pakistan.\n\nThe Prime Minister emphasised Pakistan’s commitment to building constructive and forward looking ties with Bangladesh, rooted in mutual respect, trust, and shared aspirations of regional peace and prosperity, it said.\n\nDuring the meeting at the UN Headquarters, Yunus appreciated Pakistan’s initiative to deepen engagement and highlighted the importance of enhancing bilateral trade and cultural linkages.\n\n“The meeting was held in a cordial and friendly atmosphere, reflecting the mutual commitment of both countries to work together for the well-being of their people and the stability of South Asia,” the statement added.\n\nAccording to another statement, PM Sharif and President Dissanayake meeting, held atSri Lanka's Permanent Mission to the UN, covered a wide range of areas, including high level exchanges, bilateral trade, educational cooperation, cultural exchanges, and defence cooperation.\n\nThey also exchanged views on various regional and global issues. “Both leaders expressed satisfaction over the robust nature of Pakistan-Sri Lanka bilateral relations. They affirmed to continue working closely to ensure that these relations would grow from strength to strength, during the years ahead,” the statement said.\n\nThe prime minister reaffirmed Pakistan’s commitment to enhance bilateral engagement with Sri Lanka in all spheres, and appreciated the close cooperation between the two countries at various international fora.\n\nBoth leaders agreed to enhance exchanges in sports, particularly cricket. Both sides agreed to remain engaged for the advancement of Pakistan-Sri Lanka bilateral relations, it added.",
  "url": "https://www.hindustantimes.com/world-news/shehbaz-sharif-meets-bangladeshs-yunus-sri-lankas-dissanayake-on-unga-sidelines-101758819630139.html",
  "scraped_timestamp": "2025-09-26T00:48:07.043908",
  "content_length": 2342,
  "word_count": 332,
  "source_domain": "www.hindustantimes.com"
}