{
  "title": "Shock in Washington as prominent Indian-origin foreign policy expert Ashley Tellis arrested",
  "content": "Shock and disbelief spread in Washington DC’s policy circles on Tuesday as the US government accused foreign policy expert Ashley Tellis of unlawfully holding classified national security documents. Law enforcement authorities stated that Tellis, who has been arrested by law enforcement agencies, repeatedly met Chinese officials over the last four years and could face a maximum punishment of 10 years in prison and a $250,000 fine.\n\n“When I first saw the news, I thought that it just couldn’t be right. When I told my bosses about it, some of whom know Tellis, they didn’t believe it either. It was only after I showed them an article that they believed it and they looked really disappointed,” one foreign policy analyst told HT on the condition of anonymity. Many spoke to HT about Tellis’ personal and professional generosity to them over the years.\n\nFor many, Ashley Tellis has been one of the leading lights of US-India relations and of Washington’s foreign policy community. Born in India and educated in Mumbai, Tellis moved to America to pursue a PhD at the University of Chicago. Over subsequent decades, Tellis established himself as an authority on US-India relations, nuclear policy and American grand strategy.\n\nTellis is best known in both New Delhi and Washington DC as one of the original architects of the US-India nuclear deal. Through the 2000s, Tellis served as a key adviser to the Bush administration in New Delhi and Washington DC and pushed the deal through, working alongside then Indian diplomats like external affairs minister S Jaishankar. During the first Donald Trump administration, Tellis was widely rumoured to be under consideration to take charge as US Ambassador to India.\n\nAfter leaving government, Tellis remained a respected commentator, with close ties to the strategic establishments in both Washington and New Delhi. In 2022, Tellis released a book on India’s foreign policy and was praised by Jaishankar.\n\n“To say that this news is a shock to the community is an understatement, and the effects and anxieties amongst the tight-knit India policy community will ripple out,” another scholar told HT.\n\nMany who knew Tellis took to social media to air their disbelief about the charges brought against the scholar.\n\n“Shocking for me and the entire DC foreign policy community,” said Mohammed Soliman of the Washington-based Middle East Institute on X.\n\n“I first met Ashley Tellis in 2002 and he has been unfailingly polite and thoughtful in countless interactions since that time, even when we have disagreed on substantive matters. I wish him fairness and compassion as the legal process unfolds,” wrote Christopher Clary, associate professor at the University of Albany, on X.\n\nTellis’ writings have been controversial at times. His 2023 essay in Foreign Affairs magazine entitled ‘America’s Bad Bet on India’ laid out a more sceptical vision of the future of the India-US partnership. Tellis argued that India’s desire for multipolarity in global affairs, its preference for strategic autonomy and its unwillingness to align with America placed limits on what the US-India partnership could achieve. Tellis also questioned optimistic assessments about India’s geopolitical rise, pointing to the country’s slowing economic growth rates and growing social tensions.\n\n“In the past few years. Tellis did become more sceptical about India and US-India relations, most notably by writing a piece titled America’s Bad Bet on India, which went viral and was a prominent rallying piece for those wanting decreased strategic investment in India from the US point of view,” one scholar told HT.",
  "url": "https://www.hindustantimes.com/world-news/us-news/shock-in-washington-as-renowned-indian-origin-foreign-policy-expert-ashley-tellis-arrested-101760500602067.html",
  "scraped_timestamp": "2025-10-15T10:59:06.922496",
  "content_length": 3628,
  "word_count": 577,
  "source_domain": "www.hindustantimes.com"
}