{
  "title": "Singer Maithili Thakur reveals why she joined BJP ahead of Bihar election",
  "content": "Folk and devotional singer Maithili Thakur on Tuesday joined the Bharatiya Janata Party (BJP), saying she was inspired by Prime Minister Narendra Modi and Bihar chief minister Nitish Kumar.\n\nAfter formally joining the party, days before the Bihar assembly election 2025, Maithili Thakur said she was impressed by the leadership and wanted to contribute to society through their vision. “I am very impressed with the PM Modi and Bihar CM Nitish Kumar. Drawing inspiration from them, I am here to support them,” she said.\n\nThakur clarified that her decision to enter politics was not driven by personal ambition but by a desire to serve people. “I do not believe that joining a political party makes you a politician; I am here to serve society and take their ideology to each and every person,” she said.\n\nCalling herself the “daughter of Mithila”, Thakur said her roots and identity remain tied to her homeland. “I am the daughter of Mithila, my soul resides in Mithila,” she added.\n\nOn her future role in the BJP, Thakur said it would be up to the party to decide. “The party will know what they have in mind for me; I am here just to support them. I will do whatever the party orders,” she said.\n\nThakur, known for her renditions of Maithili folk songs and devotional music, enjoys a large following across Bihar and beyond, particularly on social media.\n\nThakur's induction into the BJP came two daysafter her meeting with BJP national general secretary Vinod Tawdeand Union minister Nityanand Rai.Thakur, however, said she was open to contesting in the Bihar assembly electionif the party decided to field her as a candidate.\n\n“It would be a completely different journey for me, and I am ready for it,” the 25-year-old singer told news channels.\n\nAsked about her preference for constituency, she mentioned her deep roots in both Madhubani and Darbhanga, saying, “My grandmother’s village is in Madhubani and my maternal grandmother’s village is in Darbhanga. People from both places love me equally. But ultimately, it will be the party’s decision.”\n\nMaithili’s ancestral village is located in Benipatti block of Madhubani district.\n\nDescribing Prime Minister Narendra Modi as her favourite leader, Maithili said, “I have been listening to his ‘Mann Ki Baat’ and live speeches for years, which always inspired me.”\n\nReferring to her meeting with Vinod Tawde and Nityanand Rai, Maithili said senior leader Tawde extended his good wishes and even wrote about her on X (formerly Twitter). “It’s a big thing for me,” she said.\n\n“I want to serve the people of Bihar. I have already been doing so through folk songs, but if politics gives me another way to serve, I will do it not through politics but through service to the region” she remarked.\n\nPeople familiar with the matter in the BJP indicated that she could be considered for either the Benipatti or Alinagar Assembly seat, though the party has not yet made any official announcement regarding her candidature.\n\nThakur, who became a household name after finishing as the runner-up in the TV reality show ‘The Rising Star’ (2017), enjoys massive popularity on social media, with millions of followers on Instagram and YouTube.",
  "url": "https://www.hindustantimes.com/india-news/singer-maithili-thakur-reveals-why-she-joined-bjp-ahead-of-bihar-election-101760499809365.html",
  "scraped_timestamp": "2025-10-15T09:57:57.620036",
  "content_length": 3181,
  "word_count": 529,
  "source_domain": "www.hindustantimes.com"
}