{
  "title": "Sister helps catch prime accused in Durgapur rape, cops to reconstruct crime: Top points",
  "content": "The alleged gang rape of a second-year medical student near a private medical college in West Bengal’s Durgapur has triggered massive outrage and a full-blown political storm. As police moved to reconstruct the crime scene on Tuesday, the arrests of all five accused - including one with the help of their sister - intensified scrutiny of the Mamata Banerjee government’s handling of the case.\n\nPolice said Rozina Sk, the sister of accused Safiq Sk, helped them locate him under Andal bridge in Durgapur on Monday, reports Times of India.\n\n“I wanted him to face the law. Our family should not be shamed because of him,” she told police, adding that Safiq trembled as he surrendered. Another accused, Sk Nasiruddin, whose motorcycle was allegedly used to flee the scene, was also arrested soon after.\n\nWith their arrest, all five accused are now in custody. The three others — Riyazuddin (a former security guard of the college), Apu Barui, and Firdaus Sk — were arrested on October 12 and remanded to 10 days’ police custody. The two arrested Monday have been remanded to nine days.\n\nThe Durgapur Bar Association has refused to represent the accused. Legal aid counsel Pooja Kurmi filed vakalatnama for Safiq and Nasiruddin but did not seek bail.\n\nA senior officer said the accused are likely to be taken to the forest patch near Paranaganj Kali Bari cremation ground, close to the medical college gates, for reconstruction. “As reconstruction is a vital part of the investigation, we are planning to conduct it… it may take place today,” he said.\n\nEarlier, two accused were taken to their homes to recover concealed evidence, and all five will undergo medical examinations. Police plan to seek court permission for DNA profiling and conduct a test identification parade once the survivor is ready to record her statement.\n\nThe 23-year-old medical student from Balasore, Odisha, was allegedly gang-raped between 8 pm and 8.45 pm on Friday night when she went out for dinner with a male friend. Police said five men attacked them near the cremation ground, snatched her phone when she tried to call for help, and took turns assaulting her. Her friend fled and is currently under police detention for questioning.\n\nAmong the accused, one had worked as a college security guard, another is employed at a hospital, one is a civic body contract worker, and one is unemployed.\n\nThe brutality of the assault and the Chief Minister’s comments have snowballed into a political flashpoint. The survivor’s father compared the state to “Aurangzeb’s rule”, saying he has lost faith in Bengal’s law and order and wants to take his daughter back to Odisha.\n\n“She (CM) is also a woman. How can she say such an irresponsible thing? Should women quit their jobs and sit at home? It seems Bengal is under Aurangzeb’s rule. Her life comes first, her career later,” he said.\n\nHis remarks came after Mamata Banerjee said, “I am shocked at what happened, but private medical colleges must take care of their girl students. They should not be allowed to go out at night.” She later clarified that her comments were “distorted and taken out of context,” but the statement sparked sharp criticism from the BJP, women’s groups, and the Odisha government.\n\nOdisha Deputy CM Pravati Parida called the remarks “disappointing and insulting to all women”, saying Banerjee had “astonished and insulted” 4.9 crore women of Bengal.\n\nAdding to the controversy, TMC MP Saugata Roy said, “Such cases are rare in Bengal. Women’s safety here is better than most places. But girls should not go out late at night; police cannot be on every road,” backing the CM’s view.\n\nGovernor CV Ananda Bose rushed to Durgapur on Monday to meet the survivor and her family. Expressing anguish, he said:\n\n“This is a very shocking incident, and it’s not the first time something like this has happened. I cannot say with confidence that Bengal is safe. Bengal once led the renaissance of India. Today, it needs a second renaissance to make the state safe for the girl child.”\n\nThe National Commission for Women (NCW) has intervened, urging the National Medical Commission and university authorities to ensure the survivor’s academic continuity. In an 11-point directive, the panel recommended special examinations, a transfer option to another medical college if the survivor feels unsafe, and better campus security including CCTV installation and a police outpost.\n\n“Justice delayed is justice denied. The survivor must receive the best medical care, and a fast-track trial should ensure exemplary punishment,” NCW chairperson Vijaya Rahatkar said.\n\nThe BJP has launched a six-day sit-in at Durgapur’s City Centre, accusing the TMC government of shielding perpetrators and destroying evidence. Leader of the Opposition Suvendu Adhikari alleged that one accused had links to TMC and that the father of another held a TMC post.\n\n“This is a clear case of political shielding. The arrests are eyewash; they’ll be out on bail in 20 days. This is a cover-up,” Adhikari said.\n\nTMC’s IT cell head Debangshu Bhattacharya dismissed the charges, saying: “Even if someone related to the accused is in TMC, that doesn’t implicate the party. With nearly 50% vote share, it’s statistically normal that some individuals involved in crimes may be our supporters.”\n\nMeanwhile, the Odisha State Commission for Women chairperson Sovana Mohanty also travelled to Durgapur to meet the survivor and her parents.\n\nAsansol-Durgapur police commissioner Sunil Kumar Choudhary said, “All five accused have been arrested. We are satisfied with the progress of the investigation and assure the parents that the culprits will not be spared.”",
  "url": "https://www.hindustantimes.com/india-news/sister-helps-catch-prime-accused-in-durgapur-rape-cops-to-reconstruct-crime-top-points-mamata-bengal-tmc-bjp-101760425144353.html",
  "scraped_timestamp": "2025-10-14T15:27:59.783420",
  "content_length": 5656,
  "word_count": 924,
  "source_domain": "www.hindustantimes.com"
}