{
  "title": "Six appear in UK court charged over banned group Palestine Action",
  "content": "LONDON, Sept 26 - Six people appeared in a London court on Friday charged with some 50 offences for organising support for the proscribed pro-Palestinian group Palestine Action which prosecutors said was an attempt to make its ban unenforceable.\n\nBritain banned Palestine Action under anti-terrorism laws in July, making it a crime to be a member with a maximum sentence of 14 years in prison.\n\nSince then, a number of protests have been held in support of the group, which prosecutor Peter Ratliff told London's Old Bailey court the six defendants - three men and three women - had played a role in organising.\n\nRatliff said 13 meetings had been held online since proscription where the defendants had encouraged and arranged \"mass civil disobedience\" at which attendees deliberately committed offences \"essentially to make proscription unenforceable\".\n\nSo far 1,500 people had been arrested for offences relating to the ban, Ratliff said.\n\nTim Crosland, 55, David Nixon, 39, Dawn Manners, 61, Gwen Harrison, 48, Melanie Griffith, 62, and Patrick Friend, 26, are accused of numerous counts of arranging or addressing a meeting in support of a proscribed group.\n\nThroughout Friday's hearing, Nixon stood with his eyes closed, holding a small notice which read \"I oppose genocide, I support Palestine Action\".\n\nThe group, which had carried out protests against Israel-linked companies in Britain, was proscribed shortly after some of its members broke into the RAF Brize Norton air base and damaged two planes in June, for which four members have been charged.\n\nIts co-founder is currently bringing a legal challenge against that ban. Prosecutor Ratliff said London's High Court was expected to make a decision on this by the end of the year.\n\nThe six are due to enter a plea to the charges at a hearing in January, with a four-week trial provisionally listed for June next year.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/world-news/us-news/six-appear-in-uk-court-charged-over-banned-group-palestine-action-101758882488727.html",
  "scraped_timestamp": "2025-09-26T17:32:56.206678",
  "content_length": 1972,
  "word_count": 320,
  "source_domain": "www.hindustantimes.com"
}