{
  "title": "Southwest monsoon likely to withdraw in next two days: IMD",
  "content": "With the setting in of easterly and northeasterly winds over southern peninsular India and south and adjoining central Bay of Bengal, the northeast monsoon rainfall activity is likely to commence over south east peninsular region during the same period, IMD has forecast.\n\nThe southwest monsoon season officially ends on September 30 but monsoon rains continue to impact parts of the country even after that. For instance, monsoon was active over east India during the end of September and first half of October.\n\nAn upper air cyclonic circulation is lying over south Bangladesh and neighborhoods in lower tropospheric levels. An upper air cyclonic circulation is lying over Gangetic West Bengal & Jharkhand in lower and middle tropospheric levels.\n\nAlso Read:Southwest monsoon withdraws from Maharashtra\n\nAn upper air cyclonic circulation is also lying over westcentral Arabian Sea in lower tropospheric levels and an upper air cyclonic circulation lies over southwest Bay of Bengal & adjoining and Indian Equatorial Ocean. It is likely to move west-northwestwards towards the Comorin area. Under its influence, a low-pressure area is likely to form over southeast Arabian Sea and adjoining Lakshadweep area off Kerala-south Karnataka coasts around October 19.\n\nIMD has warned of enhanced rainfall activity with isolated heavy rain likely to continue over Kerala and Tamil Nadu during next 7 days.\n\nLight to moderate rain/thunderstorm will occur at some places with isolated heavy rainfall in Tamil Nadu, Kerala and Mahe till October 20; South Interior Karnataka, Coastal Andhra Pradesh, Yanam and Rayalaseema till October 16; Lakshadweep during October 16 to 18.\n\nThunderstorms with lightning is also likely over Madhya Maharashtra during October 14 to 17 and Marathwada, Konkan and Goa till October 17.\n\nTemperatures will continue to remain marginally cooler than normal over northwest India.\n\n“We are not expecting any intense western disturbance immediately. We do not expect any major changes but temperatures may remain slightly below normal and will continue to drop gradually,” said Mahesh Palawat, vice president, climate and meteorology atSkymet Weather.",
  "url": "https://www.hindustantimes.com/india-news/southwest-monsoon-likely-to-withdraw-in-next-two-days-imd-101760437244586.html",
  "scraped_timestamp": "2025-10-14T15:52:42.190920",
  "content_length": 2165,
  "word_count": 328,
  "source_domain": "www.hindustantimes.com"
}