{
  "title": "Sports",
  "content": "SL W vs NZ W Live Streaming: Sri Lanka faces New Zealand in a crucial Women's ODI World Cup 2025 match in Colombo. Sri Lanka seeks its first win, while New Zealand aims to build momentum after securing their opening victory. The R. Premadasa Stadium pitch is expected to favor spinners, and rain could potentially disrupt play.\n\nHead coach Gautam Gambhir remained non-committal on Virat Kohli and Rohit Sharma's participation in the 2027 ODI World Cup, emphasizing the importance of focusing on the present. While acknowledging their quality, Gambhir highlighted the ongoing transition in Indian ODI cricket with Shubman Gill's captaincy, suggesting their future depends on upcoming performances.\n\nCape Verde has qualified for its first World Cup, becoming the second smallest nation to achieve this feat. The island nation, with a population of around 525,000, secured its spot for the 2026 tournament. This achievement places them among a select group of small countries that have reached the prestigious global competition.\n\nEngland, on a commanding three-win streak, are in top form and appear poised to dominate a struggling Pakistan in their ICC Women's World Cup match. Skipper Nat Sciver-Brunt is leading the charge with exceptional batting and bowling performances, propelling England to second place in the standings.\n\nIndia captain Shubman Gill embraces bold decisions to maximize player performance, drawing from his experience in the drawn England series and a clean sweep against the West Indies. He emphasized separating batting and captaincy roles, focusing on winning matches and grooming players for overseas success.\n\nHead coach Gautam Gambhir has strongly refuted former captain Kris Srikkanth's allegations that pacer Harshit Rana was selected for the Australia ODI tour due to being his \"yes man.\" Gambhir defended the 23-year-old, stating Rana earned his place on merit and criticized Srikkanth for targeting a young player for YouTube views.\n\nWorld test championship points table: India defeated West Indies by seven wickets in the second Test. KL Rahul scored an unbeaten 58. This victory completed a 2-0 series sweep for India. The team chased down 121 runs on the final day. Kuldeep Yadav and Mohammed Siraj were key bowlers for India throughout the series.\n\nKL Rahul's unbeaten 58 guided India to a seven-wicket victory, securing a 2-0 series win against the West Indies. Despite losing key wickets, India comfortably chased down the 121-run target. Shubman Gill achieved his first series win as Test captain.\n\nIndia secured a commanding seven-wicket victory over West Indies in the second Test, completing a 2-0 series sweep. Shubman Gill marked his first series win as captain. The hosts demonstrated superiority throughout the matches. Attention now shifts to upcoming challenges against South Africa on potentially more challenging pitches. The team's performance on varied surfaces will be key.\n\nAustralia's Josh Inglis and Adam Zampa will miss the first ODI against India due to injury and family reasons, respectively. Josh Philippe steps in as wicketkeeper, while Matthew Kuhnemann could debut as spinner. Mitchell Starc and Mitchell Marsh will lead the pace attack and captaincy.\n\nGautam Gambhir, the current head coach of the Indian men's cricket team, celebrated his 44th birthday. A former prolific opener, Gambhir's career highlights include winning the 2011 World Cup and leading KKR to two IPL titles. As coach, he has revitalized the T20 side and achieved an unbeaten Champions Trophy campaign.\n\nThe Supreme Court has stayed a National Consumer Disputes Redressal Commission (NCDRC) order that directed an insurance firm to pay Rs 82.80 lakh to a company for S Sreesanth's IPL 2012 knee injury. The bench noted Sreesanth did not play in the tournament due to the injury, and the stay is in effect until further orders.\n\nNepal vs Qatar, ICC Men’s T20 World Cup 2025: Playing 11: Undefeated Nepal faces Qatar in a crucial Super Six clash of the ICC Men's T20 World Cup Asia & EAP Qualifier 2025. Nepal enters the match with a flawless group stage record, aiming to continue their winning momentum. The game is set to take place on October 13th in Al Amerat, Oman.\n\nSiraj has played eight matches so far this year and claimed 37 wickets at an average of 26.91, compared to Muzarabani's 36 wickets at an average of 28.63 in 9 Tests.\n\nOman vs UAE, ICC Men’s T20 World Cup EAP Qualifier 2025: The United Arab Emirates and Oman will compete in a FIFA World Cup 2026 qualifier. The match takes place in Doha, Qatar. Oman currently leads the group with one point. This is the UAE's first match in this round. Both teams seek to improve their standings. A victory will boost their World Cup qualification hopes.\n\nWho is Divya Deshmukh? Meet India’s first FIDE Women’s World Cup champion\n\nNo degrees, just centuries: 7 Indian cricketers who never went to college\n\nKing in Whites: Virat Kohli’s top test performances that defined an era\n\nBCCI Contracts Out: Rishabh Pant gets into A-grade check promotions and demotions\n\nBCCI contracts out: Rohit, Kohli, Bumrah in A+ grade, check full list & salaries\n\nHighest-paid IPL captains of 2025: Check out the full list\n\nChampions Trophy 2025: Chiranjeevi, Atif Aslam, Sonam Kapoor & more dazzle at India vs Pakistan clash\n\nIndia vs Pakistan: 5 most controversial moments in ODI cricket\n\nChampions Trophy 2025: From Shubman Gill to Travis Head, 5 batters to watch\n\nChampions Trophy 2025: Team India's new jersey revealed by BCCI - Check out the pics\n\nChampions Trophy 2025: 5 rising stars to watch out for\n\nChampions Trophy: From Pandya to Ganguly, players with the most sixes\n\nRohit Sharma's 14 glorious years at Mumbai Indians: Titles, records & legacy\n\nSam Konstas: Age, batting records and other details you need to know about Australian cricket debutant\n\nIndia's spin wizard R Ashwin bids goodbye to international cricket: Here's all about his record-breaking journey",
  "url": "https://economictimes.indiatimes.com/news/sports",
  "scraped_timestamp": "2025-10-14T14:54:57.051347",
  "content_length": 5946,
  "word_count": 956,
  "source_domain": "economictimes.indiatimes.com"
}