{
  "title": "Sports",
  "content": "Lallianzuala Chhangte's 14th minute strike was cancelled out by Song's equalizer in the 44th minute, and then he struck what proved to be the winner, in the 58th minute as India were left to rue many missed chances. The two teams were locked 1-1 at the half-time break at the Jawahar Lal Nehru Stadium, having played a 1-1 stalemate in the first leg in Singapore on October 9.\n\nOpting to bat, Nilakshika De Silva's belligerent fifty was the perfect antithesis to skipper Chamari Athapaththu's graceful half-century as Sri Lanka posted a challenging 258 for 6. However, rain lashed the R Premadasa Stadium just before New Zealand began their chase and the match could not resume from that point.\n\nThe Indian Premier League's valuation has dropped for two consecutive years, now standing at $8.8 billion. This decline stems from media rights consolidation and a government ban on real-money gaming sponsorships. The merger of Disney Star and Viacom18 into JioStar ended intense bidding wars, while the gaming sponsorship ban significantly impacted revenue, signaling a fundamental shift in India's cricket economy.\n\nBroadcasters and sponsors would make a bonanza from eyeballs, which may peak before viewers get sick and tired of watching the same thing over and over. And then there would be nothing left of the game. Nothing worth fighting for, nothing to protect. And teams such as the West Indies would not exist. Throughout the first Test match in Ahmedabad, questions were raised about whether the West Indies belonged in the world game any longer. Their batsmen did not have the stomach for the fight, the mental strength for the grind of Test cricket and the skills to be competitive, even on pitches that were good for batting.\n\nHead coach Gautam Gambhir lauded Shubman Gill, stating he has already passed his toughest captaincy test in England. Gambhir emphasized that Gill earned his captaincy across formats through hard work and deserves the role. He also highlighted Gill's ability to earn respect through his actions and words, contributing to the team's success.\n\nSL W vs NZ W Live Streaming: Sri Lanka faces New Zealand in a crucial Women's ODI World Cup 2025 match in Colombo. Sri Lanka seeks its first win, while New Zealand aims to build momentum after securing their opening victory. The R. Premadasa Stadium pitch is expected to favor spinners, and rain could potentially disrupt play.\n\nHead coach Gautam Gambhir remained non-committal on Virat Kohli and Rohit Sharma's participation in the 2027 ODI World Cup, emphasizing the importance of focusing on the present. While acknowledging their quality, Gambhir highlighted the ongoing transition in Indian ODI cricket with Shubman Gill's captaincy, suggesting their future depends on upcoming performances.\n\nCape Verde has qualified for its first World Cup, becoming the second smallest nation to achieve this feat. The island nation, with a population of around 525,000, secured its spot for the 2026 tournament. This achievement places them among a select group of small countries that have reached the prestigious global competition.\n\nEngland, on a commanding three-win streak, are in top form and appear poised to dominate a struggling Pakistan in their ICC Women's World Cup match. Skipper Nat Sciver-Brunt is leading the charge with exceptional batting and bowling performances, propelling England to second place in the standings.\n\nIndia captain Shubman Gill embraces bold decisions to maximize player performance, drawing from his experience in the drawn England series and a clean sweep against the West Indies. He emphasized separating batting and captaincy roles, focusing on winning matches and grooming players for overseas success.\n\nHead coach Gautam Gambhir has strongly refuted former captain Kris Srikkanth's allegations that pacer Harshit Rana was selected for the Australia ODI tour due to being his \"yes man.\" Gambhir defended the 23-year-old, stating Rana earned his place on merit and criticized Srikkanth for targeting a young player for YouTube views.\n\nWorld test championship points table: India defeated West Indies by seven wickets in the second Test. KL Rahul scored an unbeaten 58. This victory completed a 2-0 series sweep for India. The team chased down 121 runs on the final day. Kuldeep Yadav and Mohammed Siraj were key bowlers for India throughout the series.\n\nKL Rahul's unbeaten 58 guided India to a seven-wicket victory, securing a 2-0 series win against the West Indies. Despite losing key wickets, India comfortably chased down the 121-run target. Shubman Gill achieved his first series win as Test captain.\n\nIndia secured a commanding seven-wicket victory over West Indies in the second Test, completing a 2-0 series sweep. Shubman Gill marked his first series win as captain. The hosts demonstrated superiority throughout the matches. Attention now shifts to upcoming challenges against South Africa on potentially more challenging pitches. The team's performance on varied surfaces will be key.\n\nAustralia's Josh Inglis and Adam Zampa will miss the first ODI against India due to injury and family reasons, respectively. Josh Philippe steps in as wicketkeeper, while Matthew Kuhnemann could debut as spinner. Mitchell Starc and Mitchell Marsh will lead the pace attack and captaincy.\n\nWho is Divya Deshmukh? Meet India’s first FIDE Women’s World Cup champion\n\nNo degrees, just centuries: 7 Indian cricketers who never went to college\n\nKing in Whites: Virat Kohli’s top test performances that defined an era\n\nBCCI Contracts Out: Rishabh Pant gets into A-grade check promotions and demotions\n\nBCCI contracts out: Rohit, Kohli, Bumrah in A+ grade, check full list & salaries\n\nHighest-paid IPL captains of 2025: Check out the full list\n\nChampions Trophy 2025: Chiranjeevi, Atif Aslam, Sonam Kapoor & more dazzle at India vs Pakistan clash\n\nIndia vs Pakistan: 5 most controversial moments in ODI cricket\n\nChampions Trophy 2025: From Shubman Gill to Travis Head, 5 batters to watch\n\nChampions Trophy 2025: Team India's new jersey revealed by BCCI - Check out the pics\n\nChampions Trophy 2025: 5 rising stars to watch out for\n\nChampions Trophy: From Pandya to Ganguly, players with the most sixes\n\nRohit Sharma's 14 glorious years at Mumbai Indians: Titles, records & legacy\n\nSam Konstas: Age, batting records and other details you need to know about Australian cricket debutant\n\nIndia's spin wizard R Ashwin bids goodbye to international cricket: Here's all about his record-breaking journey",
  "url": "https://economictimes.indiatimes.com/news/sports",
  "scraped_timestamp": "2025-10-15T10:07:44.523575",
  "content_length": 6495,
  "word_count": 1027,
  "source_domain": "economictimes.indiatimes.com"
}