{
  "title": "Sports",
  "content": "The ICC hearing concluded for Pakistani cricketers Haris Rauf and Sahibzada Farhan, who are accused of provocative actions during the Asia Cup match against India. Rauf is likely to face a fine for using abusive language and aggressive gestures. Farhan defended his gun-fire celebration as a traditional custom, pleading not guilty to any code of conduct violation.\n\nThe World Para Athletics Championships commences in New Delhi, marking its largest edition ever with over 1500 athletes from 104 countries competing. India showcases its rising prominence in para sports by providing top-tier facilities at the Jawaharlal Nehru Stadium. Athletes will compete across 186 medal events, with India aiming for a top-5 finish, fielding its largest contingent of 74 athletes.\n\nIndia and Pakistan are set to clash in the Asia Cup final in Dubai, a match intensified by political tensions and recent border conflicts. India has dominated previous encounters, but Pakistan, led by coach Mike Hesson, aims to challenge the reigning T20 world champions.\n\nIndia shone at the Special Olympics Asia Pacific Badminton Competition in Kuala Lumpur. The nation secured a total of four medals. Chanvi Sharma was a star, winning gold in women's singles. She also won silver in women's doubles with Sujita Sukumaran. Ankit Dalal earned silver in men's singles and doubles with Amal Biju.\n\nDespite comprehensive defeats against India in the Asia Cup, Pakistan's head coach Mike Hesson emphasizes that the upcoming final against their arch-rivals is the only match that truly matters. Hesson dismisses concerns about his team's ability to read spinners, attributing their struggles to tentative decision-making on challenging pitches.\n\nThe Women's Cricket World Cup is set to begin next week in India and Sri Lanka. Hosts India will face Sri Lanka in the opening match. Defending champions Australia aim to continue their dominance. India, led by Harmanpreet Kaur, hopes to win their first title at home. Eight teams will compete for the coveted trophy.\n\nPakistan defeated Bangladesh in a thrilling Asia Cup Super 4s match. Pakistani bowlers successfully defended a low score of 135. Shaheen Shah Afridi and Haris Rauf took three wickets each. Bangladesh struggled against Pakistan's spin attack. Earlier, Bangladesh restricted Pakistan to 135. Taskin Ahmed and Rishad Hossain bowled well for Bangladesh.\n\nChris Woakes' courageous act despite injury contrasts sharply with his subsequent Ashes squad exclusion, mirroring a similar situation for India's Mohammed Shami. Despite his proven skill and dedication, Shami's recent absence from the squad raises questions about his future. While India embraces young pacers, Shami's invaluable contributions remain etched in cricketing memory.\n\nPakistan cricketers Haris Rauf and Saibzada Farhan have been summoned for an ICC hearing on Friday after the BCCI complained about their provocative on-field gestures during the Asia Cup Super Four match on September 21.\n\nRavichandran Ashwin will join Sydney Thunder. He will be the first Indian men's international to play in the Big Bash League. Ashwin retired from international and IPL cricket. This allows him to explore other leagues. He will be available from early January. Ashwin will join David Warner. Thunder aims for back-to-back BBL finals.\n\nThe Board of Control for Cricket in India has revealed the Indian squad for the West Indies Test series. Shubman Gill will captain the team. Ravindra Jadeja is the vice-captain. The squad includes KL Rahul, Sai Sudarshan, and Jasprit Bumrah. Axar Patel and Mohd. Siraj are also part of the team. Kuldeep Yadav has been selected for the series.\n\nShreyas Iyer has been appointed as the captain of India A for the upcoming three-match one-day series against Australia, signaling a potential leadership role in the senior team. Iyer will be taking a six-month break from red-ball cricket due to recurring back issues. Rajat Patidar will lead the Rest of India squad in the Irani Cup clash against Vidarbha.\n\nIndia has lodged a formal complaint with the ICC against Pakistani cricketers Haris Rauf and Sahibzada Farhan. The complaint is regarding their gestures during the Asia Cup match. Pakistan's Cricket Board retaliated by complaining against Indian skipper Suryakumar Yadav. They allege his comments on the Pahalgam attack were political. The ICC is expected to hold a hearing on the matter.\n\nJannik Sinner is refining his game after his U.S. Open defeat to Carlos Alcaraz, focusing on unpredictability and minimizing errors. While acknowledging initial challenges in implementing these changes during matches, Sinner remains motivated and anticipates improvement with time. Alcaraz, aware of Sinner's adjustments, prepares for a more challenging rivalry in future encounters.\n\nIndia defeated Bangladesh in the Super 4s match. They secured their place in the Asia Cup final. Abhishek Sharma's fifty and Kuldeep Yadav's spin were crucial. Bangladesh were bowled out for 127. Saif Hassan scored 69 for Bangladesh. India set a target of 169. The match between Pakistan and Bangladesh is now a virtual knockout.\n\nWho is Divya Deshmukh? Meet India’s first FIDE Women’s World Cup champion\n\nNo degrees, just centuries: 7 Indian cricketers who never went to college\n\nKing in Whites: Virat Kohli’s top test performances that defined an era\n\nBCCI Contracts Out: Rishabh Pant gets into A-grade check promotions and demotions\n\nBCCI contracts out: Rohit, Kohli, Bumrah in A+ grade, check full list & salaries\n\nHighest-paid IPL captains of 2025: Check out the full list\n\nChampions Trophy 2025: Chiranjeevi, Atif Aslam, Sonam Kapoor & more dazzle at India vs Pakistan clash\n\nIndia vs Pakistan: 5 most controversial moments in ODI cricket\n\nChampions Trophy 2025: From Shubman Gill to Travis Head, 5 batters to watch\n\nChampions Trophy 2025: Team India's new jersey revealed by BCCI - Check out the pics\n\nChampions Trophy 2025: 5 rising stars to watch out for\n\nChampions Trophy: From Pandya to Ganguly, players with the most sixes\n\nRohit Sharma's 14 glorious years at Mumbai Indians: Titles, records & legacy\n\nSam Konstas: Age, batting records and other details you need to know about Australian cricket debutant\n\nIndia's spin wizard R Ashwin bids goodbye to international cricket: Here's all about his record-breaking journey",
  "url": "https://economictimes.indiatimes.com/news/sports",
  "scraped_timestamp": "2025-09-26T17:12:07.979796",
  "content_length": 6329,
  "word_count": 984,
  "source_domain": "economictimes.indiatimes.com"
}