{
  "title": "Sports",
  "content": "Pakistan cricketers Haris Rauf and Saibzada Farhan have been summoned for an ICC hearing on Friday after the BCCI complained about their provocative on-field gestures during the Asia Cup Super Four match on September 21.\n\nRavichandran Ashwin will join Sydney Thunder. He will be the first Indian men's international to play in the Big Bash League. Ashwin retired from international and IPL cricket. This allows him to explore other leagues. He will be available from early January. Ashwin will join David Warner. Thunder aims for back-to-back BBL finals.\n\nThe Board of Control for Cricket in India has revealed the Indian squad for the West Indies Test series. Shubman Gill will captain the team. Ravindra Jadeja is the vice-captain. The squad includes KL Rahul, Sai Sudarshan, and Jasprit Bumrah. Axar Patel and Mohd. Siraj are also part of the team. Kuldeep Yadav has been selected for the series.\n\nShreyas Iyer has been appointed as the captain of India A for the upcoming three-match one-day series against Australia, signaling a potential leadership role in the senior team. Iyer will be taking a six-month break from red-ball cricket due to recurring back issues. Rajat Patidar will lead the Rest of India squad in the Irani Cup clash against Vidarbha.\n\nIndia has lodged a formal complaint with the ICC against Pakistani cricketers Haris Rauf and Sahibzada Farhan. The complaint is regarding their gestures during the Asia Cup match. Pakistan's Cricket Board retaliated by complaining against Indian skipper Suryakumar Yadav. They allege his comments on the Pahalgam attack were political. The ICC is expected to hold a hearing on the matter.\n\nJannik Sinner is refining his game after his U.S. Open defeat to Carlos Alcaraz, focusing on unpredictability and minimizing errors. While acknowledging initial challenges in implementing these changes during matches, Sinner remains motivated and anticipates improvement with time. Alcaraz, aware of Sinner's adjustments, prepares for a more challenging rivalry in future encounters.\n\nIndia defeated Bangladesh in the Super 4s match. They secured their place in the Asia Cup final. Abhishek Sharma's fifty and Kuldeep Yadav's spin were crucial. Bangladesh were bowled out for 127. Saif Hassan scored 69 for Bangladesh. India set a target of 169. The match between Pakistan and Bangladesh is now a virtual knockout.\n\nFollowing Suryakumar Yadav's claim that the India-Pakistan cricket rivalry has diminished, Shaheen Shah Afridi responded assertively, emphasizing Pakistan's focus on winning the Asia Cup. Afridi dismissed Suryakumar's view, stating that Pakistan will assess the situation if India reaches the final. He reiterated Pakistan's determination to secure the Asia Cup title, regardless of the opponent.\n\nIndian players Hardik Pandya, Varun Chakravarthy, and Abhishek Sharma maintain their top spots in the latest ICC T20 rankings. Chakravarthy strengthens his lead among bowlers, while Pandya improves his bowling rank. Among batters, Sharma retains his top position, with Varma and Yadav also climbing up the rankings.\n\nThe PGTI has issued show cause notices, which players are calling provisional suspensions, to 17 golfers, including Gaganjeet Bhullar, for participating in the Yuvraj Singh-backed Indian Golf Premier League, which clashed with the PGTI's Chennai Open. Players allege mental harassment and inconsistencies in rule implementation, while the PGTI defends its stance, citing sponsor commitments and tour regulations.\n\nFanCode will broadcast the Ryder Cup 2025 in India. The tournament will occur in New York. Team Europe and Team USA will compete. Luke Donald and Keegan Bradley have announced their teams. Key matchups are expected. FanCode aims to provide Indian fans access to iconic sporting events. This partnership reflects FanCode's commitment to golf in India.\n\nThe ICC has suspended USA Cricket's membership due to repeated breaches of ICC obligations, including governance failures and reputational damage. Despite the suspension, USA's national teams can still participate in ICC events, including preparations for the 2028 Olympics. The ICC will oversee the management of USA teams and work on reforms to restore USA Cricket's membership.\n\nIndia's Sports Ministry has set strict criteria for the 2026 Asian Games, prioritizing athletes with a genuine shot at winning medals. Only those ranked among the top six in individual and top eight in team events at the Asian level will be considered.\n\nOn the anniversary of India's historic 2007 T20 World Cup victory, key players like Irfan Pathan, Yuvraj Singh, and Robin Uthappa reminisced about the unforgettable triumph. They recalled the unity and belief that propelled them to victory against Pakistan in the final.\n\nWho is Divya Deshmukh? Meet India’s first FIDE Women’s World Cup champion\n\nNo degrees, just centuries: 7 Indian cricketers who never went to college\n\nKing in Whites: Virat Kohli’s top test performances that defined an era\n\nBCCI Contracts Out: Rishabh Pant gets into A-grade check promotions and demotions\n\nBCCI contracts out: Rohit, Kohli, Bumrah in A+ grade, check full list & salaries\n\nHighest-paid IPL captains of 2025: Check out the full list\n\nChampions Trophy 2025: Chiranjeevi, Atif Aslam, Sonam Kapoor & more dazzle at India vs Pakistan clash\n\nIndia vs Pakistan: 5 most controversial moments in ODI cricket\n\nChampions Trophy 2025: From Shubman Gill to Travis Head, 5 batters to watch\n\nChampions Trophy 2025: Team India's new jersey revealed by BCCI - Check out the pics\n\nChampions Trophy 2025: 5 rising stars to watch out for\n\nChampions Trophy: From Pandya to Ganguly, players with the most sixes\n\nRohit Sharma's 14 glorious years at Mumbai Indians: Titles, records & legacy\n\nSam Konstas: Age, batting records and other details you need to know about Australian cricket debutant\n\nIndia's spin wizard R Ashwin bids goodbye to international cricket: Here's all about his record-breaking journey",
  "url": "https://economictimes.indiatimes.com/news/sports",
  "scraped_timestamp": "2025-09-26T00:13:42.724300",
  "content_length": 5954,
  "word_count": 919,
  "source_domain": "economictimes.indiatimes.com"
}