{
  "title": "Sports",
  "content": "Namibia achieved a historic first win against South Africa by four wickets. The T20I thriller concluded on the last ball. Namibia restricted South Africa to 134 for eight. The hosts then chased down the target for a memorable victory. This marked Namibia's first international match on home soil.\n\nNat Sciver-Brunt starred for England with a century and two wickets, guiding them to an 89-run victory over Sri Lanka. England posted 253-9, and Sri Lanka was bowled out for 164 despite a brief resurgence. Sophie Ecclestone also impressed with four wickets.\n\nValentin Vacherot, ranked 204th, secured the biggest win of his career by defeating a hobbled Novak Djokovic 6-3, 6-4 to reach the Shanghai Masters final. The 26-year-old, who was an alternate in qualifying, expressed disbelief at his victory. He could face his cousin, Arthur Rinderknech, in the championship match.\n\nIndia declared their first innings at 518 for five, with Yashasvi Jaiswal scoring 175 and Shubman Gill 129 not out. In response, West Indies were reduced to 140 for four at stumps on day two, largely due to the bowling efforts of Ravindra Jadeja (3/37) and Kuldeep Yadav (1/45).\n\nInd vs WI Test: Team India has set a new Test cricket record, achieving 50+ partnerships for the first five wickets against West Indies. This remarkable feat, last seen in 1960, was powered by centuries from Yashasvi Jaiswal and Shubman Gill, leading India to a dominant 518/5 declaration. This performance solidifies India's strong series lead.\n\nENG W vs SL W Pitch Weather Report: England faces Sri Lanka in the ICC Women's World Cup 2025 at Colombo's R. Premadasa Stadium. England, with two wins, aims to extend their streak, while Sri Lanka seeks their first victory after a loss and a rained-out match. The pitch is generally batter-friendly, but spinners may find their rhythm later.\n\nYashasvi Jaiswal was tragically run out for 175 on Day 2 against West Indies, falling just short of a well-deserved double century. A mix-up with skipper Shubman Gill led to the dismissal, denying Jaiswal a significant milestone. His 175 now ranks as the fourth-highest individual score by an Indian batsman ending in a run-out.\n\nENG W vs SL W WC 2025 Playing 11 Today Match: England Women aim to extend their perfect start to the ICC Women's World Cup 2025 when they face Sri Lanka in Colombo. With two wins from two, England are in strong form, while hosts Sri Lanka are seeking their first victory after a challenging opening. The match is set for Saturday at 3 pm IST.\n\nSachin Tendulkar-backed SRT10 Athleisure, also known as Ten X You, is planning a global expansion after establishing its brand in India. The company aims to build a ₹100-150 crore business in two to three years, leveraging strong interest from the Middle East and UK.\n\nKylian Mbappé feels at home in Madrid. He says the city's relaxed lifestyle helps him recover mentally and physically. This has led to a strong start for the Real Madrid forward. Mbappé has scored 14 goals in 10 games this season. He joined Real in June 2024 after seven years at Paris Saint-Germain.\n\nJasmine Paolini achieved a significant victory over Iga Swiatek at the Wuhan Open. Paolini secured her place in the semifinals. She will now compete against Coco Gauff. Aryna Sabalenka also advanced to the semifinals. Sabalenka extended her winning streak at the tournament. She will face Jessica Pegula in her next match.\n\nYashasvi Jaiswal's exceptional 173 not out on Day 1 of the second Test showcased his remarkable mental fortitude and skill. Despite batting for nearly six hours, he played with freshness, demonstrating a unique ability to perform at the highest level with childlike clarity. His innings, marked by a stunning cover drive, propelled India to 318 for 2.\n\nNZ W vs BAN W Prediction, Toss Timing: Aim for their inaugural victory in the ICC Women's World Cup 2025. Both teams have experienced consecutive defeats. The match at Barsapara Cricket Stadium in Guwahati presents a crucial opportunity for either side to revive their tournament campaign.\n\nThe Asia Cup trophy, refused by the Indian team from ACC chief Mohsin Naqvi, remains at the ACC's Dubai headquarters under strict orders not to be moved without his personal approval. Naqvi, also PCB Chairman and Pakistan's Interior Minister, insists on handing it over himself.\n\nYashasvi Jaiswal has achieved a significant milestone in the second Test against West Indies. He scored his seventh Test century and became the fastest Indian to reach 3,000 international runs. Jaiswal's composed batting anchored India's innings. He built a strong partnership with Sai Sudharsan. The Indian team started confidently after winning the toss.\n\nWho is Divya Deshmukh? Meet India’s first FIDE Women’s World Cup champion\n\nNo degrees, just centuries: 7 Indian cricketers who never went to college\n\nKing in Whites: Virat Kohli’s top test performances that defined an era\n\nBCCI Contracts Out: Rishabh Pant gets into A-grade check promotions and demotions\n\nBCCI contracts out: Rohit, Kohli, Bumrah in A+ grade, check full list & salaries\n\nHighest-paid IPL captains of 2025: Check out the full list\n\nChampions Trophy 2025: Chiranjeevi, Atif Aslam, Sonam Kapoor & more dazzle at India vs Pakistan clash\n\nIndia vs Pakistan: 5 most controversial moments in ODI cricket\n\nChampions Trophy 2025: From Shubman Gill to Travis Head, 5 batters to watch\n\nChampions Trophy 2025: Team India's new jersey revealed by BCCI - Check out the pics\n\nChampions Trophy 2025: 5 rising stars to watch out for\n\nChampions Trophy: From Pandya to Ganguly, players with the most sixes\n\nRohit Sharma's 14 glorious years at Mumbai Indians: Titles, records & legacy\n\nSam Konstas: Age, batting records and other details you need to know about Australian cricket debutant\n\nIndia's spin wizard R Ashwin bids goodbye to international cricket: Here's all about his record-breaking journey",
  "url": "https://economictimes.indiatimes.com/news/sports",
  "scraped_timestamp": "2025-10-11T23:53:47.973910",
  "content_length": 5896,
  "word_count": 962,
  "source_domain": "economictimes.indiatimes.com"
}