{
  "title": "Steven Arnold appeared to be turned away from Ricky Hatton’s funeral as celebs poured in to pay their respects",
  "content": "A moment of confusion unfolded at thefuneralof boxing legendRicky Hattonon Friday, when former Coronation Street actor Steven Arnold appeared to be turned away at the entrance ofManchesterCathedral, according to Wales Online.\n\nHatton, one of Britain’s most beloved boxing champions, passed away last month at the age of 46. Known for winning world titles in two weight divisions, Hatton was remembered as a “people’s champion.” His funeral drew thousands of fans and several well-known faces from sports, music, and television.\n\nAs mourners arrived at the cathedral, security personnel were seen conducting checks at the doors. A clip aired on Sky News appeared to show actor Steven Arnold, best known for playing Ashley Peacock on Coronation Street, being stopped by security while staff checked a list.\n\nSocial media users quickly noticed the moment, sparking speculation. One viewer posted on X (formerly Twitter), “Did we just see Ashley from Coronation Street get turned away from the funeral on Sky News?”\n\nJoining the thread, another replied, “That’s definitely what happened, wasn’t it?”\n\nIt is still unclear if Arnold was actually denied entry or if it was simply a misunderstanding.\n\nAlso Read:Ricky Hatton, a legendary champ who was only too human\n\nAfter the procession through Manchester, the service was held at the city’s cathedral before the cortege stopped at the Etihad Stadium, home of Hatton’s beloved Manchester City.\n\nThe mourning ceremony was attended by former Manchester United and England starWayne Rooney, Oasis frontman Liam Gallagher, and boxing legends likeTyson Fury, Barry McGuigan, and Amir Khan.\n\nSpeaking to reporters at the service, Khan paid tribute to Hatton, saying, “He was a fantastic fighter, one of the best out there.” He continued, “He inspired so many fighters like us. He’ll definitely be remembered as one of the greatest to come out of Britain.”\n\nThousands of fans lined the streets as the funeral procession made its way from Stockport Road to the cathedral. Hatton’s family delivered emotional tributes before attending a private committal service.\n\nHatton leaves behind three children: Campbell, 24, Millie, 13, and Fearne, 12.\n\nAlso Read:Ricky Hatton funeral: Liam Gallagher, Wayne Rooney, Tyson Fury and others pay their respects to boxing legend\n\nSteven Arnold, known for playing Ashley Peacock on Coronation Street, appeared to be stopped by security at Manchester Cathedral. It is unclear if he was ultimately denied entry.\n\nCelebrities from sports, TV, and music attended, including Wayne Rooney, Liam Gallagher, Tyson Fury, Barry McGuigan, and Amir Khan. Thousands of fans also lined the streets to pay tribute.\n\nThe funeral was held at Manchester Cathedral, followed by a cortege through Manchester that stopped at Etihad Stadium, home of Hatton’s beloved Manchester City.",
  "url": "https://www.hindustantimes.com/world-news/us-news/steven-arnold-appeared-to-be-turned-away-from-ricky-hatton-s-funeral-as-celebs-poured-in-to-pay-their-respects-101760189758648.html",
  "scraped_timestamp": "2025-10-11T23:46:22.886339",
  "content_length": 2831,
  "word_count": 437,
  "source_domain": "www.hindustantimes.com"
}