{
  "title": "Supreme Court allows sale, use of green firecrackers in Delhi-NCR during Diwali",
  "content": "The Supreme Court on Wednesday permitted the sale and bursting of firecrackers in the Delhi-NCR region between October 18 and 21, limiting the timings to 6-7 am and 8-10 pm, in what the top court described as a “balanced approach” between celebrating festivities and protecting the environment.\n\nA bench comprising Chief Justice of India Bhushan R Gavai and Justice K Vinod Chandran said the order was a temporary measure meant to assess whether a carefully regulated relaxation could coexist with efforts to curb pollution. The court directed the Central Pollution Control Board (CPCB) and state boards to monitor air and water quality during the period and submit a report from October 14 to 21 on the impact of fireworks on Delhi’s air.\n\n“We have to take a balanced approach, permitting it in moderation while not compromising with the environment,” said the CJI, noting that smuggled firecrackers cause far greater damage than the certified green ones.\n\nReferring to its 2018 judgment in Arjun Gopal Vs Union of India, which first introduced the concept of green firecrackers, the bench said those directions continue to hold the field. The court also took note of the Delhi government’s October 14, 2024 order that had imposed a blanket ban on firecrackers, which was later extended to the entire NCR, and said it was necessary to re-examine that approach in light of public sentiment and enforcement realities.\n\nAs a temporary arrangement, the bench laid down a detailed framework. It held that firecrackers can be sold only from designated points of sale, and patrol teams must conduct regular checks on manufacturers. The QR codes of green crackers must be uploaded on official websites to ensure traceability.\n\nAdditionally, no crackers from outside the NCR shall be allowed into the region, said the bench. The court further ordered that licences of manufacturers found dealing in fake or non-compliant products will be suspended immediately.\n\nThe bench said these measures were aimed at balancing the “sentiments of individuals during the festive season, livelihood concerns of the industry, and the right to clean air.”\n\nWednesday’s order builds upon a hearing last week, when the court had said it was inclined to permit firecrackers during Diwali on a trial basis, even as environmental experts and the court-appointed amicus cautioned that enforcement remains a challenge.\n\nAt that stage, Solicitor General Tushar Mehta, appearing for the Centre, had submitted that only green firecrackers approved by NEERI (National Environmental Engineering Research Institute) would be permitted and that traditional fireworks remained banned. He urged the court to allow “children to celebrate Diwali with fervour,” while assuring that the government would maintain strict oversight.\n\nExperts, however, have warned that such relaxations could undo years of progress. They pointed out that between 2018 and 2020, when a similar policy was in place, pollution levels during Diwali remained “severe” despite the exclusive use of green crackers, whose emissions are only about 30–35% lower than conventional ones.\n\nThe 2018 Arjun Gopal ruling had allowed green firecrackers and community fireworks under supervision, balancing citizens’ rights to celebrate with the constitutional right to clean air. But implementation has been patchy -- pollution spikes have continued to coincide with Diwali, regardless of whether the festival fell in late October or November.\n\nLast year, data from 40 monitoring stations in Delhi showed particulate matter levels peaking after 11pm, with readings at Vivek Vihar touching 1,853 µg/m³, more than 120 times the WHO’s safe limit.\n\nUnder the Centre’s new enforcement plan that was submitted to the court on October 10 and which has formed the edifice of the Wednesday order, manufacturers must register their products with PESO (Petroleum and Explosives Safety Organisation) and state pollution control boards, maintain detailed sales records, and ensure QR-coded traceability. Surprise inspections and public awareness campaigns are also part of the mechanism.",
  "url": "https://www.hindustantimes.com/india-news/supreme-court-allows-sale-use-of-green-firecrackers-in-delhi-ncr-during-diwali-101760505310750.html",
  "scraped_timestamp": "2025-10-15T11:12:26.252778",
  "content_length": 4094,
  "word_count": 631,
  "source_domain": "www.hindustantimes.com"
}