{
  "title": "Threatened for seeking RSS events’ ban: Kharge",
  "content": "Karnataka minister Priyank Kharge said on Tuesday that he and his family have received multiple threatening and abusive phone calls after he urged Chief Minister Siddaramaiah to ban Rashtriya Swayamsevak Sangh (RSS) activities on government properties.\n\nKharge, who holds the IT-BT and Rural Development and Panchayat Raj portfolios, posted on X that his phone “hasn’t stopped ringing” for two days. “Calls filled with threats, intimidation and the filthiest abuse directed at me and my family, simply because I dared to question and restrain RSS activities in government schools, colleges and public institutions,” he wrote. “But I’m neither shaken nor surprised. When the RSS didn’t spare Mahatma Gandhi or Babasaheb Ambedkar, why would they spare me?”\n\nHe added, “If they think threats and personal jibes will silence me, they are mistaken. This has just begun. It is time to build a society founded on the principles of Buddha, Basavanna and Babasaheb -- a society rooted in equality, reason and compassion -- and purge this nation of the most dangerous viRuSS.”\n\nThe controversy began on Sunday, when Kharge wrote to Siddaramaiah asking the government to prohibit RSS programs on government premises, including schools, universities, and public grounds. The letter came on the same day the organisation held about 100 events across Bengaluru, many on public property.\n\n“In the interest of the well-being of the country’s children, youth, the public, and society as a whole,” Kharge wrote, “I earnestly request that a ban be imposed on all types of activities conducted by the RSS, whether under the name of shakha, sanghik, or baithak, on the premises of government properties.”\n\nChief Minister Siddaramaiah later said he had directed the Chief Secretary to study the steps taken by Tamil Nadu to restrict similar activities there.\n\nKharge, however, clarified that his demand was not for a ban on the RSS as an organisation but on its access to government institutions. “Where have I told to ban RSS?” he said in an interview with ANI. “They are using government colleges, schools, universities, grounds, and archaeological sites for what? They are poisoning the minds of young children... They are indoctrinating religion into them.”\n\nHe continued, “What I should pray to, what I should eat, and what I should wear, my parents will teach me at home. In schools, they’re supposed to learn. They come there for education so that they can get out of poverty.”\n\nKharge also questioned why “the children of BJP leaders do not participate in RSS shakhas or become Gaurakshaks and Dharamrakshaks,” saying that as long as the Congress government was in power, “government property will not be used to sow seeds of communal hatred.”\n\nHe said the RSS could continue its activities elsewhere. “Let them do it in their houses, private farmlands, hire a hotel or whatever they want, but this public display of sowing communal seeds and threatening people is not good... Trying to portray that they are bigger than the Constitution of India, bigger than the law of the land. I’m sorry, they are not,” he said.\n\nReacting to the controversy, the opposition BJP accused the Congress government of reviving old hostilities toward the RSS. “Successive Congress governments have repeatedly planned and plotted to ban the RSS, but have failed utterly every time -- owing to the RSS ideology of nationalism and social reform always triumphing over the sinister, anti-national designs of the Congress,” said state BJP president B.Y. Vijayendra.\n\nMeanwhile, Home Minister G. Parameshwara said the government could act only if a formal complaint was filed. “Whenever they (RSS) seek permission, the local police will provide permission, looking at the law and order situation. If the government decides not to permit and impose a ban, they will do it,” he told reporters. Asked about concerns that RSS cadres were seen carrying lathis, he said the department would review the issue if it were officially raised.",
  "url": "https://www.hindustantimes.com/india-news/threatened-for-seeking-rss-events-ban-kharge-101760470374239.html",
  "scraped_timestamp": "2025-10-15T11:03:43.484906",
  "content_length": 3992,
  "word_count": 644,
  "source_domain": "www.hindustantimes.com"
}