{
  "title": "Threshold for defamation of public figures should be higher: HC on Gaurav Bhatia case",
  "content": "The threshold for defamation claims involving public figures or politically exposed persons should be higher, as they have the means to respond to criticisms through various platforms the Delhi high court has held, even as it directed removal of allegedly defamatory content on social media targeting Bharatiya Janata Party (BJP) leader and senior advocate Gaurav Bhatia, over a viral video of Bhatia’s recent appearance on a TV debate.\n\nA bench of justice Amit Bansal, in his order released on Friday, directed 12 individuals and entities, including Samajwadi Party Media cell, journalist Abisar Sharma, and politicians Ragini Nayak, Saurabh Bhardwaj, to take down the content in 24 hours, concluding that attacking a person’s dignity with obscene or sexually suggestive language cannot be justified as free speech.\n\n“In my prima facie view, the threshold for defamation in respect of public figures or politically exposed persons should be higher. No doubt the actions of such individuals are more often under scrutiny and prone to public criticism; however, they also have the benefit of a stage/ media as well as the ability to counter any statement made against him,” the judgment emphasised.\n\nIt added, “It is imperative to note that attacking the dignity of a person using obscene and sexually suggestive language under the guise of free speech cannot be permissible under any circumstances. The impugned posts made by the defendants, no.1 and 11, clearly fall in this category and cannot be justified,” Justice Bansal held.\n\nThe court issued the direction while dealing with Bhatia’s defamation suit against various persons, including members and representatives of rival political parties, news media platforms, social and political commentators and social media personalities who regularly engage in public discourse, sharing their personal and political views with the public, for publishing allegedly defamatory content related to the viral video.\n\nAlso Read:BJP’s ‘bail wala CM’ dig at Arvind Kejriwal as it demands AAP chief’s resignation after Supreme Court verdict\n\nThe incident occurred on September 12 during News18’s prime-time show Aar Paar, hosted by Amish Devgan, where Bhatia was seen participating in a television debate, allegedly wearing a kurta without any pants/pyjamas. The video had sparked a storm on social media.\n\nBhatia, represented by advocates Simran Brar and Raghav Awasthi, claimed that he was wearing shorts and that the cameraman had inadvertently captured the lower half of his body. Awasthi stated that his primary grievance was with the Samajwadi Party’s media cell. Bhatia had previously served as the Samajwadi Party’s spokesperson before joining the BJP. The suit seeking₹2 crore as damages stated that the continued circulation of posts making explicit and obscene allegations against him was resulting in irreparable damage, tarnishing his public image and invading his privacy.\n\nThe court, in its 10-page order, however, refused to direct the take-down of content posted by other individuals and entities, including news platform Newslaundry, stating that the same were occasioned on account of Bhatia’s appearance during a live telecast and were satirical, humorous and issued summons to the individuals and entities to justify their stand.\n\n“….while the words used in the impugned posts may appear to be defamatory by themselves, it has to be borne in mind that the impugned posts were occasioned on account of the plaintiff’s appearance, as noted above, during a live telecast and, on a prima facie view, appear to be satirical, humorous and in the nature of hyperbole,” the court maintained.",
  "url": "https://www.hindustantimes.com/india-news/threshold-for-defamation-of-public-figures-should-be-higher-hc-on-gaurav-bhatia-case-101758879430461.html",
  "scraped_timestamp": "2025-09-26T16:17:21.670513",
  "content_length": 3644,
  "word_count": 563,
  "source_domain": "www.hindustantimes.com"
}