{
  "title": "TN CM addresses Gram Sabhas, says action on to remove caste names for public places",
  "content": "Chennai, Chief Minister M K Stalin on Saturday said that the Dravidian model government led by him, as part of efforts to nurture a social justice-driven, self-respect-based society, is taking action to remove caste names from public places that carry a denigrating connotation and replace them with general names.\n\nIn his virtual address to Gram Sabhas, Stalin said no other chief minister has participated in Gram Sabha meetings, and in the history of Tamil Nadu, this was the first time such a meeting was held via video conference linking over 10,000 village panchayats.\n\nRecalling the Women’s Self Help Groups Scheme, he said that the initiative nurtured women’s development and the village economy, and the₹1,000 per month assistance for women was the next-level support initiative.\n\nHe also referred to other flagship schemes of the DMK regime, including fare-free travel for women in buses, the breakfast scheme for school-going children,₹1,000 monthly assistance for college-going students, and employment-linked skill development training.\n\n\"Like this, in every sector, our Dravidian model government is implementing various schemes, and all these schemes mark milestones,\" he said.\n\nFurther, he stated, \"Our Dravidian model government, to uphold social justice and equality, is building a self-respect-based society. As part of these efforts, action is being taken to remove caste names from neighbourhoods, roads, and streets that carry a denigrating sense and replace them with general names.\"\n\nHe directed district administrations to ensure the immediate implementation of key schemes to fulfill the three major resolutions passed by village panchayats.\n\nHe advised village panchayat officials, government officials, and residents to ensure that children in every household attend school.\n\nSimilarly, he emphasised monitoring the proper implementation of the MGNREGA scheme and advised officials to ensure that all related information is made available to the public transparently.\n\nHe also underscored the importance of proper sanitation, keeping villages clean, rainwater harvesting, judicious use of water, and transparent administration of village panchayats.\n\nThe CM virtually addressed Gram Sabha meetings across the state and interacted with the people and elected representatives.\n\nHe enquired about matters such as the submission of applications by eligible beneficiaries to avail the₹1,000 monthly assistance scheme for women.\n\nThe Gram Sabha meetings were held in as many as 12,480 village panchayats in the state, with the chief minister delivering his special address through video conference.\n\nThe Gram Sabha meetings were originally scheduled for October 2. However, due to the Saraswathi/Ayudha Puja holidays, the meetings were postponed to October 11, 2025.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/tn-cm-addresses-gram-sabhas-says-action-on-to-remove-caste-names-for-public-places-101760193238795.html",
  "scraped_timestamp": "2025-10-11T23:45:45.924980",
  "content_length": 2882,
  "word_count": 421,
  "source_domain": "www.hindustantimes.com"
}