{
  "title": "TN Minister EV Velu lays foundation for Periyar Memorial in Arookutty",
  "content": "Alappuzha , A memorial for renowned social reformer E V Ramasamy Naicker, commonly known as Periyar, is to be built in the Arookutty area of Kerala's Alappuzha district.\n\nTamil Nadu Public Works and Highways Minister EV Velu on Friday laid the foundation stone for the Periyar memorial being built by the Tamil Nadu government, at a cost of₹four crore.\n\nThe Periyar memorial is being built at the place where Periyar was jailed during the Vaikom Satyagraha.\n\nSpeaking on the occasion, the minister said that, on the request of Tamil Nadu Chief Minister M K Stalin, Kerala CM Pinarayi Vijayan had allotted half an acre of land near the old jail and boat jetty at Arookutty for the project.\n\n\"Tamil Nadu is deeply grateful to Kerala for this gesture,\" he said.\n\nThe memorial, designed in the form of a jail, will feature a statue of Periyar, a museum, a hall, a park, gardens, and other facilities for visitors, a government statement said.\n\nVelu said that the influence of Periyar was visible across all places, including Kerala, where caste discrimination and social oppression were prevalent.\n\nHe recalled that Periyar had come to Kerala with his family to support the Vaikom Satyagraha, at the request of local leaders, and had infused energy into the movement that eventually culminated in success.\n\nKerala Fisheries and Culture Minister Saji Cherian, who presided over the function, said the Vaikom Satyagraha was a historic struggle against caste discrimination and for freedom of movement, and Periyar’s presence strengthened it.\n\n\"Memorials like this will inspire future generations to rise above caste and religious divisions,\" he said.\n\nTamil Nadu Minister for Tamil Development and Information M P Saminathan, also attended the event.\n\nLocal representatives, including MLA Daleema Jojo, District Collector Alex Varghese, representatives from various civic bodies, and senior engineers from Kerala and Tamil Nadu PWD departments, were present.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/tn-minister-ev-velu-lays-foundation-for-periyar-memorial-in-arookutty-101758886496418.html",
  "scraped_timestamp": "2025-09-26T17:11:53.651843",
  "content_length": 2046,
  "word_count": 322,
  "source_domain": "www.hindustantimes.com"
}