{
  "title": "TOI",
  "content": "A Haryana police officer, ASI Sandeep Lather, allegedly committed suicide in Rohtak, citing corruption and expressing support for former Rohtak SP Narendra Bijarnia. Lather, posted with the cyber cell, made a final video calling Bijarnia an honest officer. The incident comes just days after ADGP Y Puran Kumar reportedly died by suicide at his Chandigarh residence, leaving a note naming 16 senior IAS and IPS officers, alleging harassment. Following these events, the Haryana government placed the state’s DGP on leave and replaced Rohtak SP Bijarnia with Surinder Singh Bhoria. Police cordoned off the area, recovered the weapon, and initiated a forensic investigation into Lather’s death.\n\nAt the Gaza Peace Summit in Egypt’s Sharm el-Sheikh, U.S. President Donald Trump delivered a sweeping, unscripted speech moments after signing the Gaza Peace Deal. Trump began by declaring, “This is the day that people across the region and around the world have been working, striving, hoping, and praying for.” While thanking world leaders for their cooperation, Trump highlighted a mix of praise, humour, and personal warmth — especially toward Italy’s Prime Minister Giorgia Meloni, France’s Emmanuel Macron, and UK’s Prime Minister Keir Starmer. He jokingly called Meloni a “beautiful young woman”, adding that “in the United States, you can’t say that anymore — it’s the end of your political career — but I’ll take my chances.” The comment drew laughter and applause from the summit hall. Turning to Emmanuel Macron, Trump teased, “Emmanuel, you’re taking a low-key approach today. That’s great. Good job.” Finally, Trump called out UK Prime Minister Keir Starmer, saying with a grin, “You’re friends of mine… I have a couple I don’t like in particular but I won’t tell you who. You’ll never find out — maybe you will.” As the audience laughed, Trump beckoned Starmer up to the stage, praised him briefly — “very nice of you” — then sent him back just as he thought he’d speak. Watch.",
  "url": "https://timesofindia.indiatimes.com/videos/news/end-this-drama-rahul-gandhi-urges-pm-modi-to-act-in-ips-officer-case/videoshow/124556331.cms",
  "scraped_timestamp": "2025-10-15T10:34:03.096817",
  "content_length": 1985,
  "word_count": 320,
  "source_domain": "timesofindia.indiatimes.com"
}