{
  "title": "TOI",
  "content": "At the Gaza Peace Summit in Egypt’s Sharm el-Sheikh, U.S. President Donald Trump delivered a sweeping, unscripted speech moments after signing the Gaza Peace Deal. Trump began by declaring, “This is the day that people across the region and around the world have been working, striving, hoping, and praying for.” While thanking world leaders for their cooperation, Trump highlighted a mix of praise, humour, and personal warmth — especially toward Italy’s Prime Minister Giorgia Meloni, France’s Emmanuel Macron, and UK’s Prime Minister Keir Starmer. He jokingly called Meloni a “beautiful young woman”, adding that “in the United States, you can’t say that anymore — it’s the end of your political career — but I’ll take my chances.” The comment drew laughter and applause from the summit hall. Turning to Emmanuel Macron, Trump teased, “Emmanuel, you’re taking a low-key approach today. That’s great. Good job.” Finally, Trump called out UK Prime Minister Keir Starmer, saying with a grin, “You’re friends of mine… I have a couple I don’t like in particular but I won’t tell you who. You’ll never find out — maybe you will.” As the audience laughed, Trump beckoned Starmer up to the stage, praised him briefly — “very nice of you” — then sent him back just as he thought he’d speak. Watch.\n\nBipin Joshi, a Nepali student and the only Hindu hostage held by Hamas, has been declared dead after months in captivity. Abducted from Alumim kibbutz during the Hamas attack on October 7, 2023, Joshi’s family and Nepalese diplomats worked relentlessly to secure his release. His body was handed over to Israeli authorities along with other slain hostages. Israeli DNA tests will confirm his identity before repatriation. Despite video evidence earlier suggesting he was alive, Joshi’s name was not on the recent list of hostages freed by Hamas. This devastating development follows the broader Gaza ceasefire, which saw the release of over 20 hostages and more than 1,900 Palestinian prisoners. The tragedy highlights the human toll of the ongoing Israel-Hamas conflict and the risks faced by foreign nationals caught in war zones.",
  "url": "https://timesofindia.indiatimes.com/videos/news/india-faces-global-safety-alert-as-who-warns-over-3-toxic-cough-syrups-after-19-children-die-in-mp/videoshow/124547616.cms",
  "scraped_timestamp": "2025-10-14T15:45:14.812105",
  "content_length": 2125,
  "word_count": 346,
  "source_domain": "timesofindia.indiatimes.com"
}