{
  "title": "Trade, investment and Gaza: What Trump, Sharif discussed at White House today",
  "content": "Prime Minister Shehbaz Sharif and US President Donald Trump on Thursday held a high-stakes meeting at the White House to discuss a wide range of issues, including American investment in Pakistan and the resolution of the Gaza conflict.\n\nThe meeting, which also included Pakistan's army chief Asim Munir, focused on economically and diplomatically moving US-Pakistan ties.\n\nThe Pakistani prime minister earmarked the agriculture, technology, mining and energy sectors for investment from US companies, his office said in a statement. Trump previously called for American companies to explore for oil in Pakistan.\n\n\"The Prime Minister expressed the confidence that under President Trump's leadership, the Pakistan-US partnership would be further strengthened to the mutual benefit of both countries,\" it said.\n\nWhile, there was no immediate statement from the White House. Just before the meeting, Trump told reporters in the Oval Office that Munir \"is a very great guy, and so is the prime minister\".\n\nAt the heart of Sharif's agenda was a clear message: Pakistan is open for business.\n\nSharif extended an invitation to American companies to invest in key sectors of Pakistan's economy, including agriculture, technology, mining, and energy.\n\nPM Sharif's office also confirmed that the prime minister highlighted the country's untapped potential and urged US firms to explore these sectors as part of a broader strategic partnership.\n\n\"The Prime Minister expressed the confidence that under President Trump's leadership, the Pakistan-US partnership would be further strengthened to the mutual benefit of both countries,\" it said.\n\nAnother key point of discussion was the escalating conflict in Gaza. Sharif reportedly praised Trump's efforts to broker peace in the region, particularly his push for an immediate ceasefire.\n\nThe prime minister's office said that Sharif \"lauded President Trump's efforts to bring about an immediate end to the war in Gaza\".\n\nEarlier in the week, Trump met with several leaders from Muslim-majority countries on the sidelines of the United Nations General Assembly, where he unveiled a 21-point Middle East peace plan, according to US special envoy Steve Witkoff. Sharif was among the few leaders from the Islamic world invited to those discussions.\n\nEarlier this month, Pakistan signed a mutual defence agreement with Saudi Arabia, as many Arab nations feel a rising threat from Israel. Pakistan is the only nuclear-armed Muslim-majority nation and also boasts the largest army among them.\n\nThursday's meeting was the first White House sit-down with a Pakistani civilian leader since Trump's 2019 meeting with then-Prime Minister Imran Khan.",
  "url": "https://www.hindustantimes.com/world-news/donald-trump-shehbaz-sharif-white-house-meeting-asim-munir-us-investment-pakistan-gaza-peace-plan-2025-101758880464721.html",
  "scraped_timestamp": "2025-09-26T16:20:36.679980",
  "content_length": 2672,
  "word_count": 405,
  "source_domain": "www.hindustantimes.com"
}