{
  "title": "'Trump considers Modi personal friend': US ambassador-designate Sergio Gor after meeting PM",
  "content": "US Ambassador-designate Sergio Gor on Saturday said that President Donald Trump considers Prime Minister Narendra Modi “a great and personal friend”.\n\nGor, a member of President Donald Trump’s inner circle, made the remarks aftermeeting Prime Minister Narendra Modiin Delhi.\n\nHe alsogifted the prime minister a framed photoof him and President Donald Trump at the White House, with the latter's message and signature on it. “Mr Prime Minister, you are great,” read Trump's characteristically straightforward message.\n\n“The US values its relationship with India and under the strong leadership of President Donald J Trump and Prime Minister Modi, I am optimistic about the days ahead for both of our nations,” Gor said. “President Trump considers Prime Minister Modi a great and personal friend.”\n\nGor is in India with deputy secretary for management and resources Michael J Rigas for a six-day visit to meet senior Indian functionaries.\n\nPrime Minister Modi also wrote about his meeting with Gor on X and said that he is confident that the US Ambassador-designate's tenure will further strengthen the India–US partnership.\n\nAlso Read |PM Modi speaks to ‘friend’ Donald Trump, congratulates him on Gaza ‘success’\n\n“Glad to receive Mr. Sergio Gor, Ambassador-designate of the US to India. I’m confident that his tenure will further strengthen the India–US Comprehensive Global Strategic Partnership,” Modi said.\n\nOn his part, Gor said that he had an “incredible meeting” with Prime Minister Modi and added that the two discussed bilateral issues, including defence, trade and technology. “We also discussed the importance of critical minerals to both of our nations,” he added.\n\n“It’s an honor to serve as President Donald Trump’s Ambassador to India and I look forward to this very important relationship and continuing to grow and deepen the relationship between our two nations,” he said.\n\nBesides Modi, Gor alsomet external affairs minister S Jaishankarand foreign secretary Vikram Misri for discussions centred on the bilateral strategic partnership and shared priorities.\n\nAsreported by Hindustan Times, the trip by Gor, who is expected to present his credentials and formally take over as the ambassador only in January, is being seen as part of efforts by the US administration to restore the bilateral relationship to an even keel.\n\n“India is one of the most important relationships America has in the world and a strategic partner whose trajectory will shape the region and beyond,” Gor had said at his confirmation hearing in the US Senate last month.",
  "url": "https://www.hindustantimes.com/india-news/donald-trump-narendra-modi-india-us-ambassador-designate-sergio-gor-101760191858613.html",
  "scraped_timestamp": "2025-10-11T23:45:47.094239",
  "content_length": 2560,
  "word_count": 400,
  "source_domain": "www.hindustantimes.com"
}