{
  "title": "Trump administration says 4,108 workers have been fired since shutdown began",
  "content": "The number of US federal worker layoffs as a result of the government shutdown was revised downward on Tuesday, suggesting the Trump administration's initial statement about sweeping job cuts was too ambitious.\n\nThe Trump administration has dismissed 4,108 employees since October 1, the day the US government shutdown began, according to a statement filed Tuesday in court by the US Department of Justice. The Justice Department last week in a separate court filing estimated the figure was at least 4,278.\n\nThe cuts amount to a fraction of the US government's workforce. US agencies employed some 2 million civilians at the start of the Trump administration. President Donald Trump blamed the cuts on the US government shutdown.\n\nThe government is closed because Trump and lawmakers have failed to agree on a spending plan for federal agencies. Trump is trying to pressure Democrats into accepting his spending plan by firing federal workers and cutting programs he says Democrats favor.\n\nSince 1981, the US has had 15 federal government shutdowns that furloughed hundreds of thousands of workers. No president has sought to use a shutdown as the basis for large-scale firings. The dismissals are expected to disrupt government operations, including disease outbreak investigations and college preparation.\n\nFederal worker unions are suing to overturn the firings. The law prohibits US agencies from carrying out functions without approved funding from Congress. There are certain exceptions, including for national security purposes and essential services to protect life and property. The unions said that implementing layoffs is not an essential service that can be performed during a government closure. The shutdown does not justify mass job cuts because most federal workers have been furloughed without pay, they said.\n\nA federal judge is due to hear the case on October 15.\n\nLawmakers from Maryland and Virginia blasted the firings at a rally near the White House on Tuesday morning, arguing that the cuts are hurting the families they represent. Roughly 20% of the federal workforce lives in Washington D.C., Maryland and Virginia, according to federal statistics.\n\n\"We will not be defined by small people who have not a drop of empathy in their soul,\" Representative Don Beyer, a Virginia Democrat, said at the rally.",
  "url": "https://www.hindustantimes.com/world-news/trump-administration-says-4-108-workers-have-been-fired-since-shutdown-began-101760486903870.html",
  "scraped_timestamp": "2025-10-15T10:25:17.984265",
  "content_length": 2329,
  "word_count": 366,
  "source_domain": "www.hindustantimes.com"
}