{
  "title": "Trump 'looking forward' to Thailand-Cambodia ceasefire deal, Malaysia says",
  "content": "US President Donald Trump will visit Malaysia on October 26, Foreign Minister Mohamad Hasan said on Tuesday, adding that he was \"looking forward\" to witnessing a ceasefire deal between Southeast Asian neighbours Thailand and Cambodia.\n\nTension over undemarcated points on the two nations' 817-km (508-mile) land border erupted into a deadly five-day conflict in July, killing at least 48 and temporarily displacing hundreds of thousands in their worst fighting in more than a decade.\n\n\"During the summit, we hope to see the signing of a declaration, known as the Kuala Lumpur Accord, between these two neighbours to ensure peace and a lasting ceasefire,\" Mohamad told the media.\n\nHe was referring to a meeting of leaders of the Association of Southeast Asian Nations grouping set to run from October 26 to October 28 in the Malaysian capital of Kuala Lumpur.\n\nMalaysian Prime Minister Anwar Ibrahim, the current chair of ASEAN, has said Trump will attend the meetings but there has been no official confirmation yet from Washington.\n\nMalaysia brokered an initial ceasefire on July 28 that ended the clashes after a sustained peace push by Anwar and telephone calls by Trump to leaders of both nations.\n\nMalaysia and the United States will facilitate a broader ceasefire between Thailand and Cambodia, which will require both sides to remove all mines and heavy artillery from their borders, Mohamad said.\n\nOn Sunday, the Thai foreign ministry said the foreign ministers of both countries met in Kuala Lumpur over the weekend to discuss the ceasefire, with US and Malaysian officials present.\n\nThe East Asia Summit, to be held during this month's ASEAN meeting, will issue a chairman’s statement, rather than a joint statement, as the United States had objected to use of the word \"inclusivity\", Mohamad added, without elaborating.\n\nLeaders of all 10 members of the grouping and trading partners, such as China, Japan, Russia and the United States, will attend the summit.",
  "url": "https://www.hindustantimes.com/world-news/trump-looking-forward-to-thailand-cambodia-ceasefire-deal-malaysia-says-101760427961493.html",
  "scraped_timestamp": "2025-10-14T15:36:40.696210",
  "content_length": 1971,
  "word_count": 318,
  "source_domain": "www.hindustantimes.com"
}