{
  "title": "Trump's stern words to Emmanuel Macron during tense handshake at Gaza summit revealed by lip reader, ‘You hurt me’",
  "content": "A lip reader has revealed what US PresidentDonald Trumpappeared to tell French PresidentEmmanuel Macronduring a tense handshake on stage at a summit in Egypt backing the conclusion of theIsrael-Hamasconflict. Trump and Macron firmly grasped hands for nearly 30 seconds in Sharm El Sheikh on Monday, October 13, during a photo opportunity.\n\nA lip reader revealed that the two world leaders appeared to deliver subtle warnings to each other before agreeing to pursue the conversation behind closed doors. “Nice to see you, so you agreed?\" Trump asked Macron as he joined him on the summit stage, according to lip reader Nicola Hickling, The Mirror reported.\n\nMacron said something in response while facing away from the camera.\n\nRead More |‘He wants to make a deal for me,’ Trump caught on hot mic telling Macron about Putin, video goes viral\n\n\"Okay, so now I want to know why. You hurt me. I already know,\" Trump appeared to say. \"I am making peace.\"\n\nMacron then tapped Trump’s hand and looked down at it, saying, \"Excuse me,\" according to Hickling.\n\nTrump seemed to ignore Macron’s request, gripping his hand even tighter. \"Let's handle this behind closed doors,\" Macron seemed to say.\n\nRead More |‘You don’t mind, right?': Awkward ‘beautiful’ compliment from Trump, smoking advice from Erdogan for Meloni | Watch\n\n\"I see. We will have to see about that - you will see what is about to happen,\" Macron responded.\n\n\"I'd like to see you do it,\" Trump shot back. “Do it. I'll see you in a bit.”\n\nThe photo opportunity was part of a summit co-hosted by Trump and Egyptian President Abdel Fattah al-Sisi. The summit was aimed at \"ending the war in the Gaza Strip, enhancing efforts to achieve peace and stability in the Middle East, and ushering in a new era of regional security and stability,\" according to the Egyptian presidency. As many as 20 world leaders attended the summit, including heads of Qatar, Palestine, Turkey, Spain, the United Kingdom, Italy, Norway and representatives from the United Nations and European Council.",
  "url": "https://www.hindustantimes.com/world-news/us-news/trumps-stern-words-to-emmanuel-macron-during-tense-handshake-at-egypt-summit-revealed-by-lip-reader-you-hurt-me-101760423776793.html",
  "scraped_timestamp": "2025-10-14T15:20:02.955895",
  "content_length": 2030,
  "word_count": 339,
  "source_domain": "www.hindustantimes.com"
}