{
  "title": "Trump cornered Netanyahu. But he also might have saved him",
  "content": "In Tel Aviv’s Hostages Square,Donald Trumpreigns supreme. Banners proclaiming “We love Trump” offer effusive thanks to the US president. For the families of theIsraeli hostageskidnapped by Hamas in Gaza, and the crowds who supported their struggle over two years, the narrative is clear: with the imminent return of the hostages, Trump delivered whatBenjamin Netanyahuwouldn’t.\n\nFor months, the accusation against the Israeli prime minister has been consistent. The hostage families and Netanyahu’s political opponents believe he prolongedthe war in Gazafor his political survival. The military campaign appeased his far-right coalition partners, who called to expand Israel’s assault on Gaza and dreamed of fully re-occupying the territory.\n\n“Netanyahu isn’t willing to pay the political price of bringing back all the hostages,” opposition leader Yair Lapid charged last December.\n\nBut the landscape shifted dramatically with Trump’s return to the White House early in 2025.\n\nNetanyahu has described Trump as the best friend Israel has ever had in the Oval Office. The prime minister previously scored political points feuding with democratic administrations in the United States. He wouldn’t dare do that with Trump. And Trump has used that leverage when he needs to.\n\nIn January, the US president exerted decisive pressure on Netanyahu to accept a deal that brought 30 of the living hostages and eight deceased hostages home. It was Joe Biden’s ceasefire plan, but Trump pushed Netanyahu to accept.\n\nIn June, during the 12-day war between Israel and Iran, Trump ordered Israel to call off an imminent airstrike, posting an order on Truth Social: “BRING YOUR PILOTS HOME NOW.” The fighter jets turned around in mid-air.\n\nLast week, Trump’s leverage was on display again as he forced Netanyahu into an unprecedented apology to Qatar over the failed September 9 strike on Hamas leaders in Doha. The apology included a humiliating visual of the call from the Oval Office which was posted on social media for the world to see.\n\nThen Trump announced his ambitious 20-point plan to end the war entirely during Netanyahu’s Washington visit.\n\nTrump says hostages being retrieved ‘now’ as aid trucks start entering Gaza\n\nAfter Hamas said it was ready to negotiate, Trump explicitly directed Israel to halt bombing in Gaza, while deeming the US-designated terrorist organization as “ready for lasting peace.”\n\nThen he dispatched his envoy Steve Witkoff and son-in-law Jared Kushner  to Cairo to secure a deal, and finally announced on Wednesday night that “peace” is underway, with all 48 remaining hostages  expected to be released  under the agreement’s first phase.\n\nNetanyahu, for his part, repeatedly rejects claims that he succumbed to US pressure. He tried to frame the ceasefire deal as a milestone of unprecedented strategic coordination, selling it as “one of our great achievements” in a two-year war that has wrought devastation and more than 67,000 deaths in Gaza, according to authorities there.\n\n“Anyone who says that this hostage deal was always on the table is simply not telling the truth,” he said in a televised statement on Friday.\n\nContrary to previous Hamas demands, Trump’s plan ensures the Israel Defense Forces (IDF) maintains a presence over roughly half of the embattled enclave. Netanyahu pitches this as a win : hostages returned, IDF holding ground, Hamas weakened.\n\nYet it falls short from the “total victory” he pledged for two years. The first phase leaves Hamas armed and operational, doesn’t guarantee disarmament or leadership exile, and Gaza’s post-war governance remains undefined.\n\nYet the man who was cornered into a ceasefire may have also been granted an escape route from a protracted, unpopular war ahead of the Israeli elections set for next year.\n\nAccording to two Israeli officials, Netanyahu was one of the authors of Trump’s 20-point proposal.\n\nAccording to these officials, after Israel’s short  war with Iran in June, Trump and Netanyahu agreed, “Once Iran was hit, Gaza had to end.”\n\nWhile negotiators shuttled to Doha for another round of failed talks, Netanyahu’s closest confidant, Ron Dermer, worked parallel channels with the Trump administration and Gulf states on what eventually became Trump’s ceasefire blueprint.\n\n“The final plan is full of Dermer’s fingerprints,” one of the sources said, while admitting that in the final stretch Trump imposed terms Netanyahu had to accept, including a potential pathway to a Palestinian state.\n\nCritically, Netanyahu appeared to structure a deal which includes his favorite escape hatch. Trump’s grandiose peace plan still ended up phased and conditional – granting the Israeli leader political leeway with his hardline coalition.\n\nZohran Mamdani opens the door to praising Trump for Israel-Hamas deal\n\nFull IDF withdrawal is contingent on Hamas disarmament, according to the agreement, a deliberately ambiguous trigger that Netanyahu says preserves Israel’s freedom to resume fighting, while Hamas officials claim they have US assurances that the war will not resume.\n\nAs veteran Israeli journalist Nahum Barnea wrote on Friday in Yedioth Ahronoth, the agreement “has more holes than Swiss cheese” and “more willingness to agree than instructions for implementation.”\n\nThis ambiguity is what keeps Netanyahu’s coalition intact, at least temporarily. Despite far-right threats to overthrow the government, right-wing ministers Itamar Ben Gvir and Bezalel Smotrich have signaled they are staying, soothed by Netanyahu’s assurances that “the war isn’t over” and that Israel reserves the right to resume fighting if Hamas fails to disarm.\n\nNetanyahu may have been cornered to end the war, but he engineered enough wiggle room to claim that he hasn’t.\n\nHis decision was also shaped by the looming political calendar. Israel’s next elections are officially scheduled for October 2026, but it appears increasingly unlikely it will be  that long. An Israeli source told CNN that “several months ago, Netanyahu realized the war had become a liability, and he didn’t want to head into elections with hostages still captive, serving as a daily reminder of the October 7 failure.”\n\nNetanyahu’s main challenge in the next election will be responsibility for the deadliest day in Israel’s history, in which 1,200 people were killed and more than 250 others were kidnapped to Gaza. Two years ago, Netanyahu appeared to be politically dead, given that  catastrophic failure that happened on his watch. A majority of Israelis supported his resignation, while weekly protests have called for elections.\n\nTwin brothers, childhood friends and IDF soldiers: Who are the hostages still held in Gaza?\n\nTrump handed Netanyahu a new narrative for political redemption.\n\nEnding the war will offer the Israeli leader  relief from daily headlines of IDF casualties, strained reservist forces, increasing international isolation and severe economic damage –  heavy burdens for electoral campaigns. And as Trump repeatedly notes, the ceasefire is extremely popular. Though detailed polling on the electoral impact of the deal is pending, previous surveys repeatedly suggest 60 to 70%  of Israelis support it.\n\n“Bibi told me, I can’t believe it. Everybody’s liking me now,” Trump said in an interview to Fox News’s Sean Hannity on Wednesday, recounting a phone call with Netanyahu. “More importantly, they’re loving Israel again.”\n\nNetanyahu’s campaign is already taking shape: the war is over, the hostages are home, Iran and its proxies are degraded, and with Trump by his side, he will try to expand regional normalization.\n\nNetanyahu is keenly aware of Trump’s popularity in Israel – much greater than his own – and sources say he intends to make him central for his  election campaign. In an extraordinary move, Netanyahu invited Kushner and Witkoff to the Israeli cabinet meeting on Thursday, in which the ceasefire deal was approved.\n\nNext week, Trump himself arrives in Israel to participate in the celebrations. Netanyahu is likely to orchestrate every moment for maximum political impact and ride Trump’s popularity straight into the election.\n\nPressure from the US might have forced Netanyahu to accept terms he spent months avoiding, yet by making Trump the story – the savior dealmaker who loves Israel – Netanyahu will try to carry out political alchemy, converting the deal into political gold. It may also distract from the prime minister’slong-running corruption trialthat Trump, incidentally, has called to be thrown out.\n\nWhether Trump’s endorsement can rewrite Netanyahu’s legacy as the prime minister who presided over Israel’s worst security failure and longest war will become an ultimate test of Israeli voters’ memory.",
  "url": "https://edition.cnn.com/2025/10/11/world/netanyahu-trump-ceasefire-analysis-intl",
  "scraped_timestamp": "2025-10-11T23:55:59.026961",
  "content_length": 8706,
  "word_count": 1351,
  "source_domain": "edition.cnn.com"
}