{
  "title": "Turkey's Erdogan says ‘reached understanding’ with Trump on Gaza ceasefire after White House talks: '2-state solution…’",
  "content": "Turkish President Tayyip Erdogan said he reached an understanding with his US counterpart Donald Trump on how to achieve a ceasefire and lasting peace in Gaza and Palestine after talks at the White House on Thursday.\n\n\"Our meeting was very important in terms of putting forth the will to end the massacres in Gaza. Mr Trump stated during the meeting the need to end fighting in Gaza and reach lasting peace,\" news agency Reuters quoted Erdogan saying to reporters on Friday.\n\n\"We explained how a ceasefire can be achieved in Gaza and the whole of Palestine, and lasting peace afterwards. An understanding was reached there,\" he added.\n\n\"We said that the two-state solution was the formula for lasting peace in the region, that the current situation cannot continue,\" he added.\n\nErdogan also said the participation of Syrian President Ahmed al-Sharaa in the United Nations General Assembly was very important for the global legitimacy of the new Syrian government.\n\nAccording to Erdogan, his talks with Trump yielded \"meaningful progress\" in many areas, with discussions on steps to improve defence cooperation and boost trade.\n\nIn comments to reporters during his return flight from Washington, Erdogan said the two leaders exchanged views on steps to boost trade, including the revision of customs duties, to achieve their target of a $100 billion trade volume.\n\n\"We are leaving Washington happy,\" Erdogan said, adding that the relationship was advancing with mutual respect.\n\n\"It's certainly impossible to resolve every issue in a single meeting. However, this meeting has led to meaningful progress on many issues,\" he said, according to a transcript of his comments shared by his office on Friday.\n\nErdogan's statement comes after Palestinian President Mahmoud Abbas pledged at the United Nations on Thursday to work with Trump, Saudi Arabia, France and the United Nations on a peace plan for Gaza overwhelmingly backed by the world body.\n\nThe 193-member UN General Assembly overwhelmingly endorsed this month a seven-page declaration that aims to advance a two-state solution for Israel and the Palestinians and end the Gaza war between Israel and Hamas terrorists.",
  "url": "https://www.hindustantimes.com/world-news/turkeys-erdogan-says-reached-understanding-with-trump-on-gaza-ceasefire-after-white-house-talks-101758877560629.html",
  "scraped_timestamp": "2025-09-26T16:20:40.328510",
  "content_length": 2170,
  "word_count": 345,
  "source_domain": "www.hindustantimes.com"
}