{
  "title": "Ukraine and Russia’s intensifying energy war brings gas shortages and economic pain",
  "content": "Almost 900 miles from Ukraine’s borders, a fire erupted at aRussian oil refineryon Saturday. The blaze – a result of a strike by Ukrainian long-range drones, according to sources in the country’s security services – was the third at the facility in the last month alone.\n\nIt was just the latest episode inan intensifying energy warbetween Ukraine and Russia.\n\nVideo from the area around the Ufa refinery in Bashkortostan, a Russian region in the southern Ural Mountains, showed a column of dark smoke rising from the plant following the attack. The refinery is one of the country’s  largest.\n\nThis was at least the fourth Ukrainian attack on Russian oil facilities in the last week, continuing a campaign that accelerated over the summer and has led to gasoline shortages in parts of Russia.\n\nOvernight on Thursday, according to the Ukrainian military, a gas processing facility and  pumping station in the Volgograd region of southern Russia were also hit. Ukraine’s special forces claimed that the pumping station has an annual capacity of 50 million tons.\n\nBut the energy war is a two-way street. Recent barrages of Russian missiles and drones have seriously damaged Ukrainian gas production and caused extensive power cuts across the country. Ukrainian officials say they’ll have to turn to expensive imports of European gas to make up the shortfall.\n\nThe latest Russian strikes on Ukraine left more than 240,000 homes in the southwestern Odesa region without power on Saturday, according to officials. Ukraine’s energy ministry said more than 800,000 customers in Kyiv lost power for a time.\n\nKyiv’s growing ability to strike refineries well over 1,000 kilometers inside Russian territory is down to an increasing  arsenal of locally-made drones and missiles.\n\nLast week, Ukrainian President Volodymyr Zelensky said Russia’s gasoline shortage is “up to around 20% of (its) needs.” Kyiv had begun using two home-made cruise missiles in recent strikes, he said, “and there are initial signs of success with this particular weapon.”\n\nExperts on how to raise the cost of war for Russia: ‘Be cleverer’\n\nUkraine struck Russia 70 times in September, according to Ukrainian commander-in-chief, Oleksandr Syrskyi.\n\n“We are destroying the aggressor country’s production of fuel and lubricants, explosives, and other components of the Russian military-industrial complex,” Syrskyi said in a Telegram post on Friday .\n\nUkrainian officials acknowledge, however, that Ukraine’s gas and other infrastructure is itself under heavy pressure from Russian attacks.\n\n“There are 203 key facilities in Ukraine that we need to protect with air defense systems,” Zelensky said, while renewing his appeal for more Western systems.\n\nThe Ukrainian leader said he had discussed the Russian attacks in a call with US President Donald Trump Saturday as well as “opportunities to bolster our air defense.”\n\nAccording to Syrskyi, Ukrainian air defenses are “about 74% effective,” but further efforts are needed to protect energy facilities.\n\nThe last week has seen several mass attacks by a combination of missiles and drones on Ukrainian energy infrastructure. Moscow  launched more than 50 missiles and nearly 500 drones on October 5, and then 465 drones and 32 missiles early Friday, according to Ukrainian officials.\n\nFriday’s attack was “one of the largest concentrated strikes specifically against energy facilities,” according to Ukrainian Prime Minister Yulia Svyrydenko. “Unfortunately, there is significant damage to the energy infrastructure.”\n\nRussia’s mounting assault on Ukraine’s gas production means Kyiv will have to seek higher imports than previously anticipated.\n\nUkraine is currently negotiating with its international partners to increase natural gas imports by about 30% as the winter approaches, according to energy minister Svitlana Grynchuk.\n\nDomestic demand for gas in Ukraine usually spikes sharply from November.\n\nMelania Trump says she has an ‘open channel’ to Putin on Ukrainian children, and some have been reunited with family\n\nUkraine had already arranged credits from European institutions for €800 million ($930 million), Grynchuk said, and had discussed expanding these loans.\n\nAttacks on energy extract a very high price. Ukraine is likely to require more than 4 billion cubic meters of gas by the end of winter, according to an industry source, which at current market prices would cost about $2 billion. That’s in addition to equipment to repair facilities that repeatedly come under fire.\n\nMost of those extra imports will come from Europe. TheEuropean Uniondisclosed last week that its storage facilities were at 83% capacity ahead of peak winter demand. For now, the price of natural gas remains steady on European markets.",
  "url": "https://edition.cnn.com/2025/10/12/world/ukraine-russia-energy-war-economic-pain-intl",
  "scraped_timestamp": "2025-10-14T15:13:13.910632",
  "content_length": 4739,
  "word_count": 732,
  "source_domain": "edition.cnn.com"
}