{
  "title": "Ukraine’s most prestigious military units are run like businesses",
  "content": "TWO WOMEN are at the hairdresser. One complains to the other that she wants to go out to a restaurant to celebrate her husband’s birthday, but can’t because he’s worried that if he leaves the house he’ll be picked up by a conscription team. The second woman says that she and her husband are planning a trip to Italy. Amazement: “Seriously! Your husband got an exemption?” says the first. “No!” says the second. “He’s in the Azov.”\n\nThe video—mocking draft-dodgers,and reminding viewers that men who join the armed forces are in some cases allowed to travel abroad during their leave, surprising though that might seem—is the latest from the media team of one of Ukraine’s three most feted military units: the Azov, the Third Assault and the Khartiia.All three started life as small localised outfits. The Third and the Khartiia were founded when Russia launched its full-scale invasion in February 2022; the Third by Andriy Biletsky, a once far-right but now carefully spoken former and perhaps future MP and even a presidential contender; and the Khartiia by Vsevolod Kozhemayko, the owner of a big agricultural conglomerate with large landholdings in the threatened east. The Azov, which Mr Biletsky initially commanded, is older, dating back to Russia’s invasion in 2014 of the eastern Donbas region. It was largely wiped out in the three-monthbattle for Mariupolin 2022 and had to rebuild from scratch.Relying mostly on their own recruitment drives and fundraising, the three units swiftly grew to battalion then to brigade size. This spring, as part of a wider army reorganisation, they were each given four or five more brigades to run, turning them into full-scale corps. Now boasting over 20,000 men each, the three corps are examples of Ukraine’s extraordinary capacity for self-organisation, and of how business skills can be applied to the armed forces. With cult status among the public, they could also become launchpads for post-war political careers.Behind their success lies good training and management. It helps, says Mr Kozhemayko, that they have almost no officers from the Soviet-inherited military system. Unlike the old system, he says, Khartiia does not “use people like animals. Our men are involved in planning, they understand what they’re doing, they’re part of the mission 100%.” Just like executives, the battalion commanders are measured against key performance indicators—”price per kill” and “cost per frontline day”—and the corps has a professional HR department, so that promotions don’t just go to senior officers’ drinking buddies. Mr Kozhemayko says his next project is the introduction of enterprise resource planning software. Dealing with old-style officers, he says, reminds him of his early days in agriculture, when he had to persuade former collective-farm bosses of the usefulness of new-fangled concepts like marketing and accounting.Equally important to recruitment are the corps’ support services for wounded soldiers and their families. A young lieutenant, recently released from three years inbrutal Russian detention, is full of praise for Azov Care: “They met me off the bus, they found the best hospital for me and the best prosthetic, and they’re on the phone 24/7.” Men who want to return to duty are found non-combat roles. For the fallen, funerals are arranged and paid for, and families are helped in getting compensation.On the back of good management, the corps have built powerful brands. Employing sizeable marketing and creative teams, they are hyperactive on YouTube and across social media. Their websites feature collaborations with music and sports stars, and click-throughs make it easy to donate cash. Khartiia’s team, led by the former head of one of Ukraine’s best-known marketing firms, has pulled in Ai Weiwei, hoping the celebrated Chinese artist will design them some merch.Rufty-tuftier is the approach of the Third Assault Corps. For their target audience of 18- to 25-year-olds they have created the KillHouse, a drone school in the outskirts of Kyiv. Anyone is welcome to come and learn, and of those who complete the course a quarter sign up. A “Top Gun”-style billboard campaign last year attracted some criticism for sexism, but worked a treat. Applications topped 200 per day, says the Third’s head of media, Khrystyna Bondarenko. Recently the Third also worked with Mstyslav Chernov, winner of last year’s Oscar for best documentary, on an excoriating new film featuring helmet-cam footage from the battlefield.Facing the futureThe corps’ advertising reflects the war’s changing moods. The Third Assault’s early billboards bristled with guns and machismo. Later, they leaned into jokiness (a drone pilot lounging in a deckchair, tagline “Summer, FPV, 3rd Assault”) and reassurance (men cosily gathered round a campfire). At a particularly low point after the failure of Ukraine’s summer counter-offensive in 2023, a zombie campaign featured soldiers facing off against the living dead. The message, says Ms Bondarenko, was “If you don’t fight now, darkness will prevail.”Now, with peace talks having fizzled out and no end to the war in sight, the emphasis is on military service as a way of life. Khartiia’s latest billboards feature giant unarmed soldiers under the slogan “Grow in Khartiia”, and on the Third’s, they cuddle babies and throw sticks for dogs, tagline “We’re Here to Live”. They look, in fact, very much like political ads; and that is surely no accident.\n\nThe video—mocking draft-dodgers,and reminding viewers that men who join the armed forces are in some cases allowed to travel abroad during their leave, surprising though that might seem—is the latest from the media team of one of Ukraine’s three most feted military units: the Azov, the Third Assault and the Khartiia.\n\nAll three started life as small localised outfits. The Third and the Khartiia were founded when Russia launched its full-scale invasion in February 2022; the Third by Andriy Biletsky, a once far-right but now carefully spoken former and perhaps future MP and even a presidential contender; and the Khartiia by Vsevolod Kozhemayko, the owner of a big agricultural conglomerate with large landholdings in the threatened east. The Azov, which Mr Biletsky initially commanded, is older, dating back to Russia’s invasion in 2014 of the eastern Donbas region. It was largely wiped out in the three-monthbattle for Mariupolin 2022 and had to rebuild from scratch.\n\nRelying mostly on their own recruitment drives and fundraising, the three units swiftly grew to battalion then to brigade size. This spring, as part of a wider army reorganisation, they were each given four or five more brigades to run, turning them into full-scale corps. Now boasting over 20,000 men each, the three corps are examples of Ukraine’s extraordinary capacity for self-organisation, and of how business skills can be applied to the armed forces. With cult status among the public, they could also become launchpads for post-war political careers.\n\nBehind their success lies good training and management. It helps, says Mr Kozhemayko, that they have almost no officers from the Soviet-inherited military system. Unlike the old system, he says, Khartiia does not “use people like animals. Our men are involved in planning, they understand what they’re doing, they’re part of the mission 100%.” Just like executives, the battalion commanders are measured against key performance indicators—”price per kill” and “cost per frontline day”—and the corps has a professional HR department, so that promotions don’t just go to senior officers’ drinking buddies. Mr Kozhemayko says his next project is the introduction of enterprise resource planning software. Dealing with old-style officers, he says, reminds him of his early days in agriculture, when he had to persuade former collective-farm bosses of the usefulness of new-fangled concepts like marketing and accounting.\n\nEqually important to recruitment are the corps’ support services for wounded soldiers and their families. A young lieutenant, recently released from three years inbrutal Russian detention, is full of praise for Azov Care: “They met me off the bus, they found the best hospital for me and the best prosthetic, and they’re on the phone 24/7.” Men who want to return to duty are found non-combat roles. For the fallen, funerals are arranged and paid for, and families are helped in getting compensation.\n\nOn the back of good management, the corps have built powerful brands. Employing sizeable marketing and creative teams, they are hyperactive on YouTube and across social media. Their websites feature collaborations with music and sports stars, and click-throughs make it easy to donate cash. Khartiia’s team, led by the former head of one of Ukraine’s best-known marketing firms, has pulled in Ai Weiwei, hoping the celebrated Chinese artist will design them some merch.\n\nRufty-tuftier is the approach of the Third Assault Corps. For their target audience of 18- to 25-year-olds they have created the KillHouse, a drone school in the outskirts of Kyiv. Anyone is welcome to come and learn, and of those who complete the course a quarter sign up. A “Top Gun”-style billboard campaign last year attracted some criticism for sexism, but worked a treat. Applications topped 200 per day, says the Third’s head of media, Khrystyna Bondarenko. Recently the Third also worked with Mstyslav Chernov, winner of last year’s Oscar for best documentary, on an excoriating new film featuring helmet-cam footage from the battlefield.\n\nThe corps’ advertising reflects the war’s changing moods. The Third Assault’s early billboards bristled with guns and machismo. Later, they leaned into jokiness (a drone pilot lounging in a deckchair, tagline “Summer, FPV, 3rd Assault”) and reassurance (men cosily gathered round a campfire). At a particularly low point after the failure of Ukraine’s summer counter-offensive in 2023, a zombie campaign featured soldiers facing off against the living dead. The message, says Ms Bondarenko, was “If you don’t fight now, darkness will prevail.”\n\nNow, with peace talks having fizzled out and no end to the war in sight, the emphasis is on military service as a way of life. Khartiia’s latest billboards feature giant unarmed soldiers under the slogan “Grow in Khartiia”, and on the Third’s, they cuddle babies and throw sticks for dogs, tagline “We’re Here to Live”. They look, in fact, very much like political ads; and that is surely no accident.\n\nGet 360° coverage—from daily headlinesto 100 year archives.",
  "url": "https://www.hindustantimes.com/world-news/ukraines-most-prestigious-military-units-are-run-like-businesses-101760506503323.html",
  "scraped_timestamp": "2025-10-15T11:12:50.538299",
  "content_length": 10545,
  "word_count": 1667,
  "source_domain": "www.hindustantimes.com"
}