{
  "title": "UP: Azamgarh district jail superintendent suspended for financial irregularities",
  "content": "Lucknow/Azamgarh , The Superintendent of Azamgarh district jail has been suspended for financial irregularities and failure in discharge of his duties after four people were booked for defrauding government by forging jail official's signature, officials said on Tuesday.\n\nThe Prison Administration and Reform Services department, in a statement issued on Monday night, said that Aditya Kumar, the Superintendent of the Azamgarh District Jail, has been suspended with immediate effect.\n\nThis action was taken against him due to financial irregularities and failure to properly discharge his official duties, it said.\n\nIn the statement, Additional Inspector General of Prisons Dharmendra Singh said that funds were illegally withdrawn from the Azamgarh District Jail's Canara Bank account through various cheques between January 2024 and October 10, 2025.\n\nKumar has been found prima facie responsible for this financial irregularity.\n\nIn view of this serious irregularity, Kumar has been suspended with immediate effect and attached to the Headquarters of Prison Administration and Reform Services department, Lucknow, the statement said.\n\nA dowry-death convict currently out on bail from the Azamgarh jail and three others were booked in Azamgarh district for allegedly defrauding the government of several lakhs of rupees by forging the jail superintendent's signature, officials had said on Saturday.\n\nAccused Ramjeet Yadav allegedly ran the fraud undetected for 18 months.\n\nAn FIR was lodged at the Kotwali police station against Yadav and three others former jail inmate Shivshankar alias Gorakh, Senior Assistant Mushir Ahmad and guard Awadhesh Kumar Pandey on the charges of fraud and forgery, Jail Superintendent Aditya Kumar Singh had said.\n\nPolice said Yadav, who was assigned work duties while serving his sentence, allegedly learned the process of handling official documents, including cheque signatures.\n\nAfter being released on bail on May 20, 2024, he reportedly stole a bank chequebook from the jail accountant's office. Investigations revealed that between May 2024 and September 2025, he forged the prison superintendent's signature multiple times to withdraw large sums from the jail's government account, the police said.\n\nThe fraud came to light on September 22, after a suspicious withdrawal of₹2.6 lakh prompted a detailed review of the bank statement.\n\nFurther scrutiny uncovered that the accused had transferred₹2.4 lakh to the account of one of his female relatives,₹3 lakh to his mother Sudami Devi's account and made additional transfers to other unidentified accounts.\n\nYadav, a resident of Bilariaganj , has a criminal history. He was first jailed in 2011 for his wife's murder in a dowry-death case.\n\nMeanwhile, Superintendent of Police Madhuvan Kumar Singh said that the four accused were arrested on Saturday.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/up-azamgarh-district-jail-superintendent-suspended-for-financial-irregularities-101760436250815.html",
  "scraped_timestamp": "2025-10-14T15:51:44.095136",
  "content_length": 2937,
  "word_count": 438,
  "source_domain": "www.hindustantimes.com"
}