{
  "title": "US expecting support from India, Europe on China’s rare earth curbs, says Bessent",
  "content": "Washington:US Treasury Secretary Scott Bessent stated that America expected to receive support from India and Europe as Washington grapples with the effects of China’s new export controls on rare earths.\n\nLast week, China’s Ministry of Commerce announced sweeping new restrictions that would block rare earths supplies to companies with ties to foreign militaries. Given China’s dominance in the sector, the restrictions are expected to compromise America’s ability to manufacture key defence platforms including F-35 fighter jets, advanced submarines and long-range Tomahawk missiles.\n\n“We have already been in touch with the allies. We will be meeting with them this week and, you know, I expect that we will get substantial global support from the Europeans, from the Indians, from the democracies in Asia,”Bessent said in an interviewwith Fox News.\n\nThe export controls have led to a sharpincrease in tensions between the United States and China, with US President Donald Trump threateningan additional 100% tariffon Chinese exports.\n\nRare earths are a set of 17 metallic elements that are used extensively in a range of commercial and defence applications. Cellular telephones, electric vehicles and flat screen monitors as well as defence technologies like lasers, guidance systems and radar use rare earths. According to the American Geosciences Institute, roughly 97% of global production of rare earths is concentrated in China. This has become a potentgeopolitical tool for Beijing, which it has used as leverage in talks with America in the past.\n\nIndia and the United States have stepped up cooperation in critical minerals and rare earths, in an effort to reduce their dependence on China. In 2023, India joined the US-led Minerals Security Partnership in an effort to diversify critical mineral and rare earth supply chains. During PM Narenda Modi’s visit to Washington in February, New Delhi and Washington announced plans to accelerate investment and research in this sector.\n\n“To this end, the leaders announced the launch of the Strategic Mineral Recovery initiative, a new US-India program to recover and process critical minerals (including lithium, cobalt, and rare earths) from heavy industries like aluminium, coal mining and oil and gas,” reads the US-India joint statement after the Trump-Modi meeting earlier this year.",
  "url": "https://www.hindustantimes.com/world-news/us-expecting-support-from-india-europe-on-china-s-rare-earth-curbs-says-bessent-101760466772637.html",
  "scraped_timestamp": "2025-10-15T10:08:17.881200",
  "content_length": 2345,
  "word_count": 358,
  "source_domain": "www.hindustantimes.com"
}