{
  "title": "US News",
  "content": "AI investment is growing fast, but experts warn of a possible bubble. Companies like OpenAI, Nvidia, and AMD are making huge deals and building large AI data centres. While some see risks of overvalued companies and financial problems, others believe AI infrastructure will create new products and opportunities. The future of AI funding and its impact on the economy is uncertain.\n\nBitcoin short trade: An anonymous trader reportedly made 88 million dollars by shorting Bitcoin just thirty minutes before President Trump's surprise tariff announcement. Bitcoin fell 17 percent following the news, leading to the largest liquidation event in crypto market history. Whales had placed massive short bets on Bitcoin and Ethereum two days prior.\n\nTrump crypto crash: A massive crypto crash, potentially orchestrated by a Bitcoin whale, followed President Trump's announcement of 100% tariffs on Chinese imports. The whale reportedly opened billions in short positions before the news, profiting significantly from the ensuing market chaos and liquidations. This event mirrors historical market resets that often precede new bull market phases.\n\nTennessee TNT Plant Explosion: At least 19 people are still missing, and several are feared dead following a massive explosion at a military explosives plant in Tennessee on Friday morning.\n\nGold prices are rising fast in 2025 as investors look for safety during economic worries. Experts say this sharp jump may be a warning for the U.S. economy. With job growth slowing, the dollar falling, and global tensions high, many people are choosing gold instead of other investments.\n\nThe Spangram is designed to divide the board and provide a central hint for today’s theme. Solving it often simplifies the process of finding the smaller theme words, because those words will commonly cluster around or intersect the Spangram.\n\nWordle enthusiasts around the world kicked off their Saturday with puzzle #1575, putting both their vocabulary and problem-solving skills to the test. The daily five-letter word game, now a staple of morning routines for millions, delivered a clever and unexpected challenge on October 11.\n\nNYT Connections is available on the New York Times Games app and on nytimes.com/games for subscribers and non-subscribers in its basic version.\n\nRanked No. 204 in the ATP standings, Valentin Vacherot stunned 24-time Grand Slam champion Novak Djokovic, defeating him 6-3, 6-4 to advance to the Shanghai Masters final.\n\nNovak Djokovic, the 38-year-old Serbian tennis star, suffered a new injury scare during a grueling semifinal match against Valentin Vacherot at the 2025 Shanghai Open.\n\nWWE Crown Jewel: The headline event showcases top WWE superstars and title matches, making it one of the most eagerly awaited wrestling spectacles of the year.\n\nLeaked documents reveal details of Russia's advanced Krasukha-4 electronic warfare system, a mobile jammer designed to disrupt enemy radar and communication signals. This strategic ground-based system, mounted on a heavy truck, enhances Russian forces' survivability by blinding surveillance and reconnaissance assets. The leak offers insights into its production and operational capabilities, aiding in the development of countermeasures.\n\nThe Mega Millions lottery features nine ways to win, with prizes ranging from $10 to the multi-million-dollar jackpot. Players select five numbers from 1 to 70 (white balls) and one Mega Ball number from 1 to 24.\n\nMagistrate Judge Zia M. Faruqui rejected an indictment against Kevontae Stewart, accusing federal prosecutors of circumventing normal justice procedures after a federal grand jury declined charges. The case represents escalating tensions over President Donald Trump's Washington prosecution campaign as grand juries repeatedly decline indictments\n\nThe FCC has successfully prompted major US online retailers to remove millions of listings for banned Chinese electronics, including smartwatches and security cameras from companies like Huawei and Hikvision. This action aims to mitigate national security risks, preventing potential surveillance and communication disruptions. The FCC is reinforcing these efforts with new advisories and procedures to block unapproved Chinese technology.\n\nFormer national security adviser John Bolton is expected to face federal criminal charges soon, according to two federal officials. The US Attorney's Office in Maryland would bring charges against Bolton, the third Trump critic indicted since September following James Comey and Letitia James indictments\n\nGlobal markets reeled Friday as President Trump's 100% tariff hike on Chinese imports and new export controls triggered the largest crypto liquidation ever, wiping out over $19 billion in leveraged positions. Bitcoin and Ethereum saw significant losses, with fears of a deepening US-China trade war impacting stocks and oil too. Investors are now bracing for further volatility.\n\nBillionaire investor Ray Dalio warns that the US national debt, exceeding $37.8 trillion and projected to reach over $52 trillion by 2035, is unsustainable and mirrors pre-WWII conditions. He also highlights escalating political divisions, describing a \"civil war of some sort\" due to irreconcilable differences, advising investors to consider assets like gold amid this uncertainty.\n\nDonald Trump released a promotional video on Truth Social featuring an excerpt from his congressional address. The clip, which highlights his claim that a new president was needed for border security, is underscored by the iconic instrumental from Dr. Dre's \"The Next Episode.\" This unconventional pairing aims to energize his base for the upcoming election cycle.\n\nAttorney General Pam Bondi and senior Justice Department officials were not informed before US Attorney Lindsey Halligan presented an indictment case against New York Attorney General Letitia James to a grand jury Thursday, October 9, multiple sources told ABC News. The alleged fraud indictment surprised DOJ leadership\n\nDomino's Pizza launches its first major rebrand in more than a decade, introducing modernized colors, bold typeface, new jingle and updated packaging. The refresh will roll out across US and international markets in coming months, affecting app, website, uniforms and in-store materials\n\nJerome Younger, 54, assistant principal at Edward \"Duke\" Ellington Conservatory of Music and Art at Beckham Academy in Detroit, faces criminal sexual conduct charges involving a minor student. The alleged assault occurred at Younger's residence. He was arraigned October 9, 2025 with bond set at $250,000\n\nAmerica's economy faces significant challenges. Many states are contracting, and households are struggling with debt and stagnant wages. Experts warn of a potential recession if economic weakness spreads. Families are advised to secure finances by saving, reducing debt, and diversifying investments. Staying informed without panicking is crucial for navigating these uncertain times.\n\nFirst Lady Melania Trump announced the return of Ukrainian children displaced by Russia. This breakthrough followed discreet diplomatic communication with Russian President Vladimir Putin. Eight children were returned to their families within 24 hours. Melania Trump emphasized the humanitarian nature of her efforts. This initiative highlights the complexity of the ongoing conflict and the separation of families.\n\nThis weekend brings exciting new movies across streaming platforms. Discover a live-action \"How to Train Your Dragon\" on Peacock. Prime Video features a John Candy documentary and a modern \"You've Got Mail\" style romance. Apple TV+ presents a wildfire survival story. Hulu offers a werewolf action film. HBO Max has a chilling horror tale.\n\nScientists from the Pacific Northwest Seismic Network installed a seismometer at T-Mobile Park ahead of the Mariners' ALDS Game 5 against the Tigers on October 6, 2025. The equipment will measure crowd vibrations during Seattle's first winner-take-all playoff game in 24 years at the venue\n\nGold prices are soaring in 2025, surpassing $4,000 per ounce. This surge is driven by inflation fears, economic instability, and global tensions. Central banks are increasing their gold holdings, boosting demand. A weaker US dollar also makes gold more attractive. Experts predict further price increases, highlighting gold's role as a safe investment amid uncertainty.\n\nBen Affleck praised his co-parenting relationship with ex-wife Jennifer Garner during a red carpet interview, calling fatherhood the \"joy of my life.\" The actor spoke about daughter Violet's UN testimony and his three children with Garner at the Kiss of the Spider-Woman premiere\n\nMegan Fox joins Five Nights at Freddy's 2 as the voice of Toy Chica in the horror sequel releasing December 5, 2025. Josh Hutcherson returns alongside Matthew Lillard and Elizabeth Lail. The Universal and Blumhouse film follows the success of the original's $297 million box office performance\n\nThe Pentagon has reduced its civilian workforce by over 60,000 employees, exceeding its reduction target. Despite these significant cuts achieved through buyouts, early retirements, and probationary employee dismissals, the full impact on operations and national security readiness remains undisclosed. Leaders claim the moves are responsible, but employee feedback suggests a climate of distrust.\n\n9-1-1: Nashville premiered October 9, 2025 on ABC with Chris O'Donnell leading the cast as Captain Don Hart. The new 9-1-1 spinoff features Jessica Capshaw, LeAnn Rimes, and Kimberly Williams-Paisley in a Nashville-set firefighter drama with family secrets at its core\n\nPresident Donald Trump announced he will posthumously award the Presidential Medal of Freedom to Charlie Kirk, who was fatally shot on September 10th. The ceremony is planned for October 14th, Kirk's 32nd birthday. Kirk, a prominent conservative activist and co-founder of Turning Point USA, was killed during a campus speaking event.\n\nNew York City kicks off the Halloween season with a vibrant pre-Halloween weekend featuring art, theater, and pop culture. Experience Monet's Venetian masterpieces at the Brooklyn Museum, enjoy magic at New World Stages, and catch poignant dramas or world-class ballet. New York Comic Con also offers a spectacle, though weekend tickets are sold out.\n\nIslamic prayers follow a structured schedule linked to the sun's position. Five daily prayers, Fajr, Dhuhr, Asr, Maghrib, and Isha, are observed. The article provides specific prayer times for five major US cities on October 11, 2020.  This highlights the diverse Muslim population in America, originating from over 75 countries.\n\nCelebrity-endorsed gel and acrylic manicures, while glamorous, may increase skin cancer risk due to UVA light exposure used for curing. Research indicates this UV light can cause DNA damage and cell death. Experts advise protective measures like gloves and sunscreen, or opting for UV-free manicures to mitigate potential health concerns.\n\nU.S President Donald Trump's announcement of imposing 100 per cent tariffs on the world's second largest economy China has rattled the Wall Street. What will happen now?",
  "url": "https://economictimes.indiatimes.com/news/international/us",
  "scraped_timestamp": "2025-10-11T23:53:56.512009",
  "content_length": 11180,
  "word_count": 1653,
  "source_domain": "economictimes.indiatimes.com"
}