{
  "title": "US News",
  "content": "Dallin H. Oaks has been named the new president of The Church of Jesus Christ of Latter-day Saints. He will lead the church with Henry B. Eyring and D. Todd Christofferson as his counselors. President Oaks recently spoke about protecting families from harmful content. He also advised young women on modest dress. His background includes legal and educational leadership.\n\nUS President Donald Trump indicated a potential shift of 2026 World Cup games from Boston. He cited safety worries and criticised Mayor Michelle Wu. Trump stated he could contact FIFA to move matches if conditions are deemed unsafe. This comes after recent Boston street disturbances. FIFA controls venue selection, making changes unlikely.\n\nThe Powerball jackpot has surged to an estimated $273 million for the October 15 drawing after no ticket matched Monday's numbers. Winners can opt for a 30-year annuity or a $127.8 million lump sum, both before taxes. Lottery officials remind players of the extremely slim odds, approximately 1 in 292.2 million.\n\nWas Erika Kirk married to Derek Chelsvig before marrying Charlie Kirk and was she banned in Romania? As Turning Point USA CEO Erika Kirk received the Presidential Medal of Freedom from Donald Trump, social media revived claims about her alleged past marriage and child trafficking links. This explainer examines the origin and truth of these rumors.\n\nIslamic prayers, known as Salah, are structured around astronomical events, with five daily prayers observed by Muslims. The article provides specific prayer timings for five major US cities on October 15th, including New York, Los Angeles, Chicago, Houston, and Phoenix. These timings reflect the spiritual discipline integral to the Muslim community.\n\nRepublican leaders joke about slavery, rape, make antisemitic comments and hurl racist slurs in leaked Telegram messages, according to a Politico report. The leaked 2,900-page chat among Young Republican leaders includes racial slurs, antisemitic comments, and disturbing remarks about rape and gas chambers. The group’s national board has demanded resignations.\n\nMI5 has issued a rare public warning to UK parliamentarians, revealing that China, Russia, and Iran are actively targeting them with espionage. The agency highlighted tactics like blackmail and covert relationships, urging vigilance to protect democratic institutions and national sovereignty. This alert follows recent espionage cases and underscores ongoing foreign interference concerns.\n\nUS government shutdown Senate vote time has drawn national attention as the Senate meets to decide on a funding bill. Lawmakers from both parties are debating the proposal that could end the ongoing shutdown. The session began at 3 p.m., with voting expected around 5:30 p.m.\n\nDancing with the Stars new episode tonight features “Dedication Night” with ten remaining couples performing for influential people in their lives. Airing Tuesday, October 14 at 8:00 p.m. ET on ABC and Disney+, the episode can also be streamed live or next-day on Hulu, ABC.com, and multiple streaming platforms.\n\nFormer Jets center Nick Mangold is undergoing dialysis and urgently needs a kidney transplant due to chronic kidney disease.  The seven-time Pro Bowler, diagnosed in 2006, is seeking a type O donor and has appealed to the Jets, Ohio State, and the public for support. Mangold expressed gratitude for his support system and optimism for recovery.\n\nWere Charlie Kirk's parents Robert W. Kirk and Kathryn Kirk sidelined and why did not attend Charlie Kirk Day and memorial event in Arizona? Charlie Kirk’s parents stayed out of public view at both events. His private family life, upbringing, and decisions regarding public appearances explain their absence from these conservative gatherings.\n\nNew research highlights that eating dinner early is crucial for health. Experts recommend finishing meals by 7 pm. This timing aids digestion, improves metabolism, and helps manage weight. It also boosts sleep quality and reduces risks of heart disease. Early dinners promote longer overnight fasting, benefiting blood sugar and pressure. Shifting dinner times can lead to better overall well-being.\n\nWill Charlie Kirk parents Robert W Kirk and Kathryn Kirk attend Charlie Kirk Day or will they be sidelined? On October 14, the United States observes Charlie Kirk Day, honoring the late conservative activist. This article explains the memorial events, the House resolution, family involvement, and Kirk’s life and legacy.\n\nBarron Trump, President Donald Trump's youngest son, has built a $150 million fortune in cryptocurrency.  He played a key role in launching World Liberty Financial.  The company's tokens saw significant value increase after the 2024 election.  Barron's crypto earnings and investments contribute to his substantial net worth.  He is now a notable figure in digital finance.\n\nHalloween celebrations in America are becoming costlier. Tariffs are increasing prices for decorations and costumes. Many popular items are imported, making them subject to these new charges. Consumers may see higher costs for their spooky season purchases. Candy prices are expected to remain stable as most is produced domestically. Shoppers are planning to spend more overall this year.\n\nHow did Drew Struzan die, cause of death, wife, children and net worth — the legendary artist behind “Star Wars,” “Indiana Jones,” and “Back to the Future” posters, died at 78. This explainer looks at his life, his long artistic journey, cause of death, family statement, and his lasting influence on film art.\n\nArtificial intelligence is reshaping jobs worldwide. Many roles involving repetitive tasks face automation. However, new opportunities are emerging in AI development and other sectors. Sectors like data entry and customer service face the highest risk. Workers need to reskill to adapt. This shift demands new strategies for businesses and governments to ensure a smooth transition and protect employment.\n\nUS President Donald Trump’s new plan aims to cut or remove taxes on Social Security for seniors. Experts say rich retirees may gain the most, while younger workers could lose in the long run. The change could also affect future benefit payments and the overall health of the Social Security fund.\n\nTGI Fridays is providing free meals to TSA and air traffic control workers. This offer is available during the ongoing government shutdown. Eligible workers can receive a complimentary meal daily. The promotion runs until October 23 or until the shutdown ends. This initiative aims to support essential personnel facing unpaid work.\n\nD’Angelo net worth, family and who is Angie Stone are key topics after the singer’s death at 51. Known for shaping neo-soul, D’Angelo died from pancreatic cancer in October 2025, leaving behind three children, a musical legacy, and a personal history tied to soul singer Angie Stone.\n\nYour nails are more than just a cosmetic, they can signify certain significant hints in regard to your overall well-being. Differences in shape, colour or texture may suggest fungal infections, vitamin deficiencies, arthritis, psoriasis, kidney disease, or even melanoma. Dermatologist Christine Poblete-Lopez highlights that nails mirror systemic or dermal conditions and advises consulting a physician for sudden variations.\n\nLegendary singer D’Angelo, a pioneer of neo-soul, has died at age 51 from cancer. Known for albums like Brown Sugar and Voodoo, he influenced many modern R&B artists. He won Grammys and worked on music soundtracks. At the time of his death, his net worth was about $1 million. Fans remember his talent and legacy in soul music.\n\nGoldman Sachs to have more layoffs as the bank plans limited job cuts this year while expanding its use of Artificial Intelligence under its new “OneGS 3.0” strategy. The move focuses on improving efficiency, reducing costs and aligning the workforce with AI-driven business processes.\n\nThe horoscope today reveals fiery emotions and bold moves as the Moon in Leo takes charge. Confidence surges, creativity flows, and hearts seek attention. Every zodiac sign feels this cosmic spark — pushing you to take action, chase passion, and embrace change with fearless energy.\n\nAcclaimed movie poster artist Drew Struzan, known for iconic designs for 'Star Wars,' 'Indiana Jones,' and 'Back to the Future,' passed away on October 13, 2025, at 78. His distinctive hand-illustrated artwork, which captured the essence of films and integrated ensemble casts, left an indelible mark on cinematic history and continues to influence designers worldwide.\n\nMichael Jackson's vast fortune is under threat. Lawsuits alleging sexual abuse seek huge damages. The IRS claims significant unpaid taxes. Family disputes and alleged mismanagement add to the crisis. If these issues are not resolved, the King of Pop's estate could be depleted, leaving little for his heirs and tarnishing his legacy.\n\nDonald Trump may send long-range Tomahawk missiles to Ukraine as he pushes for peace talks with Russia. The move could increase tension between Washington and Moscow. Trump and Ukrainian President Volodymyr Zelensky are set to meet at the White House to discuss defense plans and ways to end the ongoing war.\n\nThe Family Plan 2 Trailer: The sequel reunites the Morgan family for another seasonal adventure, this time in London and Paris. Dan Morgan, a dedicated husband, loving father, and former assassin, organizes the perfect Christmas journey for his wife and children.But, a mysterious figure from his past interrupts their trip, triggering an international chase of cat-and-mouse.\n\nSoul legend D'Angelo, celebrated for hits like \"Brown Sugar,\" has passed away at 51 after a private battle with pancreatic cancer. The neo-soul pioneer, who began his musical journey in church at a young age, leaves behind a legacy of critically acclaimed albums and impactful collaborations. His final album, \"Black Messiah,\" was released in 2014.\n\nSocial Security 2026 COLA update is here. SSA confirms the new announcement date for this year’s COLA increase. Millions of Americans wait to see how much their benefits will rise. The delay came from the ongoing government shutdown, which stalled key inflation data. Here’s what recipients need to know and how much their checks could increase in 2026.\n\nAs Jennifer Garner is getting ready to marry the businessman John Miller, her ex-husband Ben Affleck is reportedly “heartbroken” over the announcement. Affleck and Garner, who tied the knot for a decade and have three kids, Violet, Seraphina, and Samuel have kept a close friendship since their 2015 split. While Garner is cited to be happier than ever with Miller, Affleck remains to battle with watching her move forward.\n\nThe SNAP website crashed during the U.S. government shutdown, leaving millions unsure about their food benefits. The shutdown stopped updates and caused confusion over new rules starting in November. Many fear losing support or facing delays. Officials have not said what will happen next, and families are still waiting for answers.\n\nD’Angelo, the legendary icon and R&B musician, has reportedly passed away at 51 after a private battle with pancreatic cancer. Born Michael Eugene Archer, he gained popularity with his 1995 launch Brown Sugar, producing songs such as “Lady” and “Cruisin’.” Recognized for his smooth vocals and influential voice, D’Angelo’s impact extended throughout generations.\n\nOnly Murders in the Building Season 5 fans are waiting for the next Episode 9. After a suspenseful week filled with clues, secrets, and emotional twists in Episode 8, titled “Cuckoo Chicks,” viewers are now counting down the days until the next installment.\n\nWalmart is making a bold move in retail. The company has partnered with OpenAI to bring ChatGPT shopping directly to customers. Shares jumped nearly 3%, hitting $106.05 on Tuesday. The new Instant Checkout feature lets users browse and buy items, plan meals, and restock essentials—all inside ChatGPT. Walmart CEO Doug McMillon calls this a shift from static to dynamic shopping. Analysts say it positions Walmart ahead in the AI-driven commerce race.\n\nHappy Boss’s Day 2025 is on October 16. It is a day to thank your boss for support, guidance, and leadership. People celebrate with messages, quotes, gifts, or team activities. Both office and remote teams can join in. It’s about appreciation, teamwork, and positivity, making leaders feel valued and inspiring a better workplace for everyone.",
  "url": "https://economictimes.indiatimes.com/news/international/us",
  "scraped_timestamp": "2025-10-15T10:17:24.526214",
  "content_length": 12506,
  "word_count": 1931,
  "source_domain": "economictimes.indiatimes.com"
}