{
  "title": "US News",
  "content": "Niall Horan recruits longtime friend Lewis Capaldi as his Battle Rounds advisor on \"The Voice.\" The duo, who connected in 2017, reunited on set with their signature humor. Capaldi's experiences with mental health and Tourette's diagnosis offer unique insights to help contestants navigate music industry challenges.\n\nAsian markets rallied on Tuesday after US President Donald Trump eased trade tensions with China. This followed a sharp market downturn on Friday. Safe-haven assets like gold and silver reached record prices. Investors are watching for further developments in global trade and interest rate policies. Tokyo's market faced challenges due to domestic political instability.\n\nCarrie Romney, 64-year-old sister-in-law of former US Senator Mitt Romney, was found dead near a Valencia Town Center parking garage Friday evening. Preliminary reports suggest she may have jumped or fallen. Los Angeles County Medical Examiner deferred cause of death pending toxicology tests as investigation continues.\n\nThe Pentagon has given beat reporters until Tuesday, October 14, to sign restrictive new rules or surrender their press passes by Wednesday, October 15, CNN reported. Many news organizations are rejecting the ultimatum and saying they will not sign.\n\nPolaris Inc. is selling a majority stake in its Indian Motorcycle division to Carolwood LP. The deal is expected to close in early 2026. Mike Kennedy, former CEO of Vance & Hines, will lead Indian Motorcycle. This move allows Polaris to focus on growth areas. Indian Motorcycle will become a standalone company.\n\nThe Monday night winner will have the option to claim the full jackpot of $258 million as a 30-year annuity, with annual payments that grow by 5%, or take a one-time lump-sum payout of $120.8 million, both before taxes, according to powerball.com. Powerball’s long odds - 1 in 292.2 million - are designed to allow jackpots to grow when the top prize goes unclaimed.\n\nDuring a Gaza summit in Egypt, Trump unexpectedly praised Italian Prime Minister Giorgia Meloni, calling her \"beautiful\" and \"incredible.\" Trump acknowledged the potential for his comments to be seen as sexist, but stated he would \"take his chances.\" Meloni, the only female leader on stage, appeared to nod in response to his remarks.\n\nAlec Baldwin crashed his wife Hilaria's Range Rover into a tree in East Hampton after a garbage truck cut him off on Montauk Highway. The actor and his brother Stephen Baldwin were unharmed in the Monday, October 13, incident. Baldwin blamed the massive truck and apologized for damaging his wife's vehicle.\n\nBijan Robinson's explosive 81-yard touchdown run fueled the Atlanta Falcons' dominant 24-14 victory over the Buffalo Bills. Michael Penix Jr. orchestrated the offense with 250 passing yards and a touchdown to Drake London, who amassed 158 receiving yards. The Falcons' defense proved stout, limiting the Bills' attack and securing their third win of the season.\n\nEgyptian fighter jets provided an impressive escort for US President Donald Trump's aircraft as it entered Egyptian airspace. This military cooperation preceded the historic Gaza Peace Summit. President Trump acknowledged the advanced Egyptian F-16s. The summit aimed to solidify a ceasefire agreement between Israel and Hamas. This agreement led to the release of hostages and Palestinian prisoners.\n\nInvincible season 4 release date is set for March 2026. The Prime Video show will return with Mark Grayson and Atom Eve. Thragg’s voice actor Lee Pace joins the series in the next season.\n\nHonduras seized control of Group C in CONCACAF World Cup qualifiers with a dominant 3-0 triumph over Haiti.  Goals from Rivas, Lozano, and Quioto secured a crucial victory, propelling Honduras to the top of their group with two matches left. This win significantly bolsters their direct qualification hopes for the 2026 FIFA World Cup.\n\nYouTubers Dan and Phil have confirmed their long-speculated relationship. The duo revealed they have been dating since 2009. They confirmed it in a video, addressing fan curiosity. Dan and Phil also announced a new venture related to their journey together. The duo also assured that their content will continue without becoming overly romantic on camera.\n\nTask Episode 7 release date and time have been confirmed for Sunday, October 19. The final episode will stream on HBO Max, marking the end of the seven-part limited series.\n\nThe parents of US Marine Steve Rios were detained by ICE agents while visiting Camp Pendleton in California. Esteban Rios was subsequently deported, while his wife Luisa Rodriguez remains in custody. The family has pending green card applications and no criminal records, according to reports.\n\nFollowing a $20 billion crypto market slump, select US-listed stocks are showing recovery signs. Galaxy Digital, LQWD Technologies, and Soluna Holdings are attracting attention due to strategic investments, operational successes, and new partnerships. Despite recent dips, these developments suggest potential gains for investors as the crypto sector navigates global trade tensions.\n\nThe Tennessee Titans have fired head coach Brian Callahan after just six games into his second season, citing a lack of progress and mounting struggles. Callahan departs with a 4-19 record, and offensive assistant Mike McCoy has been named interim head coach. This move follows a trend of first-overall pick quarterbacks seeing their coaches dismissed during their rookie seasons.\n\nAlec Baldwin has spoken out following a car accident in East Hampton, New York, that occurred Monday morning. The actor took to Instagram to address the incident after receiving numerous inquiries about his well-being.\n\nBijan Robinson delivered an electrifying 81-yard touchdown run, the longest of his career and the NFL's longest this season, against the Buffalo Bills. This explosive play, which put the Falcons ahead, highlighted Robinson's dominant first half and his continued growth as a premier playmaker.\n\nGen V Season 2 Episode 7 release time has been confirmed for Wednesday, October 15. The new episode, titled “Hell Week,” will drop globally on Prime Video at the same time. Viewers can stream the episode across all major regions including the US, UK, India, Singapore, and Australia.\n\nActors Stephen and Alec Baldwin were in a car crash. Their SUV hit a tree during a heavy storm. Both men were helped from the vehicle. It is not yet confirmed if they sustained serious injuries. Police were at the scene. Alec Baldwin was in the Hamptons for a film festival.\n\nIslamic prayers follow a structured schedule tied to the sun's movement. Five daily prayers, Fajr, Dhuhr, Asr, Maghrib, and Isha, are observed at precise times. The article provides these prayer timings for five major US cities on October 14, 2025.  The US Muslim population is diverse, with millions from various countries.\n\nWho toppled Madagascar government, where is president Andry Rajoelina now and who will control the country? Madagascar’s President has reportedly fled after army defections amid Gen Z-led protests. Opposition leader Siteny Randrianasoloniaiko confirmed his departure as military units switched sides. The crisis raises questions about who will control Madagascar now.\n\nAlec and Stephen Baldwin were involved in a serious head-on collision with a tree in East Hampton, New York, on October 13, 2025. Despite significant damage to their Range Rover, both brothers escaped the crash unharmed. Authorities responded to the scene amid heavy rain, and the circumstances of the accident are still under investigation.\n\nMadagascar's President Andry Rajoelina confirmed he is safe after an assassination attempt amid escalating political turmoil. Fleeing the nation aboard a French army aircraft, Rajoelina's departure follows the military's backing of youth-led protests demanding his resignation. He appealed for a constitutional resolution to the crisis, emphasizing his commitment to finding solutions despite threats to his life.\n\nStranger Things Season 5 Part 1 episodes titles, runtimes, Netflix release date and time have been confirmed. The first four episodes will release on November 26, 2025, with runtimes ranging from 54 to 83 minutes.\n\nChad Powers Episode 4 release time is set for October 14, 2025. The episode will stream on Hulu at 9 pm PT/12 am ET. Learn how to watch, the full episode guide, cast, runtime, and upcoming plot details for Hulu’s football comedy series starring Glen Powell.\n\nIn Asia, health professionals are increasingly performing female genital mutilation (FGM), a practice with no medical benefits. While parents seek safer procedures, rights advocates warn this 'medicalisation' legitimises a harmful human rights violation. Experts stress that FGM causes severe physical and psychological harm, and its professionalisation risks entrenching the practice, hindering global eradication efforts.\n\nBridgerton season 5 release date and filming update reveal that Netflix is moving forward with the series. Season 5 will likely follow Eloise Bridgerton’s story. Filming begins in Spring 2026 in the UK. Fans can expect a release in Spring 2027. Season 6 is also confirmed.\n\nYour skin can reveal hidden kidney problems.  Changes like extreme dryness, persistent itching, and unusual rashes are not just surface issues. They may indicate serious kidney dysfunction.  Nail abnormalities and swelling are also key signs.  Early detection through these skin warnings can lead to timely medical attention.  Understanding these symptoms is vital for kidney health.\n\nThe Tennessee Titans have dismissed head coach Brian Callahan. This decision comes after a disappointing 1-5 start to the 2025 season. Callahan's tenure concludes with a 4-19 record. The team cited a lack of sufficient growth and a failure to meet standards. This move follows a pattern of coaches being fired during the rookie seasons of top draft picks.\n\niPhone Air China launch 2025: Apple's iPhone Air is set to launch in China next week. Pre-orders begin Friday. This comes as China Unicom receives government approval for smartphone eSIM trials. Tim Cook is visiting China, meeting local talent. The iPhone Air's release was delayed due to eSIM regulations. This new device is expected to boost Apple's global shipments.\n\nBridgerton Season 4 release date has been officially confirmed by Netflix. The hit period drama returns in two parts in early 2026, focusing on Benedict Bridgerton’s love story with Sophie Beckett. The first part debuts on January 29, 2026, followed by the second on February 26, 2026.\n\nDoctors have found hope for fatty liver disease using two common heart drugs. The new study from the University of Barcelona shows this combo might help reduce liver fat and improve liver health. More tests on humans are needed, but experts say it could be a big step in treating fatty liver safely.\n\nDoug Lebda net worth and family are in focus after the LendingTree founder’s sudden death in an ATV accident. The 55-year-old built a major financial services company with a multimillion-dollar fortune. Here’s a detailed look at Doug Lebda’s career, financial assets, and family following his passing.\n\nMortgage rates 2025: Homebuyers have a prime opportunity this October. The week of October 12 to 18 offers the best conditions for purchasing a home. Mortgage rates have eased, housing inventory is growing, and price increases are slowing. This period provides more choices and better negotiation power for buyers. Local markets also show similar favorable timing.",
  "url": "https://economictimes.indiatimes.com/news/international/us",
  "scraped_timestamp": "2025-10-14T15:01:48.714106",
  "content_length": 11544,
  "word_count": 1789,
  "source_domain": "economictimes.indiatimes.com"
}