{
  "title": "US News",
  "content": "Young Thug released his highly anticipated album 'UY Scuti' on September 26, 2025, marking his first major project since his October, 2024 prison release. The album features collaborations with Future and addresses key relationships, following delays that pushed the release from earlier scheduled dates in 2024\n\nA groundbreaking million-year-old skull discovered in China challenges established timelines of human evolution, suggesting modern humans and related species diverged much earlier than previously thought. The Yunxian 2 skull, initially classified as Homo erectus, exhibits features aligning it with Homo longi, potentially shifting the origin of Homo sapiens to Asia.\n\nWhile minor pains often respond to home remedies, certain pains demand immediate medical attention. Chest pain may signal a heart attack or pulmonary embolism, while pelvic pain could indicate appendicitis or ectopic pregnancy. A sudden, severe headache, especially with accompanying symptoms, might point to a stroke or meningitis so one should not take them lightly as it can lead to loss of life if not treated on time.\n\nVivek Ramaswamy publicly requested YouTube reinstate Alex Jones and Nick Fuentes channels after platform banned both creators within hours of their return. YouTube previously banned Jones for hate speech violations and Fuentes for similar policy infractions\n\nChinese actor Yu Menglong died in Beijing after reportedly falling from a building. Audio recordings surfaced, alleging a USB drive retrieval from his body. This case recalls Qiao Renliang's 2016 death. Both actors shared an agency and a legal firm. Actress Song Yiren reportedly linked them to wealthy circles. Conspiracy theories surround their deaths. Depression was a factor in Qiao's demise.\n\nA major power failure occurred at Grand Central Terminal in New York City. The incident happened on Thursday evening. Parts of the transit hub were plunged into darkness. Backup generators restored power in thirty minutes. Five Metro-North employees were stuck in elevators. Firefighters rescued them. Train services were not affected. The reason for the blackout is still unknown.\n\nLaw & Order SVU Season 27 premiere reveals Captain Donald Cragen's death, honoring the longtime commanding officer played by Dann Florek. The memorial episode featured former SVU cast members returning to pay tribute to the beloved captain character\n\nJason Myers' last-second field goal secured a Seahawks victory over the Cardinals. Sam Darnold's strong performance led Seattle's offense. Kenneth Walker III contributed with significant rushing yards. The Seahawks' defense dominated with multiple sacks. Kyler Murray's late rally fell short despite two fourth-quarter touchdowns. Seattle extends their winning streak against Arizona.\n\nEvangelical pastor Voddie Baucham Jr. passed away on September 25, 2025, following a medical emergency, leaving behind a legacy marked by passionate preaching. A GoFundMe campaign in 2021 raised over $1.4 million for his heart treatment, sparking controversy when questions arose about the fund's allocation. Despite requests for transparency, neither Baucham nor Founders Ministries provided documentation on the expenditure.\n\nThe Powerball jackpot has reached an estimated $145 million for Saturday's drawing after no one matched all six numbers on Wednesday. A California ticket matched five numbers, winning $1 million. Earlier this month, a massive $1.787 billion jackpot was shared by tickets in Missouri and Texas, ending a 41-drawing streak without a grand prize winner.\n\nVoddie Baucham Jr., president of Founders Seminary, passed away at 56 due to an emergency medical incident. Known for his teachings on biblical manhood and cultural apologetics, his demise came nearly two weeks after he mourned the death of conservative activist Charlie Kirk. Baucham's last social media posts were dedicated to Kirk, praising his Christian faith and legacy.\n\nFreddie Freeman's two home runs propelled the Los Angeles Dodgers to an 8-0 victory over the Arizona Diamondbacks, securing their 12th NL West title in 13 seasons. Shohei Ohtani and Andy Pages also homered, while Yoshinobu Yamamoto pitched six scoreless innings. The Dodgers clinched home-field advantage for the wild-card series, while the Diamondbacks' playoff hopes dwindled with the loss.\n\nPresident Donald Trump celebrated former FBI Director James Comey's indictment on felony charges, calling him \"one of the worst human beings\" after federal grand jury charged Comey with false statements and obstruction of justice related to congressional testimony\n\nVoddie Baucham Jr., a prominent evangelical pastor, theologian, and author, passed away on September 25, 2025, leaving behind a large family and an estimated net worth between $1 million and $2 million. His income stemmed from book royalties, speaking engagements, educational roles, and ministry-related activities. Baucham's legacy is rooted in his Christian teachings, pastoral work, and cultural commentary.\n\nEggs offer numerous benefits when strategically timed. Consuming eggs for breakfast aids weight loss by controlling appetite and boosting metabolism. As a post-workout meal, they support muscle repair and growth. Evenings are also a great time to eat eggs as they promote relaxation and improve sleep quality, contributing to overall well-being and weight management.\n\nAmazon will pay $2.5 billion to settle an FTC lawsuit alleging deceptive Prime enrollment practices and difficult cancellations. The settlement includes a $1 billion civil penalty and $1.5 billion in refunds for affected consumers. Subscribers may receive automatic payouts or need to file claims to get reimbursed up to $51 for membership fees.\n\nFormer FBI Director James Comey was indicted on charges of making false statements and obstructing a congressional proceeding related to his 2020 testimony regarding the Russia investigation. The indictment, led by Trump's former attorney, faces scrutiny over the strength of the evidence. Comey maintains his innocence, while Trump celebrates the indictment as justice.\n\nDonald Trump announced new tariffs. The US will impose a 100 per cent tariff on specific pharmaceutical products from October 1. There is an exemption for companies building drug manufacturing plants in the US. New trade measures include duties on heavy trucks and kitchen cabinets. Trump aims to lower US drug prices.\n\nFlorida Department of Law Enforcement issues Amber Alert for 17-year-old Caden Speight from Marion County. Teen disappeared from Dunnellon location where shooting occurred Thursday afternoon, September 25. Authorities seek public assistance locating missing teenager possibly traveling with four Hispanic males in light-colored van\n\nVoddie Baucham Jr., a well-known evangelical pastor, passed away on September 25, 2025. Founders Ministries confirmed his death followed a medical emergency. Baucham's health had been a concern since his 2021 heart failure diagnosis. He underwent surgery and treatment. He served as dean at African Christian University in Zambia. Baucham is survived by his wife, nine children, and grandchildren.\n\nToday, Friday, September 26, 2025, the Moon moves into Sagittarius at 5:38 PM. This brings a feeling of optimism, curiosity, and a desire for adventure. It’s a great time to try new things and explore life with excitement.\n\nMicrosoft has disabled specific cloud and AI services utilized by a unit within the Israeli Ministry of Defense, following an internal review prompted by media reports. The review found preliminary evidence supporting allegations of a surveillance system targeting Palestinians in Gaza and the West Bank. This action does not affect Microsoft's cybersecurity services in the region.\n\nConor McGregor, the former two-division champion, has announced his readiness to return to the UFC for a White House event, demanding a staggering $100 million fight purse. He also seeks 100 U.S. 'Golden Visas' for his family and friends. McGregor, who last fought in 2021, recently rejoined the UFC drug-testing pool, signaling his comeback.\n\nNintendo of America announces Doug Bowser's retirement, effective December 31, 2025. Devon Pritchard, a seasoned executive with 19 years at Nintendo, will succeed him as president and COO. Satoru Shibata will join Nintendo of America as CEO, continuing his role at Nintendo Co., Ltd. Pritchard aims to expand experiences for fans and welcome new players.\n\nStarting in 2026, a major shift is coming to how many Americans save for retirement through their 401(k)s. If you are 50 or older and earned more than $145,000 last year, the way you make extra catch-up contributions to your retirement account will change. Instead of being able to make these contributions with pre-tax dollars, you'll be required to make them on a Roth (after-tax) basis.\n\nIslamic prayer timings, rooted in daily astronomical events, structure the lives of Muslims through five daily prayers: Fajr, Dhuhr, Asr, Maghrib, and Isha. These prayers, performed at specific times linked to the sun's position, foster spiritual discipline. As of September 26th, prayer times vary across major US cities, reflecting the diverse Muslim population of approximately 4.\n\nVoddie Baucham Junior, a well-known pastor, breathed his last on September 25, 2025. He was 56. Founders Ministries shared the news. Baucham was famous for his teachings. He served at African Christian University in Zambia. He authored books like 'Fault Lines'. Baucham faced heart issues in 2021. He was to join Founders Seminary in Florida.\n\nMaryland is stepping up its game on road safety starting October 1. New driving laws will hit the streets, with much heavier fines for speeding caught by cameras and tougher criminal penalties for serious violations. New cameras will appear along dangerous roads like I-83, I-695, and Route 200. These are aimed at curbing crashes in high-risk areas. For drivers, this is a clear warning: slow down, or face bigger fines and legal trouble.\n\nPresident Trump has signed an executive order approving a deal that would transfer TikTok’s U.S. operations to American investors, effectively reducing ByteDance’s control. The deal values the U.S. arm of TikTok at around US $14 billion. Under the plan, the U.S. investors (including Oracle, Silver Lake, MGX etc.) would hold a majority stake (reported as ~ 80% ). ByteDance and Chinese investors would retain a smaller minority stake (under 20%).\n\nRussia again increased its aerial activity near NATO. Hungarian fighters intercepted Russian planes near Latvia. The Russian aircraft flew without proper identification. This followed a similar incident where Russia conducted bomber patrols near Alaska. Russian jets also briefly entered Estonian airspace. NATO called these actions unacceptable. These events highlight the ongoing tensions between Russia and NATO.\n\nStarting in 2026, high earners age 50 and older who earned more than $145,000 in the prior year will no longer be able to make pre-tax 401(k) catch-up contributions. Instead, their catch-up contributions must be made on a Roth (after-tax) basis. This change is part of the SECURE 2.0 Act of 2022 and was confirmed in final IRS regulations released in 2025.\n\nU.S. stock markets declined for a third consecutive day on Thursday, September 25, 2025. The S&P 500 fell 0.5% to 6,604.72, the Dow Jones Industrial Average dropped 0.4% to 45,947.32, and the Nasdaq Composite slid 0.5% to 22,384.70. Despite the pullback, all three indexes remain near record highs reached earlier in the week. In individual stock news, CarMax saw a significant 20.1% decline, while, IBM rose 5.2% on promising quantum computing developments with HSBC. The Personal Consumption Expenditures (PCE) index for August will be released Friday.\n\nShaun Alexander’s family just keeps growing. The former NFL MVP and his wife, Valerie, are expecting their 14th child. The couple already has 13 kids. Fans are excited about the news. Shaun and Valerie shared the happy announcement recently. Their large family is well known in the NFL community. Shaun Alexander's net worth is estimated to be around $12 million to $15 million as of 2025.\n\nPeacemaker Season 2 Episode 6 will stream on HBO Max on September 26. John Cena’s Chris Smith moves to a parallel universe. The team plans to bring him back. All episode details, cast, and release times are covered.\n\niOS 26 hidden features: The latest iOS 26 update brings exciting features to iPhones, but some can impact battery life and performance. Tech experts advise disabling HDR screenshots and animated backgrounds to conserve storage and power. Turning off spatial scene effects, limiting background app refresh, and adjusting location services can also boost efficiency.\n\nBowel cancer is increasingly affecting younger adults, with diagnoses rising by 50% in the last 30 years. Experts are urging awareness of subtle, pain-free symptoms like iron deficiency anemia, changes in bowel habits, unexplained weight loss, bloating, and non-visible blood in stool. Early detection significantly improves survival rates, emphasizing the importance of prompt medical evaluation for persistent symptoms.",
  "url": "https://economictimes.indiatimes.com/news/international/us",
  "scraped_timestamp": "2025-09-26T16:20:32.383978",
  "content_length": 13197,
  "word_count": 1991,
  "source_domain": "economictimes.indiatimes.com"
}