{
  "title": "Watch: Giorgia Meloni reacts to Pakistani PM Sharif's call for Nobel Peace Prize for Trump",
  "content": "Pakistani Prime Minister Shehbaz Sharif on Monday nominated \"great\" US President Donald Trump for the 2026 Nobel Peace Prize, repeating his call to award the Republican with the global honour. Sharif's move drew a reaction from Italian PM Giorgia Meloni.\n\nAt the Gaza Peace Summit in Egypt's Sharm El-Sheikh, Sharif said, \"I would say that Pakistan had nominated President Donald Trump for Nobel Peace Prize for his outstanding, extraordinary contributions to first stop war between India and Pakistan and then achieve ceasefire along with his very wonderful team. And today, again, I would like nominate this great President for Nobel Peace Prize.\"\n\nNotably, India has repeatedly affirmed that there was no third-party mediation involved in reaching the ceasefire understanding with Pakistan during the conflict in May.\n\nStanding on the stage in the background with other leaders, behind Trump and Sharif, Meloni, who was otherwise seemingly distracted and looking elsewhere, turned her eyes towards the Pakistani PM as soon as he mentioned the Nobel for Trump.\n\nThe first mention caught her attention, following which Meloni again looked the other way. However, Sharif's second remark to nominate the US President again, for a Nobel Peace Prize next year, drew back the Italian PM's gaze at the Pakistani leader.\n\nAdditionally, Sharif also saluted Trump for his \"exemplary leadership, visionary leadership\", saying that he is the man that \"this world needed most at this point in time\".\n\nAfter Sharif's address, Trump returned to the dias and called the Pakistani PM's words \"beautiful\", joking that there wasn't anything left to say. \"Let's go home!\" he added.\n\nLater, Trump also mentioned Indian Prime Minister Narendra Modi and said, \"India is a great country with a good friend of mine at the top. He's done a fantastic job.\"\n\nHe then caught Sharif off guard, asking him, \"I think Pakistan and India are going to live very nicely together, right?\" The exchange after the question was just smiles and a nod from Sharif.\n\nThis wasn't the only awkward moment that featured Meloni at the Gaza Peace Summit in Egypt.\n\nTrump's compliment to Meloni during his speech also drew attention. During his speech, the US President thanked several global leaders standing behind him for their presence. On the Italian PM's turn, he said, \"We have a woman, a young woman who...I'm not allowed to say it because it's usually the end of your political career if you say she's a beautiful young woman.\"\n\nBut taking his \"chances\", Trump complimented her anyway and turned around to face Meloni. \"There she is, you don't mind being called beautiful, right? Cause you are. Thank you very much for coming, appreciate it,\" he said.\n\nIn the widely shared video clip of this exchange, Meloni seemed not to be pleased with the comment.\n\nThe trail did not end here. Turkish President Recep Tayyip Erdogan also passed advise to the Italian PM. He said, \"You look great, but I have to make you stop smoking.\" To which Meloni responded, \"I know, I know.\"",
  "url": "https://www.hindustantimes.com/world-news/watch-giorgia-meloni-reacts-to-pakistani-pm-sharifs-call-for-nobel-peace-prize-for-trump-101760424484678.html",
  "scraped_timestamp": "2025-10-14T15:37:13.327236",
  "content_length": 3029,
  "word_count": 498,
  "source_domain": "www.hindustantimes.com"
}