{
  "title": "Watch | IAF chief flies last sortie in outgoing MiG-21 jets at Chandigarh base",
  "content": "The Russian-origin MiG-21 fighter jets (Mikoyan-Gurevich) which have been the backbone of Indian Air Force's combat fleet for over six decades took their farewell flight in Indian skies on Friday at the Chandigarh Air Force Station.\n\nAir Chief Marshal AP Singh flew the last sortie of the squadron with the call sign ‘Badal 3’.\n\nA ceremony, which was attended by union defence minister Rajnath Singh, formerIAFchiefs SP Tyagi and BS Dhanoa and IAF group captain Shubhanshu Shukla, marked the culmination of operations of the MiG-21 supersonic fighter jets whose induction in the early 1960s catapulted the force into the jet age.\n\nA spectacular display by IAF's elite skydiving team ‘Akash Ganga’ bedazzled theChandigarhsky today as the jets descended from a height of 8,000 feet with a majestic flypast of MiG-21 aircraft accompanied by precision of the air warrior drill team and an aerial salute.\n\nThe fighter pilots flew theMiG-21jets in the three-aircraft Badal formation and the four-aircraft Panther formation, thundering over the skies for one final time.\n\nThe Surya Kiran aerobatic team also enthralled the audience with their breathtaking maneuvers.\n\nIn a recent post on X, about the retiring Mig-21s, the IAF said, \"Six decades of service, countless tales of courage, a warhorse that carried pride of a nation into the skies\".\n\nThe MiG-21 fighter jets also received a water gun salute as they decommission after 63 years in service.\n\nLooking backThe iconic aircraft was first inducted into the force more than six decades ago.The MiG-21fighter jetsused to be the mainstay of the IAF for a long period of time. After its first induction, the IAF procured over 870 MiG-21s to boost its overall combat prowess.The supersonic jets were the dominant platforms during 1965 and 1971 wars with Pakistan.The aircraft also played a key role in the 1999 Kargil conflict as well as 2019Balakot airstrikes.However, the IAF's workhorse the MiG-21s were also involved in multiple crashes in the last six decades, with spotlight many times being on the safety record of the ageing fleet of Soviet-origin aircraft, the PTI report read.(With inputs from PTI)\n\nThe iconic aircraft was first inducted into the force more than six decades ago.\n\nThe MiG-21fighter jetsused to be the mainstay of the IAF for a long period of time. After its first induction, the IAF procured over 870 MiG-21s to boost its overall combat prowess.\n\nThe supersonic jets were the dominant platforms during 1965 and 1971 wars with Pakistan.\n\nThe aircraft also played a key role in the 1999 Kargil conflict as well as 2019Balakot airstrikes.\n\nHowever, the IAF's workhorse the MiG-21s were also involved in multiple crashes in the last six decades, with spotlight many times being on the safety record of the ageing fleet of Soviet-origin aircraft, the PTI report read.",
  "url": "https://www.hindustantimes.com/india-news/watch-iaf-chief-air-marshal-ap-singh-flies-last-sortie-in-outgoing-mig-21-jets-at-chandigarh-base-101758867354991.html",
  "scraped_timestamp": "2025-09-26T16:20:32.966288",
  "content_length": 2833,
  "word_count": 458,
  "source_domain": "www.hindustantimes.com"
}