{
  "title": "‘We have six aircraft lined up’: HAL chief assures Tejas jets delivery by March 2026; cites slack from GE Aerospace for late delivery",
  "content": "Hindustan Aeronautics Ltd (HAL)has assured the Indian Air Force (IAF) that at least half a dozen Tejas Light Combat Aircraft (LCA) Mk-1A will be delivered by March 2026, despite significant delays primarily attributed to US defence major GE Aerospace’s inability to supply critical engines on schedule.\n\nChairman and Managing Director of HAL DK Sunil addressed weeks of public concern raised byIAFChief Air Chief Marshal AP Singh regarding the slow pace of Tejas deliveries. Sunil told PTI that while six aircraft are currently lined up and ready for delivery from HAL’s side, GE Aerospace was expected to deliver 12 F404 engines in 2023 but has only supplied one to date.\n\n“Every company goes through its fair share of criticisms. It does happen,” Sunil stated, acknowledging the concerns. “Unfortunately, in the case of LCA Mark 1A, we have built the aircraft. As of today, we have six aircraft lined up. But the engine deliveries have not happened from GE Aerospace,” he added.\n\nHe further explained that GE’s delays stemmed from production setbacks during theCOVID-19pandemic and the subsequent departure of senior engineers, causing cascading supply chain bottlenecks. However, Sunil confirmed that the technical issues with GE Aerospace have now been resolved, and HAL anticipates receiving 12 jet engines by March 2026.\n\n“I can assure you that as of today, six aircraft are ready. There is no let up from our side,” Sunil emphasised, expressing confidence in HAL’s ability to meet the revised delivery timeline. Looking ahead, HAL plans to increase production to 16 jets in the coming year, depending on a consistent supply of engines from GE Aerospace.\n\nThe delivery of theTejasMk-1A jets is crucial for the IAF, which is actively working to bolster its fighter squadron strength, currently standing at 31 against a sanctioned requirement of 42. The single-engine, multi-role Tejas Mk-1A is earmarked as a replacement for the IAF’s aging MiG-21 fighters. The Ministry of Defence had previously sealed a Rs 48,000 crore deal in February 2021 for 83 Tejas Mk-1A jets and is in the process of procuring an additional 97 at a cost of approximately Rs 67,000 crore.\n\nSunil praised the Tejas Mk-1A as a “world-class aircraft” equipped with a high-quality radar, advanced electronic warfare suites, and a comprehensive array of missiles and avionics, making it a “very potent platform” for the Indian Air Force. He also disclosed that several countries have expressed interest in the Tejas, with HAL engaged in ongoing discussions for potential export breakthroughs.\n\nNotably, Sunil confirmed HAL’s success in securing a mega contract for the supply of 156 Light Combat Helicopter (LCH) Prachand to the Indian military, valued at Rs 62,700 crore. These indigenously designed and developed combat helicopters, capable of operating at altitudes over 4,500 meters, are expected to begin deliveries in 2028.",
  "url": "https://www.financialexpress.com/business/defence/we-have-six-aircraft-lined-up-hal-chief-assures-tejas-jets-delivery-by-march-2026-cites-slack-from-ge-aerospace-for-late-delivery/3891707/",
  "scraped_timestamp": "2025-10-14T15:58:30.331045",
  "content_length": 2904,
  "word_count": 459,
  "source_domain": "www.financialexpress.com"
}