{
  "title": "What is Operation SAFE? Tulsa residents concerned as homeless move into neighborhoods",
  "content": "ATulsaneighborhood is seeing more homeless individuals on its streets and front yards, and some residents believe it is directly tied to state sweeps of encampments under Operation SAFE. The initiative, an acronym for Swift Action for Families Everywhere, aims to restore order and safety by clearing homeless encampments, trash, and criminal activity from state-owned property in Tulsa, according to theOklahomaGovernor’s website.\n\nKyndal Baker, who moved into her home near 51st and Yale earlier this year, told News On 6 she noticed a change only in the past few weeks. “Ever since the past few weeks, implementing the new policies, they don’t really know where else to go. And so they’ve been coming into the neighborhoods,” she said. She recalled finding one man lying on her lawn watching videos on his phone. Her neighbor reported a similar incident the same day. “It’s just become a lot more prevalent,” Kyndal added.\n\nSeveral neighbors believe the problem spikes whenever Tulsa police are spotted sweeping camps under the I-44 overpass. “Right at the highway overpass. Those are the days when we see them coming in most frequently,” she said, citing a correlation with Operation SAFE.\n\nAlso read:Will Taylor Swift attend Chiefs vs Ravens game at Arrowhead? Here's the latest\n\nOne makeshift camp even appeared near a local elementary school before it was removed. For Baker, the concern is not about blaming individuals but about feeling safe in her own neighborhood. “It’s difficult because you have to make the decision between confronting them and possibly getting hurt, or calling the police,” she said.\n\nNeighbors admit they feel conflicted about involving law enforcement but also fear letting the situation escalate, News 9 reported. Baker emphasized that she sees the larger picture, saying, “There’s no perfect solution. But I think this solution should have been fleshed out a little bit more before being implemented.”\n\nAlso read:Will Madison Beer attend Justin Herbert, Chargers' game vs NY Giants at MetLife? Here's the latest\n\nGovernor Kevin Stitt announced the Tulsa phase of Operation SAFE wrapped up on September 17. He said troopers and state crews cleared 64 encampments. They also removed more than 1.97 million pounds ofdebrisin 14 days. They completed this work with the most courtesy and professionalism,” Stitts said in his statement after OHP completed its work in Tulsa under Operation SAFE.\n\nThe governor said local leaders must now keep camps from reappearing. The Oklahoma Highway Patrol and Department of Transportation will continue to monitor state property, and people who refuse housing assistance but break the law “may face prosecution,” according to officials. News On 6 crews observed that some cleared sites remain empty, but others are already filling up again. For Baker and her neighbors, that means the same concerns could circle back. “We don’t know what’s next,” she added.\n\nOperation SAFE is a state program that clears homeless encampments from highways and other state-owned properties in Oklahoma.\n\nOfficials said 64 sites were cleared in 14 days, removing nearly 1.97 million pounds of debris.\n\nSome Tulsa families say homeless individuals displaced by the sweeps are now appearing on lawns, sidewalks, and near schools.\n\nGovernor Kevin Stitt confirmed the Tulsa phase wrapped up on September 17, 2025.\n\nState officials say the city must now enforce local laws to prevent camps from returning, while OHP will monitor state land.",
  "url": "https://www.hindustantimes.com/world-news/us-news/what-is-operation-safe-tulsa-residents-concerned-as-homeless-move-into-neighborhoods-101758821949805.html",
  "scraped_timestamp": "2025-09-26T00:34:01.594775",
  "content_length": 3486,
  "word_count": 550,
  "source_domain": "www.hindustantimes.com"
}