{
  "title": "What happened at Mississippi town? Four killed, several injured in shooting after homecoming game at Leland High School",
  "content": "A shooting occurred in a town in theMississippiDelta region, killing four people and injuring several others following a high school football homecoming game, confirmed Mississippi State Sen. Derrick Simmons.\n\nSimmons, who represents residents in the area, said the shootings took place in the downtown area of the smallMississippitown of Leland, where crowds had gathered after the game.\n\nFour others victims were brought to a hospital in Greenville before being flown to a larger hospital in Jackson, said Simmons.\n\nAlso Read:Nor'easter set to cause coastal flooding and disrupt air travel around US, New Jersey declares state of emergency\n\nSimmons stated that he was certain that the details were accurate since he got updates from law enforcement officials and the Washington County Sheriff's Office, which is conducting the investigation.\n\nSimmons remarked, “People were just congregating and having a good time in the downtown of Leland,” referring to the town of less than 4,000 residents.\n\nThe situation was described as “very chaotic” following the gunfire, with police, sheriff's deputies, and ambulances responding from all over.\n\nSimmons remarked, “It's just senseless gun violence. What we are experiencing now is just a proliferation of guns just being in circulation.”\n\nOfficials have requested that anyone with information about the tragic incident that occurred last night come forward and share it with officials as the local state senator.\n\nJasper County police have named a person of interest in connection with the shooting that occurred at the Heidelberg football game on Friday.\n\nJasper County Sheriff's Department identified Tylar Jarod Goodloe, 18, has been detained. A mugshot of Goodloe was shared on the sheriff's office's Facebook page early on Saturday.\n\nMeanwhile, Jasper County law enforcement officials want anyone who was at Friday's football game and has any knowledge on the incident to call the Jasper County Sheriff's Department at (601) 765-2588 or Heidelberg Police Chief Cornell White at (601) 422-7430.",
  "url": "https://www.hindustantimes.com/world-news/us-news/who-is-mississippi-town-shooting-suspect-four-killed-several-injured-after-homecoming-game-at-leland-high-school-101760198888639.html",
  "scraped_timestamp": "2025-10-11T23:54:13.385641",
  "content_length": 2044,
  "word_count": 311,
  "source_domain": "www.hindustantimes.com"
}