{
  "title": "What started with her babysitting money has now changed thousands of lives in Nepal",
  "content": "It’s been 10 years since Maggie Doyne was named the 2015 CNN Hero of the Year for her work caring for and educating vulnerable children and orphans in rural Nepal.\n\nWhat started with a plot of land that she purchased with her babysitting money has become a global model for poverty alleviation and development through her nonprofit,BlinkNow Foundation.\n\n“It’s really a community vision for care and what children need to thrive,” Doyne, 38, said.\n\nAfter high school, Doyne began her work after meeting a young girl in Surkhet, Nepal, whose life was ravaged during the country’s decades-long civil conflict.\n\nToday, Doyne cares for 93 children, addressing their immediate needs and supporting them for long-term growth and self-sufficiency.\n\nHer Kopila Valley School, once a small “bamboo shack,” has now served 1,000 students with state-of-the-art facilities, modern technology, and diverse course offerings. Students participate in gardening, farming, and conservation classes and are provided healthy meals to address malnutrition. There is an onsite daycare, as well as a job readiness program called “Futures” to launch students toward college, vocational programs, and job training.\n\n“We’ve now raised a generation of children,” Doyne said. “They are out in the world as architects, engineers, social workers, teachers, and entrepreneurs.”\n\nThe Kopila Valley Children’s Home, once a one-story structure, is now a four-story Children’s Village, with a new facility set to open later this year. Doyne says her goal is to keep families together, but when that is not an option, her home offers safety, protection, and love to the most vulnerable children in the area.\n\nThe organization also has a separate home for at-risk girls who have been victims of trauma, human trafficking, and violence; a food and farming program that trains Indigenous women and farmers; and a full-service medical clinic. Doyne and a team of 175 caregivers, teachers, and professionals work together to offer comprehensive services that address the roots of poverty.\n\nWhile Doyne’s last decade has been defined by enormous achievements, it has also come with profound heartache. On December 30, 2015, Doyne’s son Ravi died by accidental drowning. At one point, the traumatic loss made progress seem impossible.\n\n“I didn’t know if I would recover,” Doyne said. “The years following were about putting the pieces back together and really healing as a family.”\n\nAt a speaking engagement in Los Angeles, Doyne connected with Jeremy Power Regimbal, a filmmaker who shared a passion for humanitarian causes and storytelling. He started documenting Doyne’s work and life story. And the two began a journey together, professionally and personally. Now married, they raise their biological children in Nepal amongst their 93 siblings.\n\n“It’s been a chapter of partnership and building this beautiful family,” Doyne said. “We are very much committed to working hand in hand with our team and our community; continuing to spread the word of helping the orphan crisis.”\n\nUnited by a shared mission to make a difference, Power Regimbal directed and filmed “Between the Mountain and the Sky,” a documentary released this year that highlights the raw and often painful realities of Doyne’s work.\n\n“It definitely lifts the veil of heroism,” Doyne said. “By showing that vulnerability, it’s inspired people in a way that I never imagined.”\n\nHope and action are ideas that Doyne made a reality two decades ago. And today, her message remains: Anyone can make a difference, and small acts can have big impacts.\n\n“Keep doing what you can, where you are,” she said. “Keep showing up, keep loving, keep going with your acts of kindness. It all matters.”",
  "url": "https://edition.cnn.com/2025/10/10/world/nepal-blinknow-maggie-doyne-cnnheroes-update",
  "scraped_timestamp": "2025-10-11T23:47:56.365050",
  "content_length": 3710,
  "word_count": 588,
  "source_domain": "edition.cnn.com"
}