{
  "title": "Where is Kerri Rawson 20 years after dad BTK Killer Denise Rader’s arrest? Here's all you need to know",
  "content": "Dennis Rader, also known as the BTK Killer, killed 10 people over the course of 17 years. He set foot in the world of crime in 1974 and went on to commit murders till 1991. Almost two decades after Rader’s arrest, his daughter, Kerri Rawson, is making headlines for speaking out about her father.\n\nRawson took the center stage in the newly releasedNetflixseries, Watch My Father, the BTK Killer, where she revealed that she learned of her dad’s crimes in 2005, at the time of his arrest.\n\nPreviously, Rawson also spoke about her father’s arrest with People Magazine. She said at the time, “Nobody wants to believe their father could be capable of such monstrous things.”\n\nAlso Read:Serial killer in Houston? Officials' latest update after 5 bodies found in one week\n\nRader was a Boy Scout leader and an active member of the local church before he turned into a murderer. He would often send out letters to the investigators and reporters after his crimes and would sign them as BTK, a short form for “bind, torture, and kill.”\n\nAfter his daughter, now 46, got to know about her father’s heinous act, she tried to distance herself from him. According to People, Rawson claimed that headlines frequently read \"BTK's daughter, Kerri Rawson,\" except one that said, \"Kerri Rawson, daughter of Dennis Rader, the BTK killer.\"\n\nShe stated that she preferred to be identified as Kerri Rawson because she was more than just a criminal's daughter.\n\nRawson earlier sat down for a conversation with ABC for their 20/20 documentary, wherein she revealed that herDNAwas used without her consent to catch her father. She claimed that her privacy was violated through the act and would have given samples only if the officers had asked.\n\nHowever, Rawson claimed that she is glad that the DNA could help with the investigation and that it led to the police catching her father and saving the community.\n\nAlso Read:Monster: The Ed Gein Story ending explained - Did Ed Gein help FBI catch another killer? How did he die?\n\nFollowing her father’s arrest, Kerri Rawson went into seven years of therapy to deal with the trauma of everything that had happened. Now, she moved on with her life and is a married mother of two. In 2019, she released a book with the title A Serial Killer’s Daughter, wherein she expressed what it was like living under the same roof as a murderer.\n\nWhile none of Rader’s family members attended his court sessions, Rawson met him for the first time in 2023. After she visited the prison, Kerri refused to go back ever again.\n\nMeanwhile, on the work front, Rawson uses hersocial mediaplatforms to advocate for the victims of crime. She also helps the families of criminals cope with the trauma and the public scrutiny that comes along, including the online bullying, as reported by People.\n\nKerri Rawson wants to be known as more than just her father’s daughter, and she is doing everything possible to leave the past and the trauma behind.\n\nAns. Dennis Rader is a serial killer, known to have murdered 10 people over the course of 17 years.\n\nAns. Kerri Rawson’s book is titled A Serial Killer’s Daughter.",
  "url": "https://www.hindustantimes.com/world-news/us-news/where-is-kerri-rawson-20-years-after-dad-btk-killer-denise-rader-s-arrest-heres-all-you-need-to-know-101760189797546.html",
  "scraped_timestamp": "2025-10-11T23:46:21.530189",
  "content_length": 3109,
  "word_count": 535,
  "source_domain": "www.hindustantimes.com"
}