{
  "title": "‘Which part of Bengaluru…': Karnataka ministers on Biocon chief Kiran Mazumdar-Shaw's ‘bad roads, garbage' post",
  "content": "Biocon chairperson Kiran Mazumdar-Shaw concerns over infrastructure in Karnataka's Bengaluru have drawn political reactions, with state minister Priyank Kharge wondering what part of the city the Indian billionaire entrepreneur has seen.\n\nKiran Mazumdar-Shaw on Mondaysaid in a post on Xthat an overseas business visitor to Biocon Park asked her why were city's roads so bad and \"why is there so much garbage around\".\n\n“I had an overseas business visitor to Biocon Park who said ‘ Why are the roads so bad and why is there so much garbage around? Doesn’t the Govt want to support investment?” Shaw wrote in her post.\n\n“I have just come from China and cant understand why India can’t get its act together especially when the winds are favourable?” she added.\n\nResponding to her comments on Tuesday, Karnataka's minister of rural development and panchayat rajPriyank Khargesaid he is not sure “which part of Bengaluru they have seen”.\n\n\"As I have said, the work is in progress. We are growing at a rapid pace, and whatever is necessary for the infrastructure improvement, we are doing it,\" Priyank Kharge said, speaking to news agency ANI.\n\nKarnataka Minister MB Patil described Kiran Mazumdar-Shaw as a “big asset” to the state and the country, saying that she has created a name for Bengaluru with Biocon and adding the city “has also given back to her”.\n\n“It is mutual,” Patil said and adding that posting about something on which work is ongoing is “not in good taste”.\n\n\"Once there were potholes, and heavy rainfalls. Now it's been attended. Thousands of crores have been given, and the work is going on... When the work is going on, you tweeting it again is not in good taste...,\" MP Patil said.\n\nLast week, Karnataka deputy chief ministerDK Shivakumarsaid he has moved \"heaven and earth\" to fix the city's garbage problems and alleged involvement of \"big garbage mafia\" that has stalled the progress.\n\nSpeaking at an event, DK Shivakumar, who is also the Bengaluru development minister, said the traffic congestion is a global and national challenge, citing London and Delhi as examples. He said that the traffic issue in Bengaluru is receiving traction due to the vibrancy of the state's traditional and social media.\n\n“Even in London, people have to travel three hours if they don't go by public transport. Even in Delhi, it will take 1.5 hours to reach Parliament from the airport, but Bengaluru is making more noise than Mumbai, Chennai and Hyderabad,” PTI news agency quoted Shivakumar as saying.\n\n“Because we are very free to all friends, and our social media is picking up. Next is the artificial intelligence and social media. We are not curbing. But as far as Tamil Nadu is concerned, as far as Andhra is concerned and as for other states are concerned, the media is not allowed to work freely as Karnataka has been open to them. We accept criticism,” he had said.",
  "url": "https://www.hindustantimes.com/india-news/which-part-of-bengaluru-karnataka-ministers-on-biocon-chief-kiran-mazumdar-shaw-bad-roads-garbage-post-101760426000527.html",
  "scraped_timestamp": "2025-10-14T15:11:00.843114",
  "content_length": 2878,
  "word_count": 486,
  "source_domain": "www.hindustantimes.com"
}