{
  "title": "WHO warns against use of Coldrif, Respifresh TR and ReLife cough syrups",
  "content": "The World Health Organization (WHO) has issued an alert against the use of three cough syrups — Coldrif, Respifresh TR and ReLife — following the deaths of dozens of children in India despite India’s drugs regulator confirming that none of the syrups was exported, even illegally, the UN health body said in a statement.\n\n“On October 8, the Central Drugs Standard Control Organization (CDSCO) of India reported to WHO the presence of diethylene glycol (DEG) in at least three oral liquid medicines. This followed information, identified by WHO on 30 September 2025, of localised clusters of acute illness and child fatalities in India. CDSCO informed WHO that the contaminated products were reportedly consumed by the affected children,” the WHO alert read.\n\nThe affected products are oral liquid medicines containing active ingredients commonly used to relieve symptoms of the common cold, flu, or cough.\n\n“The contaminated oral liquid medicines have been identified to be specific batches of Coldrif, Respifresh TR and ReLife, manufactured by Sresan Pharmaceutical, Rednex Pharmaceuticals and Shape Pharma, respectively,” it said.\n\nCDSCO recommended the cancellation of the manufacturing license of Sresan Pharmaceutical after tests confirmed the presence of toxic DEG at nearly 500 times the permissible limit. While the permissible limit is 0.1%, the samples taken from the manufacturing unit in Tamil Nadu were found to have 48.6% DEG after testing.\n\nThe statement also said CDSCO confirmed that relevant state authorities have ordered an immediate halt to production at implicated manufacturing sites and have suspended product authorisations. In addition, a recall of the contaminated products has been initiated by the relevant state authorities.\n\nThe UN health body also noted in the alert that CDSCO informed WHO that none of the contaminated medicines have been exported from India and there is currently no evidence of illegal export.\n\n“Nevertheless, WHO encourages National Regulatory Authorities (NRAs) to consider targeted market surveillance, with particular attention to informal and unregulated supply chains where products may circulate undetected. NRAs are also advised to carefully evaluate the risks associated with any oral liquid medicines originating from the same manufacturing sites, particularly those produced since December 2024,” read the WHO alert.\n\n“WHO continues to collaborate closely with Indian health authorities to monitor the situation, identify the source of the contamination and mitigate any potential public health risks. The products identified in this alert are considered substandard as they fail to meet their quality standards and their specifications.”",
  "url": "https://www.hindustantimes.com/india-news/who-warns-against-use-of-coldrif-respifresh-tr-and-relife-cough-syrups-101760436884787.html",
  "scraped_timestamp": "2025-10-14T16:00:57.746479",
  "content_length": 2702,
  "word_count": 401,
  "source_domain": "www.hindustantimes.com"
}