{
  "title": "Who is Charles Crawford, Mississippi inmate set to be executed over rape and murder of college student?",
  "content": "AMississippiman convicted of kidnapping, raping and killing a 20-year-old community college student is set to be executed Wednesday evening at the Mississippi State Penitentiary in Parchman.\n\nCharles Crawford, 59, has been on death row for more than 30 years. The scheduled lethal injection comes several months after the execution of Mississippi’s longest-serving death row inmate in a year of increasing executions nationwide.\n\nCrawford was convicted of abducting Kristy Ray from her parents’ home in northern Mississippi’s Tippah County on Jan. 29, 1993. According to court records, when Ray’s mother came home, her daughter’s car was gone and a handwritten ransom note had been left on the table.\n\nThe same day, a different ransom note, made from magazine cutouts and concerning a woman named Jennifer, was found in the attic of Crawford’s former father-in-law. The note was turned over to law enforcement, who began searching for Crawford. He was arrested a day later and said he was returning from a hunting trip.\n\nHe later told authorities he blacked out and did not recall killing Ray.\n\nAt the time of his arrest, Crawford was days away from going to trial on a separate assault charge. That stemmed from an attack in 1991 in which Crawford was accused of raping a 17-year-old girl and hitting her friend with a hammer.\n\nDespite his assertions that he had experienced blackouts and did not remember committing either the rape or the hammer attack, Crawford was found guilty of both charges in two separate trials.\n\nHis prior rape conviction was considered an “aggravating circumstance” by jurors in Crawford’s capital murder trial for Ray's killing, paving the way for his death sentence.\n\nOver the past three decades, Crawford has tried unsuccessfully to overturn his death sentence.\n\nHis lawyers are currently appealing to the U.S. Supreme Court, arguing that Crawford should be granted a new trial because his Sixth Amendment rights were violated in his 1994 trial.\n\nThe appeal alleges that Crawford’s lawyers admitted his guilt in the capital murder trial and pursued an insanity defense despite Crawford’s repeated objections. The argument relies on a 2018 Supreme Court ruling, which ordered a new trial for a death row inmate and established that a lawyer for a criminal defendant cannot override a client’s wish to maintain innocence at trial.\n\n“It’s almost like he didn’t even get the chance to have innocent or guilty matter because his attorney just overrode his wishes from the outset,” said Krissy Nobile, the director of the Mississippi Office of Capital Post-Conviction Relief, who represents Crawford.\n\nThe Mississippi Supreme Court dismissed the argument in September, writing that Crawford should have brought the appeal sooner and did not present adequate reasoning why the 2018 Supreme Court ruling should be retroactive.\n\nAfter the Mississippi Supreme Court set his execution date in September, Nobile said Crawford expressed both disappointment and resolution.\n\n“He has a very deep faith in God, and he trusts in God,” Nobile said. “He wants to be the best person he can be with the time he has left.”\n\nNobile characterized Crawford as a respected, uplifting presence on death row. She said he works inside the prison and advocates for other inmates who may be struggling with mental health or need medical attention.\n\nThe Associated Press made multiple attempts to contact Ray’s relatives but did not receive a response. Crawford also did not return requests for comment.\n\nThe planned lethal injection was to be the third in two days in the U.S. after executions Tuesday in Florida and Missouri. A total of 37 men have died by court-ordered execution so far this year in the United States.\n\nIn Florida, Samuel Lee Smithers, 72, was put to death for the 1996 killings of two women whose bodies were found in a rural pond. In Missouri, Lance Shockley was executed for fatally shooting a state trooper in 2005.",
  "url": "https://www.hindustantimes.com/world-news/us-news/who-is-charles-crawford-mississippi-inmate-set-to-be-executed-over-rape-and-murder-of-college-student-101760504838538.html",
  "scraped_timestamp": "2025-10-15T11:03:54.709104",
  "content_length": 3938,
  "word_count": 640,
  "source_domain": "www.hindustantimes.com"
}