{
  "title": "WHO issues warning over contaminated cough syrup in India after multiple child deaths",
  "content": "The World Health Organization (WHO) on Monday issued a health advisory warning against the use and distribution of three cough syrups believed to be responsible for the deaths of several children in India over the last month.\n\nThe drugs were identified as specific batches of Coldrif, Respifresh TR and ReLife, the WHO said ina statement, manufactured by three Indian companies: Sresan Pharmaceutical, Rednex Pharmaceuticals, and Shape Pharma.\n\nThe oral liquid drugs were found to contain higher levels of diethylene glycol (DEG), a toxic ingredient that can lead to serious injury or death, especially in children, according to the agency.\n\nThis is not the first time dangerous levels of toxic chemicals have been detected incough medicines manufactured in India,the world’s largest generic drug exporter. In 2023, exported cough syrups were linked to the deaths of dozens of children in Uzbekistan and The Gambia.\n\nIndian state authorities have ordered an immediate halt to drug production at the three manufacturers and have suspended product authorizations, the WHO said in its statement. Contaminated products have also been recalled and have not been exported from India.\n\n“There is currently no evidence of illegal export,” the WHO said, urging global regulatory bodies to pay attention to unregulated supply chains and other oral liquid medications manufactured by the three companies since December 2024.\n\nCNN has reached out to Sresan Pharmaceutical, Rednex Pharmaceuticals, and Shape Pharma for comment.\n\nAuthorities in the southern state of Tamil Nadu, where Sresan Pharmaceuticals is headquartered, said Monday that they suspended the manufacturer’s license and shut down the company after an investigation found that at least 19 children in the central state of Madhya Pradesh died from consuming Coldrif syrup, according toReuters news agency.\n\n“In the beginning they had a cough and cold, and then renal failure symptoms leading to deaths,” Ajau Pandey, superintendent for the Chhindwara district in Madhya Pradesh said at a news conference on October 5.\n\nA subsequent investigation identified “higher than permissible limits” of DEG as the reason behind the deaths, Pandey added.\n\nPolice in Tamil Nadu arrested the owner of Sresan Pharmaceuticals last week, while two senior drug inspectors from the city of Kanchipuram also had their licenses revoked and are expected to face disciplinary action over failing to conduct mandatory inspections of sites, the state government said on Monday.\n\nSuperintendent Pandey said that a case is also being built against a Tamil Nadu-based doctor who prescribed the medication.\n\nThe WHO’s warning comes after the agency identified local clusters of acute illness and child deaths across India in late September. Days later, India’s Central Drugs Standard Control Organization told the WHO that DEG was found in at least three cough syrups consumed by affected children.\n\nIndia halts production of cough syrups suspected of links to child deaths\n\nIn 2022, Indian health authorities suspended the production of cough syrups fromMaiden Pharmaceuticalsafter several brands of oral liquid medicines were found to have “unacceptable amounts” of chemicals that can damage the brain, lungs, liver and kidneys of those who take them.\n\nHealth officials believed the medicines to be linked to the deaths of more than 60 children in the Gambia, and potentially more than 20 children in Indonesia.",
  "url": "https://edition.cnn.com/2025/10/14/world/who-warning-contaminated-cough-syrup-india-deaths-intl-hnk",
  "scraped_timestamp": "2025-10-14T15:53:40.118789",
  "content_length": 3438,
  "word_count": 527,
  "source_domain": "edition.cnn.com"
}