{
  "title": "Who is Livia Giuggioli? Oscar-winning actor Colin Firth's ex-wife returns top Royal honor over Trump UK visit",
  "content": "Livia Giuggioli, the ex-wife of Colin Firth, has given back a renowned royal award in a weird gesture of protest against the UK's “appeasement” of President Trump during his recent state visit withMelania Trump.\n\nIn a dramatic Instagram outburst on Wednesday, Giuggioli, who received the Most Excellent Order of the British Empire (MBE) in 2019 for her achievements to the fashion business, tore up her certificate and declared she was submitting the medal to the UK government.\n\nFollowing Trump's warm reception during his last week UK visit, she said that the POTUS was using his “poisonous rhetoric” at theUN General Assembly.\n\n“I have been reflecting on his visit to the UK last week and I am afraid I can’t reconcile the way he was appeased and honoured and, again, legitimized,” Giuggioli captioned her video.\n\nDespite claiming to oppose the “British Empire and remnants of that toxic system,” she claimed that she simply accepted the accolade on behalf of “garment worker activists” and to honor King Charles for his “decades battling on behalf of social and environmental justice.”\n\nThe Italian national scolded King Charles for his “frightening and cowardly display” of caving in to someone who champions the destruction of the environment and the world's most defenseless citizens.\n\n“Because I can’t reconcile those two positions, I have shredded my honor and I am returning it to sender,” she wrote.\n\nGiuggioli asserted that she felt “it's only by taking a stand that we can make our feelings known,” which is why she defied authority by surrendering her MBE and tearing up her honor “certificate.”\n\nIn addition, she produced a letter signed off as “Livia Giuggioli (Firth)” that she intended to submit with her reward.\n\nWhat is Most Excellent Order of the British Empire?The Most Excellent Order of the British Empire is regarded as one of the most prestigious medals in the UK established by King George V in 1917 to commemorate outstanding community service, grassroots efforts, or noteworthy local accomplishments.The marriage of Giuggioli and Colin Firth, who share two children Luca, 24, and Matteo, 22, ended after she confessed to having an affair with Italian journalist Marco Brancaccia during her temporarily separation from the two-time BAFTA Award-winning actor in 2015–2016.\n\nThe Most Excellent Order of the British Empire is regarded as one of the most prestigious medals in the UK established by King George V in 1917 to commemorate outstanding community service, grassroots efforts, or noteworthy local accomplishments.\n\nThe marriage of Giuggioli and Colin Firth, who share two children Luca, 24, and Matteo, 22, ended after she confessed to having an affair with Italian journalist Marco Brancaccia during her temporarily separation from the two-time BAFTA Award-winning actor in 2015–2016.",
  "url": "https://www.hindustantimes.com/world-news/us-news/who-is-livia-giuggioli-oscar-winning-actor-colin-firths-ex-wife-returns-top-royal-honor-over-trump-uk-visit-101758816067528.html",
  "scraped_timestamp": "2025-09-26T00:34:17.083329",
  "content_length": 2819,
  "word_count": 447,
  "source_domain": "www.hindustantimes.com"
}