{
  "title": "Who is Ashley Tellis? India-born US advisor accused of taking classified docs, meeting the Chinese",
  "content": "An India-born US State Department employee has been arrested after being accused of allegedly retaining classified records and meeting with the Chinese were framed in an affidavit in a federal court in Virginia. On October 13, Ashley Tellis, one of the most prominent experts on India in the US and a senior adviser at the State Department, wascharged the unlawful retentionof national defense information.\n\nAccording to court documents accessed by Hindustan Times, Tellis is accused of unlawfully retaining classified national defense materials and allegedly holding multiple meetings with Chinese government officials.\n\nBorn in India, 64-year-old Ashley J Tellis is a key figure in the US state department, serving as an adviser since 2001. He reportedly played a key role in the US-India civil nuclear deal talks in the mid-2000s.\n\nNot just US President Donald Trump, Tellis also served in senior positions under former president George W Bush. According to news agency AFP, Tellis played a key role in negotiating theBush administration’s landmark civil nuclear agreementwith India, sealed in 2008.\n\nThe agreement was widely seen as a turning point in strengthening ties between the world’s two largest democracies.\n\nAfter President Trump’s 50% tariffs on India came into effect, several US government officials and strategic experts linked to the State Department weighed in on the development. Among them was Ashley J Tellis, who offered his perspective on what may have fuelled the move.\n\nTellisreportedly suggested that Trump felt \"cheated\"because he did not get the credit for resolving the India-Pakistan conflict back in May this year. \"I think he feels cheated that he did not get the credit that he believes is his due for having resolved the India-Pakistan crisis in May 2025, and my suspicion is Prime Minister Modi's call to him, to set the record right, only inflamed the situation rather than resolving it,\" Tellis told NDTV.\n\nDonald Trump has repeatedly claimed to havebrokered a ceasefire between India and Pakistan, a claim New Delhi has always rejected.\n\nThe affidavit filed against Ashley Tellis in a Virginia court outlines multiple charges, including violations of federal laws related to the unlawful retention of national defense information. It also cites a series of meetings he allegedly held with Chinese government officials at restaurants in Fairfax, Virginia, between September 2022 and September 2025.\n\n“Tellis entered the restaurant with a manila envelope” which “did not appear” to be in his possession when he departed, the document states, citing a dinner on September 15, 2022.\n\nAccording to the affidavit,Ashley Tellis and the Chinese officialswere allegedly overheard discussing Iranian-Chinese relations and the US-Pakistan relations, among others, and he received a red gift bag from the officials too.\n\n\"The charges as alleged in this case represent a grave risk to the safety and security of our citizens,\" said Lindsey Halligan, the US attorney for Virginia's eastern district, reported news agency AFP.\n\nAccording to the US Justice Department, Tellis faces a maximum sentence of 10 years in prison and a fine of up to $250,000 if convicted on charges of unlawfully retaining classified documents.",
  "url": "https://www.hindustantimes.com/world-news/who-is-ashley-tellis-arrested-india-us-advisor-accused-of-illegal-retaining-classified-documents-meeting-chinese-101760491881702.html",
  "scraped_timestamp": "2025-10-15T09:48:41.724984",
  "content_length": 3244,
  "word_count": 504,
  "source_domain": "www.hindustantimes.com"
}