{
  "title": "Who is Jaysohn Sykes? Suspect in Sanjay Samuel shooting outside Queens Dunkin’ Donuts",
  "content": "Jaysohn Sykes has been identified as the suspect in the shooting of a 13-year-old Sanjay Samuel in the head outside a Queens Dunkin’ Donuts this week, The New York Post reported on Thursday. Police, as per the report, believe that the attack took place likely over a ‘gang beef’. The suspect is still at large.\n\nAccording to The Post, Sykes is a 16-year-old Martin Van Buren High School student. He rolled up on a Razon scooter and shot Samuel at around 8:20 AM local time on Monday. The victim was brain dead, an NYPD official said.\n\nAs per NYPD Chief of Detectives Joseph Kenny, Samuel appeared to be affiliated with the SSM, or Sex Money Murder gang, a part of the Bloods. However, he is not listed in the police department's database and does not have a criminal history. The slain teen identified himself as ‘J2 Guns’ on social media.\n\n“He posts quite frequently – SSM with a drop of blood,” Kenny told reporters. The official further added that Skyes and Samuel got into a brawl outside the coffee shop.\n\n“He walks up to the group and confronts them. They’re yelling back and forth. Suddenly, the group scatters,” Kenny added. “We believe at this point, our perpetrator pulls out and displays a pistol, which causes the crowd to disperse a little bit.\"\n\n“The perpetrator gets back on the scooter to leave. The crowd starts yelling at him again. He comes back, at which point he gets into a physical fight with our victim,” Kenny said.\n\n“They start throwing punches at each other, and then a shot is fired. He goes down. Our perpetrator flees the scene.”\n\nA local could be seen asking Skyes to stop and surrender the gun. The suspect, however, refused.\n\n“Obviously, the civilian says no, but says, ‘Can I have your sweatshirt?’” Kenny said. “And for some reason the perp gives him his sweatshirt. So it’s a very identifiable sweatshirt. It’s clearly the one that’s on the scene that he was wearing during the shooting.”\n\n“What we’re getting from our victim’s friends is that Flex is a known troublemaker in the area. And we have on video from the Dunkin Donuts – a male as the interaction is going on, where they’re taunting each other, he’s saying, ‘Flex is gonna die. Flex is gonna die.’”",
  "url": "https://www.hindustantimes.com/world-news/us-news/who-is-jaysohn-sykes-suspect-in-sanjay-samuel-shooting-outside-queens-dunkin-donuts-101758827007458.html",
  "scraped_timestamp": "2025-09-26T00:47:54.151135",
  "content_length": 2195,
  "word_count": 388,
  "source_domain": "www.hindustantimes.com"
}