{
  "title": "Why no CCTV cameras in interrogation room of police stations: SC asks Rajasthan govt",
  "content": "New Delhi, The Supreme Court on Tuesday asked the Rajasthan government why no CCTV cameras are installed in the interrogation room of police stations.\n\nA bench of Justices Vikram Nath and Sandeep Mehta observed that interrogation room of a police station is the \"main place\" where CCTV cameras have to be there.\n\n\"As per your affidavit, there is no camera in the interrogation room which is the main place where cameras have to be there,\" the bench said.\n\nThe top court said installing CCTV cameras would entail cost but \"it is a question of human rights\".\n\nIt also asked the state how it proposes to have an oversight mechanism.\n\nThe bench was hearing a suo motu matter concerning lack of functional CCTVs in police stations.\n\nOn September 4, the apex court had taken suo motu cognisance of a media report which stated that 11 lives were lost in police custody in Rajasthan in the first eight months of 2025, of which seven incidents occurred in the Udaipur division.\n\nThe apex court had in 2018 ordered installation of CCTV cameras in police stations to check human rights abuses.\n\nDuring the hearing on Tuesday, the bench observed why cannot an agency be involved in the oversight process.\n\n\"The feed has to go to some centralised place or agency where there is an oversight,\" the bench said.\n\nIt also heard the submissions of senior advocate Siddhartha Dave, who was appointed as an amicus curiae to assist the court in a separate matter in which the top court had passed an order in December 2020.\n\nIn that order, the top court had directed the Centre to install CCTV cameras and recording equipment at the offices of investigating agencies, including the CBI, the Enforcement Directorate and the National Investigation Agency.\n\nDave told the bench that he has filed an updated report in the matter.\n\nHe also stressed that an oversight mechanism was needed.\n\nThe bench referred to the affidavit filed by Rajasthan in the suo motu matter and said no CCTV cameras were there in the interrogation room of police stations.\n\nIt asked the Centre and other states to file responses to the report placed by the amicus and posted the matter for hearing on November 24.\n\nWhile hearing the suo motu matter on September 15, the apex court flagged the issue of oversight and said it was thinking of having a control room without any human intervention for monitoring of feeds of CCTV cameras installed at police stations.\n\nIn its order passed in the matter on September 26, the bench posed several queries to the Rajasthan government and directed it to apprise about the number of CCTV cameras installed in each police station across the state.\n\nThe top court had also asked whether any regular audit was conducted to check the functioning of the installed cameras.\n\nThe bench had further asked the state to respond to queries, including whether there was any provision for surprise inspections and forensic validation of tamper proofing.\n\nIt had said apparently, the non-functioning of CCTV cameras or non-preservation of the video recording and its data was in breach of the directions issued by the apex court in its December 2020 judgement.\n\n\"We, therefore, direct the Additional Advocate General of the State of Rajasthan to take notice and file a response to the following queries: - number of police stations in each district. number of cameras installed in each police station with placement details,\" the bench had said.\n\nBesides other queries, it had also sought details about specifications of cameras like resolution, night vision, field of view, audio capture and tamper detection.\n\nIn December 2020, the top court had said states and union territories should ensure CCTV cameras were installed at each police station, at all entry and exit points, main gate, lock-ups, corridors, lobby and reception as also areas outside the lock-up rooms so that no part was left uncovered.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/why-no-cctv-cameras-in-interrogation-room-of-police-stations-sc-asks-rajasthan-govt-101760435271413.html",
  "scraped_timestamp": "2025-10-14T15:50:45.572747",
  "content_length": 3975,
  "word_count": 665,
  "source_domain": "www.hindustantimes.com"
}