{
  "title": "Why Israeli PM Benjamin Netanyahu avoided European airspace on his route to the UN",
  "content": "Israeli Prime Minister Benjamin Netanyahu took an unusually longer route from Tel Aviv to New York this week while travelling to the US for the key United Nations General Assembly session.\n\nAs the news emerged, Netanyahu's re-routing raised questions about whether international legal pressures are starting to reshape even the skies he travels through amid the ongoing conflict with Hamas and Iran.\n\nAccording to flight records from FlightRadar24, Netanyahu's official aircraft, headed to the United Nations General Assembly, skirted out huge segments of European airspace on Thursday.\n\nAlso Read |‘Conspicuously muted’: Sonia Gandhi calls out Modi govt's ‘profound silence’ on Palestine crisis\n\nThe records indicate the plane skirted around the eastern Mediterranean, flew over Greece and Italy briefly, then sharply turned southwest over the Strait of Gibraltar before crossing the Atlantic west.\n\nThis led to a near-13-hour flight, an extra two and a half hours on top of a standard Tel Aviv–JFK flight.\n\nThough Israel did not comment officially on the re-routing, the decision seems to be linked to an increasing diplomatic shadow being thrown by theInternational Criminal Court(ICC).\n\nAlso Read |Microsoft disables services for Israeli military amid surveillance allegations\n\nIn 2024, the ICC issued an arrest warrant for Netanyahu over alleged war crimes committed during Israel's military operations in Gaza. While Netanyahu has dismissed the charges as \"absurd and false,\" the legal implications are proving harder to ignore.\n\nThe Israeli prime minister appeared to steer clear of ICC member nations, as he might be compelled to land and get arrested. Neither the US nor Israel is part of the organisation.\n\nFlightRadar24 data indicated that Netanyahu's flight briefly flew over Greece and Italy but completely skirted French and Spanish airspace, extending the flight time.\n\nAlso Read |‘It will not bind Israel’: Netanyahu rejects Western recognition of Palestinian state\n\nCNN reported, quoting sources, that France had greenlit Netanyahu's flight passing through its airspace, but the Israeli PM avoided it.\n\nThis comes after many European nations used the UN General Assembly platform to announce the recognition of a Palestinian state, which Netanyahu and his government have opposed.\n\nSlovenia on Thursday declared a ban on Netanyahu, citing ICC proceedings against him over alleged war crimes.\n\nAlso Read |Israel increasingly facing outrage from West; being shielded by Trump, for now\n\nIn July, Slovenia barred Israeli ministers Bezalel Smotrich and Itamar Ben Gvir for inciting \"extreme violence and serious infringements of the Palestinian people's human rights\" with \"their genocidal declarations\".\n\n\"For some governments, giving Netanyahu permission to fly over their country would be a political liability,\" explained Steve Ganyard, a former US State Department official and ABC News contributor.",
  "url": "https://www.hindustantimes.com/world-news/why-israel-pm-benjamin-netanyahu-avoided-european-airspace-on-the-way-to-un-101758872151205.html",
  "scraped_timestamp": "2025-09-26T17:02:31.998254",
  "content_length": 2916,
  "word_count": 434,
  "source_domain": "www.hindustantimes.com"
}