{
  "title": "Why Family Matters actor Darius McCrary was arrested near the US–Mexico border? Details",
  "content": "Actor Darius McCrary, the star of the 1990s hit show Family Matters, was taken into custody along the US-Mexico border earlier this week. The U.S. Border Patrol arrested the 49-year-old McCrary, best known for playing the role of Eddie Winslow, as per ABC 7. He is currently in aSan Diegojail, imprisoned without bond.\n\nFollowing the discovery of an out-of-state felony warrant, authorities verified McCrary's arrest on Sunday. Information on the charges against him has been publicly revealed. McCrary is expected to appear in court on Wednesday, as reported by People magazine.\n\nAlso Read:Leo Woodall feels ‘objectified’ playing heartthrob roles? Actor answers\n\nAnn Barlow, the actor’s representative, told TMZ that McCrary’s arrest due to a warrant out of Michigan was because of a missed court appearance. She explained to the outlet that the matter was linked to his failure to pay child support. Notably, the Family Matters star has been arrested twice for allegedly failing to pay child support to ex-wife Tammy Brawner.\n\nThe actor’s rep told US Weekly in a statement, “Darius was doing a good deed when he discovered he had a felony warrant at the Border of Mexico for a missed court appearance.” The statement also said that in an ongoing child support dispute, “Oakland County mailed the notice to appear to Darius PO BOX giving him only 3 days to appear inMichiganCourt. Unfortunately Darius had Covid therefore did not check his PO Box until the day after his court date. However immediately notified the Judge with a doctor's note diagnosis of Covid.”\n\nAlso Read:Tilda Swinton confirms she'll take a break from acting: Things have got a little crazy…\n\nDarius McCrary is famous for playing Eddie Winslow, the oldest son of the Winslow family, in the television showFamily Matters, which lasted from 1989 to 1998. The sitcom soon became popular due to its humorous content and portrayal of families. After the series ended, McCrary went on to appear in a number of projects, such as Anger Management, The Young and the Restless, and Monogamy, as per US Weekly.\n\nHe was arrested by the U.S. Border Patrol for an out-of-state felony warrant. Details of the warrant have not yet been made public.\n\nHe is currently being held at a San Diego jail without bail.\n\nMcCrary is scheduled to appear in court on Wednesday.",
  "url": "https://www.hindustantimes.com/world-news/us-news/why-family-matters-actor-darius-mccrary-was-arrested-near-the-us-mexico-border-details-101760195798878.html",
  "scraped_timestamp": "2025-10-11T23:46:11.374793",
  "content_length": 2321,
  "word_count": 384,
  "source_domain": "www.hindustantimes.com"
}