{
  "title": "Why did Trump drop last-minute plan to invite Netanyahu to Gaza summit? Mid-air power struggle that prompted decision",
  "content": "US PresidentDonald Trump’slast-minute plan to inviteBenjamin Netanyahuto a multinational Gaza summit in Egypt had to be dropped after Turkish president Recep Tayyip Erdoğan said that if the invitation stood, he would not land his plane in Sharm el-Sheikh. The summit in Egypt backing the conclusion of theIsrael-Hamasconflict was aimed at \"ending the war in the Gaza Strip, enhancing efforts to achieve peace and stability in the Middle East, and ushering in a new era of regional security and stability,\" according to the Egyptian presidency.\n\nRead More |Biden hails Trump after Hamas hostages' release, ‘The road to this deal was not easy’\n\nThe power struggle began when it was revealed that Netanyahu had accepted a late invitation from Trump to the conference. The summit was jointly chaired by the US president and his Egyptian counterpart, Abdel Fatah al-Sisi, in Egypt. The Israeli prime minister’s presence had been sealed by Trump in a phone call from Israel on Monday morning with Sisi, October 13, as reported by The Guardian.\n\nRead More |Trump's stern words to Emmanuel Macron during tense handshake at Egypt summit revealed by lip reader, ‘You hurt me’\n\nIt is unclear whether Natanyahu changed his plans because of Erdoğan’s refusal to land. Erdoğan reportedly raised his objections from his plane while speaking to Sisi.\n\nA statement from the Israeli prime minister’s office said, “Prime Minister Netanyahu was invited by US President Trump to participate in a conference taking place today in Egypt. The prime minister thanked President Trump for his invitation but stated that he would not be able to attend due to the proximity of the event to the start of the holiday.”\n\nFigures on the extreme right in Netanyahu’s coalition government had also said they would resign if he attended the summit. Notably, international criminal court arrest warrants have been issued against the Israeli prime minister for alleged war crimes in Gaza.\n\nAs many as 20 world leaders attended the summit, including heads of Qatar, Palestine, Turkey, Spain, the United Kingdom, Italy, Norway and representatives from the United Nations and European Council. Israeli officials and representatives from Hamas were notably missing.",
  "url": "https://www.hindustantimes.com/world-news/us-news/why-did-trump-drop-last-minute-plan-to-invite-netanyahu-to-gaza-summit-mid-air-power-struggle-that-prompted-decision-101760427748777.html",
  "scraped_timestamp": "2025-10-14T14:31:27.251082",
  "content_length": 2223,
  "word_count": 353,
  "source_domain": "www.hindustantimes.com"
}