{
  "title": "Why Pete Hegseth called urgent generals meeting in Quantico; fitness test theories surface",
  "content": "Secretary of WarPete Hegsethsummoned senior US military officials for an unprecedented meeting next week in Virginia. The meeting will be attended by hundreds of generals and admirals, who will head to the Marine Corps base in Quantico, next Tuesday.\n\nThe move has been described as unusual, but the reason for the meeting being called seems to be unknown. One official quipped that it was being referred to as ‘general squid games’, CNN reported.\n\nWhile there is no official confirmation of what the meeting will likely be about, there are multiple theories going around. One of them is that there might be a group fitness test, CNN reported, citing a source familiar with the matter.\n\nAnother theory suggested there might be a briefing on the state of the Defense Department, which PresidentDonald Trumprecently named theDepartment of War. Theories also suggest that the meeting could be about mass firing of officers, the publication added.\n\nMeanwhile, security concerns have been raised by some about so many high-ranking officers being present in one place at the same time. A Congressional aide told CNN that there was no ‘good reason’ for the meeting unless Hegseth planned on announcing ‘a major new military campaign or a complete overhaul of the military command structure.’\n\nThe meeting, first reported by The Washington Post, comes on the heels of several unusual and unexplained actions that the Secretary of War has taken involving military leaders.\n\nHegseth, in May, ordered that the military cut 20 percent of its four-star general officers, and directed an additional 10 percent cut from all general and flag officers across the force. He also told the National Guard to shed 20 percent of its top positions.\n\nEarlier, in February, Hegseth fired Adm. Lisa Franchetti, the Navy's top officer, and Gen. James Slife, the Air Force's second highest officer, without giving any explanation. He also relieved the military's top lawyers.\n\nHegseth has also fired other military leaders without saying why. Most recently it was a general who led a military intelligence agency whose initial assessment of US damage to Iranian nuclear sites in American strikes angered President Trump.",
  "url": "https://www.hindustantimes.com/world-news/us-news/why-pete-hegseth-called-urgent-generals-meeting-in-quantico-fitness-test-theories-surface-101758822426756.html",
  "scraped_timestamp": "2025-09-26T00:13:56.076457",
  "content_length": 2192,
  "word_count": 351,
  "source_domain": "www.hindustantimes.com"
}