{
  "title": "Why the ‘Air Jaws’ photographer is rewilding land in Africa",
  "content": "EDITOR’S NOTE:Call to Earth is a CNN editorial series committed to reporting on the environmental challenges facing our planet, together with the solutions.Rolex’s Perpetual Planet Initiativehas partnered with CNN to drive awareness and education around key sustainability issues and to inspire positive action. Wildlife photographer and conservationist Chris Fallows is a Call to Earth guest editor.\n\nAlmost 25 years ago, when Chris Fallows captured his famous photograph of a great white shark breaching the surface at False Bay, off Cape Town, the area was a hotspot for the predators.\n\nBetween 2000 and 2015, research surveysidentifiedaround 1.64 shark sightings per hour in the area. Around 15 years later, sightings started to dwindle, and by late 2018, great whites completely disappeared from False Bay.\n\nSomeresearchersblame a pair of predatory killer whales for the decline — suggesting the sharks simply fled — but others, including Fallows point to human behavior such asoverfishingand the use of shark nets.\n\nWhatever the reason, for Fallows, the loss was personal.\n\n“[My wife and I] could not have fought harder to save those animals,” said Fallows, who travels the world with his wife Monique photographing wildlife. “We truly poured blood, sweat and tears into chasing poachers with our boats, getting huge numbers of people to sign petitions and forcing government to effectively have special meetings to consider the massive pressure that was being put on them [the sharks].”\n\nWhen they couldn’t save the great whites, they decided to turn their attention to conservation on dry land. “You can’t own the ocean, but you can own land,” said Fallows. “We can control what happens on that land, and make sure it’s in the best ecological and biological interests of those environments.”\n\nUsing part ofthe proceeds from the sale of his fine art photography, in 2017 the pair bought around 25 hectares (61 acres) of land on the western banks of the Breede River in Cape Infanta, South Africa’s south coast.\n\nA team of specialists was hired to clear alien tree species which had taken over the land — including the acacia which was introduced to South Africa from Australia in the 19th and 20th centuries.\n\n“It was hard to believe anything would grow where the aliens had been, but slowly, pioneer species started appearing,” Fallows said. “These then fixed nitrogen into the soil and other indigenous species started to appear.”\n\nToday, the property is unrecognizable, he says. Where once the acacia stood, there is now anincredible amount of wildlife, such as flourishing natural fynbos — a native shrubland vegetation — and antelopes including bushbucks, elands, duikers and Cape grysboks feeding on the vegetation.\n\n“We have baboons, caracals, honey badgers and even the occasional leopard as predators,” he said. “We have many different reptiles and incredible birds— eagle owls, jackal buzzards, kestrels, harriers and falcons.\n\n“Quite simply, our property is alive with what should be here.”\n\nInspired by the transformation, neighboring landowners soon started to do the same, Fallows said, expanding the conserved land to around 1,500 hectares (3,706 acres).\n\nThe Fallows are now in the process of purchasing a 10,000-hectare (24,710 acre) property in Namibia, again funded through photography sales, which they estimate have raised around $1 million so far for acquiring land.\n\nOnce the area is rehabilitated, they hope to team up with neighbors and local organizations to create what they say will be one of Africa’s largest privately owned wildlife reserves, possibly covering close to 2 million hectares (around 5 million acres).\n\n“The vision is to create these huge unbroken corridors that allow the natural migration of animals,” said Fallows.\n\nThe plan is to eventuallymerge with four other conservation landscapes including Fish River Canyon in southern Namibia, where an initiative to create theworld’s largest black rhino sanctuaryis already taking shape.\n\nFallows recognizes that it’sa huge undertaking but said it would be “a dream.”\n\n“If in our lifetime we can all collaboratively get that right…we can bring back charismatic wildlife that used to be in that area… like cheetahs, black rhinos and increasing the numbers of brown hyenas,” he added.\n\nFallows’ ultimate goal, though, is to see lions and desert elephants in the area again.\n\n“The feeling of being able to help those animals and restore environments is priceless,” he said. “Being in touch with nature and seeing nature rebound and all the rewards that come with that; being able to give back, rather than just to take, is very special.”",
  "url": "https://edition.cnn.com/world/africa/air-jaws-photographer-chris-fallows-rewilding-spc",
  "scraped_timestamp": "2025-09-26T16:27:52.626958",
  "content_length": 4630,
  "word_count": 733,
  "source_domain": "edition.cnn.com"
}