{
  "title": "Why 1 million cats have taken over the streets of Cyprus",
  "content": "Officials in Cyprus, the small island nation in the eastern corner of the Mediterranean, estimate there is roughly one feral cat for every one of its 1 million inhabitants — though activists contend the actual population is hundreds of thousands higher.\n\nIn late September, the island’s parliamentary committee on the environment was told that an existing sterilization program is too limited to contain the burgeoning cat population.\n\n“It’s a good program, but it needs to expand,” said Environment Commissioner Antonia Theodosiou, noting that the program conducts only about 2,000 sterilizations annually on a budget of just 100,000 euros ($117,000).\n\nWhile there is no official comparative data, Theodosiou said Cyprus has gained a reputation for having a cat population that is exceptionally large relative to its human inhabitants.\n\nChange might be on the way, but funding alone won’t solve Cyprus’s cat problem.\n\nAppearing to heed calls for more funding, Environment Minister Maria Panayiotou announced on Oct. 4 — World Animal Day — that the government would raise cat sterilization funding to 300,000 euros annually. The decision was hailed as a significant step forward.\n\nHowever, Charalambos Theopemptou, chairman of the Parliamentary Environment Committee, warned against relying on money alone. “There has to be a plan,\" he said. \"We can't just go ahead with sterilizations without having a plan,” he said.\n\nGiven cats’ predatory nature, a large population not only has the potential to wreak havoc with the island’s ecosystem, but it could cause undue suffering for feral felines roaming car-choked streets in search of food and shelter.\n\nCyprus has a long history as a cat-loving nation where cat food dispensaries and clusters of tiny houses are a regular sight along popular footpaths.\n\nTwo decades ago, French archaeologists unearthed what they believed to be the earliest evidence of a domesticated cat in a 9,500-year-old neolithic village. They found the bones of a cat close to the skeletal remains of a human, suggesting that they were buried together.\n\nAdding to this long history of human-feline connection is the 4th century legend of Saint Helen who, after finding the True Cross in the Holy Lands, brought over a couple of boatloads of cats to deal with a snake infestation. A monastery that serves as a feline safe haven, St. Nicholas of the Cats, still exists today.\n\nWith tourism a key economic driver for Cyprus, the island’s cats have become a major attraction for the millions of vacationers who descend on the island every year. The well-fed felines are a common sight, often seen feasting on leftovers provided by visitors at the plethora of restaurants where they like to hang out.\n\nDemetris Epaminondas, president of the Veterinary Association, attributes the exploding population to unchecked breeding, particularly in high-concentration urban areas, and to more kittens surviving birth, thanks to ordinary folks offering care.\n\nThe current government-run program disburses its budget to municipalities which, in turn, fund private veterinarians to sterilize cats brought in by animal conservation groups.\n\nAuthorities acknowledge the program is ineffective.\n\nThe country’s state-run Veterinary Services, which is in charge of sterilizations, conceded that the program’s capabilities are \"lesser than the real need.” To reassess where available funding could be redistributed, it has asked local government authorities to submit reports on locations with large feral cat concentrations.\n\nElias Demetriou who runs the private sanctuary Friends of Larnaca Cats said tripling sterilization funds won't have the desired effect unless conservationist groups who have the know-how are recruited to round up cats for sterilization.\n\nEleni Loizidou, head of Cat Alert, a volunteer organization caring for strays in Nicosia, said her organization’s recent efforts to round up 397 feral cats from the city center were a mere drop in the ocean — and that too few females are being sterilized, partly because of the difficulty in trapping feral cats.\n\nEpaminondas, the Veterinary Association president, said Cyprus' cat population can be brought under control in as few as four years. This would be possible, he said, if authorities cobble together a unified sterilization plan that would put private clinics at the forefront of the effort by offering free-of-charge neutering without all the red tape that complicates the process.\n\n“People will be more motivated to get cats neutered if we make it easier for them to do so,” he said.\n\nHis association has proposed a plan that would identify major cat concentration centers where authorities can round them up and take them for sterilization at designated vets. The initiative includes the creation of a smartphone application that would allow anyone to help authorities locate such large cat concentrations.\n\nThe state can avoid bearing the full cost of the program by setting up a fund where people and businesses can donate, according to Epaminondas. The minister's announcement about tripling the sterilization budget, he said, could act as a significant incentive for more corporate donations.\n\nThe cost of sterilizing a female feral cat in Cyprus is 55 euros ($64), which goes up to 120 euros for domesticated cats brought in by owners, as they receive more specialized care.\n\nTheodosiou, the environment commissioner, said her staff have worked on a long-term strategy that would bring together government, conservationists, and volunteers to establish a precise cat population count and pave the way for a mass sterilization program. The plan would also legalize private cat sanctuaries.\n\n“There are solutions,” Cat Alert's chief Loizidou said.",
  "url": "https://www.hindustantimes.com/world-news/why-1-million-cats-have-taken-over-the-streets-of-cyprus-101760423884254.html",
  "scraped_timestamp": "2025-10-14T15:59:26.398209",
  "content_length": 5728,
  "word_count": 889,
  "source_domain": "www.hindustantimes.com"
}