{
  "title": "'Won't contest in Bihar, party has decided': Prashant Kishor's big announcement",
  "content": "Jan Suraaj Party founder Prashant Kishor on Wednesday announced he won't be contesting the high-stakes Bihar Assembly elections set for November. He said the decision was taken by his party for its greater good.\n\n\"It was a decision we took in the larger interest of the party. If I were to contest, it would have distracted me from the necessary organisational work\", Kishor told news agencyPTI.\n\nKishor also said that another candidate of his party was fielded from the Raghopur seat in Biharagainst RJD's Tejashwi Yadav, because of the collective decision. It was earlier speculated that Raghopur would see a Prashant Kishor vs Tejashwi Yadav contest, but the Jan Suraaj Party instead fielded a local businessman, Chanchal Singh, from the seat.\n\n\"If Jan Suraaj Party wins the Bihar polls, it will have a nationwide impact. The compass of national politics will point in a different direction,\" Kishor asserted.\n\nKishor also expressed confidence on his party's prospects in the upcoming polls, asserting he was certain that the contest would either be a huge win or a total debacle for the party,\n\n“I can say with certainty that we I have been stating on record that I expect a tally of either fewer than 10 seats or more than 150 seats. There is no possibility of anything in between,” he toldPTIin an exclusive interview.\n\nDuring the interview, Prashant Kishor was also asked whom would be side with, the NDA or the INDIA bloc, in case of an hung assembly in Bihar.\n\nResponding to the question, Kishor said a fractured mandate was an impossibility. He, however, added, \"A tally less than 150, even if it is 120 or 130, shall be a defeat for me. If we do well, we will have the mandate to transform Bihar and make it count among the 10 most advanced states of the country. If we do not do well enough, it would mean the people have not shown enough confidence in us, and we must continue to carry on with our politics of the street and society (samaj aur sadak ki rajneeti)\".\n\nPrashant Kishor's party has released three candidate lists so far. Polling for the 243-seat Bihar Assembly is scheduled for November 6 and 11, with vote counting on November 14.",
  "url": "https://www.hindustantimes.com/india-news/prashant-kishor-announces-he-wont-contest-bihar-elections-jan-suraaj-party-decision-101760500281841.html",
  "scraped_timestamp": "2025-10-15T10:17:01.522725",
  "content_length": 2156,
  "word_count": 375,
  "source_domain": "www.hindustantimes.com"
}