{
  "title": "‘World’s first net-zero energy mosque’ is made with mud and solar panels",
  "content": "Ancient rammed-earth construction techniques and cutting-edge solar technology might seem an unlikely pairing.\n\nBut it’s at the core of what’s described as the “world’s first net-zero energy mosque,” in Abu Dhabi, which is planned to open in October and is designed to operate with no carbon emissions.\n\nCommissioned by Masdar City — a sustainable urban development around 30 kilometers (18.6 miles) from downtown Abu Dhabi — and designed by British multinational construction firm Arup, the mosque will generate 100% of its energy needs on-site through solar panels, and employ passive cooling and circular design techniques to reduce operational energy use by a third and water consumption by more than half.\n\nOne of the key challenges the designers had to overcome was the fixed direction of the mosque, dictated by the qibla wall, which always faces Mecca.\n\n“Often we would want to optimize orientation to minimize the impact of solar and heat gain,” explained Paul Simmonite, associate director at Arup, in a video call.\n\nInstead, the team had to explore other methods, including canopies, angled windows and skylights, wall insulation, and cooling materials for the exterior.\n\nInspired by the rammed-earth construction ofAl Bidyah Mosque— the UAE’s oldest known standing mosque, thought to date from the 15th century — the project used soil from a local quarry to construct the 60-meter-wide, seven-meter-tall (197-feet-wide, 23-feet-tall) qibla wall to keep the heat out, said Amna Al Zaabi, a senior analyst on Masdar City’s design management team, in a video call.\n\n“That entire western facade, which is the one that experiences the highest amount of solar gains, is actually double fortified,” said Al Zaabi, adding that a structure of this scale using this technique “has never been done here in the UAE.”\n\nThe mosque will be able to accommodate up to 1,300 worshippers, and will use smart sensors to monitor occupancy, temperature and humidity, turning on fans and air conditioning only when necessary.\n\nAl Zaabi hopes that the project can be a “blueprint” for future mosques — and perhaps other community structures in Abu Dhabi, and beyond.\n\nThis Abu Dhabi photographer is on a mission to define his country’s ‘architectural identity’\n\nWhen it comes to constructing greener mosques more widely, Khaled Alawadi, an associate professor of civil and environmental engineering at Abu Dhabi’s Khalifa University, who isn’t involved with the Masdar Project, says sustainability credentials are a plus, but optimizing residential buildings is more important.\n\n“But, if we can think of more passive design solutions for the mosques — like more natural lights, cross ventilation during the wintertime — that’s something to think about,” he added.\n\nMasdar’s net-zero mosque is part of a broader trend in the UAE to rethink sacred spaces.\n\nThe Estidama Mosque, the first in Masdar City, which opened last year, also integrates innovative, sustainable architecture and uses solar panels, gray water recycling, and a sunken position among gardens to reduce energy use. It achievedLEED Platinumcertification — the highest international standard for green buildings.\n\n“We wanted to do a mosque that is inspired by Islamic architecture and principles, but at the same time, it represents today’s society and culture, today’s technology and method of construction,” said Farid Esmaeil, co-founder of X Architects, the firm behind Estidama Mosque.\n\nAs a living lab for sustainable technology and design, Masdar City’s eco-friendly ethos made the project easy to implement, said Esmaeil. It’s provided a proof-of-concept that is encouraging more clients to seek green credentials, he added: “Over time, it’s becoming easier and easier, because people are starting to see the benefits.”\n\nTheAbrahamic Family House, an interfaith complex opened in 2023 inSaadiyat Cultural District, reimagines the aesthetic of its on-site mosque, synagogue, and church with minimalist, geometric designs that highlight the respective religions’ similarities and individualities.\n\nAccording to Alawadi, these modern and minimalist approaches are driven by designer creativity and relaxed building codes.\n\n“The language of mosque design has completely changed during the past decade,” he said, adding: “What is important about mosque design is that there are the minarets, the dome, the mihrab (a recess in the qibla wall) — these are the core elements that you should have in a mosque. Otherwise, the design itself is very adaptable.”",
  "url": "https://edition.cnn.com/world/middleeast/net-zero-energy-mosque-abu-dhabi-spc",
  "scraped_timestamp": "2025-09-26T17:37:23.638859",
  "content_length": 4510,
  "word_count": 694,
  "source_domain": "edition.cnn.com"
}