{
  "title": "Yemen drone attack injures more than 20 in Israeli city of Eilat, including two in serious condition",
  "content": "At least 22 people were injured, including two seriously, after a drone fired from Yemen hit the city of Eilat in southern Israel on the Red Sea coast on Wednesday, Israeli officials said.\n\nVideo and images from emergency responders and the Israeli military appear to show the drone landing near stores and restaurants. The drone was fired during the final hours of the holiday of Rosh Hashanah, which marks the Jewish new year.\n\nTheIran-backed Houthishave repeatedly launched drones and ballistic missiles at Eilat and other areas in southern Israel, but these launches are frequently intercepted. It’s unclear how Wednesday’s drone penetrated Israel’s air defenses.\n\n“Interception attempts were made, and search and rescue teams are operating in the area where the report was received regarding the impact,” the Israel Defense Forces (IDF) said in a statement.\n\nMany of those who were injured in the attack suffered shrapnel from the explosion, according to Magen David Adom (MDA), Israel’s emergency response service. A 60-year-old man who was seriously injured was struck by shrapnel in his limbs, while a seriously injured 26-year-old man suffered shrapnel wounds to his chest, MDA said. One other person suffered moderate injuries, MDA said.\n\nThe IDF said in a separate statement that its troops “are assisting in evacuating civilians from the area and providing initial medical care.”\n\n“An IDF helicopter was dispatched and is currently assisting in evacuating injured individuals from the scene,” it added.\n\nThe Houthi militant group in Yemen later claimed responsibility for the attack, calling it a “qualitative military operation.”\n\nIsraeli Defense Minister Israel Katz vowed to revenge against Houthis following the attack on the city. “The Houthi terrorists refuse to learn from Iran, Lebanon, and Gaza – and they will learn the hard way,” Katz said in a statement.\n\n“Whoever harms Israel will be harmed sevenfold,” Katz added.\n\nSirens fail as Houthi drone hits arrivals hall at Ramon Airport in southern Israel, authorities say\n\nEarlier in September, a drone launched from Yemen by Houthi rebels hit the arrivals hall at Ramon Airport in southern Israel on Sunday, the Israeli military and the Israel Airports Authority said. No sirens were sounded, the IDF said, since the drone was identified but not classified as hostile. An “extensive investigation” was expected.\n\nSince Israel’s war with Hamas in Gaza began in October 2023, the country has come under fire from missiles and drones from the Houthis in Yemen, who claim to strike Israel in solidarity with the Palestinians. Israel has carried out waves of strikes targeting Houthi military facilities and civilian infrastructure the IDF says is used by the Houthis.\n\nBut the long-range exchange of fire has escalated recently.\n\nIn late August,Yemen’sHouthi rebels vowed to take revenge for the killing of their prime minister and other political leaders by Israeli airstrikes earlier that month.\n\nIsrael struckthe Houthis after the Iran-backed rebels fired a new type of missile at Israel. The Israeli military said it struck a military site where the presidential palace is located, as well as two power plants and a fuel storage site.\n\nThe Houthis confirmed Prime MinisterAhmed al-Rahawiwas killed in a strike on the Yemeni capital Sanaa, which also left others seriously wounded. Al-Rahawi is the most senior figure in the Iran-backed Houthis to be killed in Israeli’s campaign against the group.",
  "url": "https://edition.cnn.com/2025/09/24/world/yemen-drone-attack-eilat-intl-latam",
  "scraped_timestamp": "2025-09-26T00:58:32.656645",
  "content_length": 3468,
  "word_count": 546,
  "source_domain": "edition.cnn.com"
}