{
  "title": "Zelensky calls for end to Ukraine war after Trump's Gaza peace plan ‘success’",
  "content": "Ukrainian President Volodymyr Zelensky on Tuesday once again called for an end to the \"war\" with Russia, saying that the \"momentum for advancing peace\" must not be lost after the Gaza peace plan deal.\n\nIn a post on X, Zelensky said, \"Now, as the war in the Middle East comes to an end, it is important not to lose the momentum for advancing peace. The war in Europe can also be brought to an end, and for that, the leadership of both the United States and other partners is of utmost importance.\"\n\nThe Ukrainian President further mentioned that he spoke to his Finnish counterpart, Alex Stubb, for over an hour, discussing and coordinating their positions on the matter.\n\nHighlighting US President Donald Trump's \"success\" in achieving the Gaza peace plan, Zelensky said that necessary actions by Washington can also help in ending the war in Ukraine.\n\n\"It is important that President Trump succeeded in implementing the necessary steps to secure the release of hostages and to stop the war in Gaza. Undoubtedly, the right actions by the United States can also help bring an end to Russia’s war against Ukraine. We have a corresponding vision for this,\" he added.\n\nZelensky said that he and Stubb also discussed the recent Russian strikes on the Ukrainian energy sector and the need to strengthen air defense.\n\n\"I am grateful for the readiness to help. Russia must be deprived of the means to continue its war and terror – and this can become the most reliable foundation for peace in our region,\" he added.\n\nJust this weekend, Zelensky had spoken to Trump over a phone call, wherein he congratulated the US President and asserted that if a war in one region can be stopped, then surely, \"the Russian war\" can be ended as well.\n\n\"I congratulated @POTUS on his success and the Middle East deal he was able to secure, which is an outstanding achievement. If a war can be stopped in one region, then surely other wars can be stopped as well—including the Russian war,\" the Ukrainian President had said.\n\nEarlier in the day, Zelensky said that Russia's \"aerial terror\" against Ukrainian cities and infrastructure continued on Monday night.\n\nHe alleged that 96 drones were launched, most of which were shot down by the Ukrainian defence system, but some reached their targets.\n\nZelensky said that Moscow on Monday evening dropped aerial bombs on Kharkiv, hitting a city hospital and injuring 57 people, adding that energy infrastructure in the city was also struck.\n\nListing several damages suffered across Ukraine, the President said that civilian infrastructure was hit in the Kirovohrad region, while energy facilities and an enterprise were damaged in the Sumy region.\n\nZelensky cited Ukraine's need for \"Patriot, NASAMS, SAMP/T, and other vital systems\", and called for action from the US, Europe, the G7 and all partners who possess these systems and can provide them to Kyiv.\n\n\"The world must compel Moscow to come to the table for genuine negotiations. Only peace through strength can bring results. I thank everyone who is helping,\" Zelensky said.",
  "url": "https://www.hindustantimes.com/world-news/zelensky-calls-for-end-to-russia-ukraine-war-after-trumps-gaza-peace-plan-success-101760429913386.html",
  "scraped_timestamp": "2025-10-14T16:01:16.898696",
  "content_length": 3051,
  "word_count": 512,
  "source_domain": "www.hindustantimes.com"
}