{
  "title": "Zelensky speaks to Trump, says if Gaza war can be stopped, ‘Russian war’ can end too",
  "content": "Ukrainian President Volodymyr Zelensky spoke to his American counterpart, Donald Trump, over a phone call on Saturday to congratulate him on the Gaza peace deal, and asserted that if a war in one region can be stopped, then \"surely\" the \"Russian war\" can be ended as well.\n\nIn a post on X, Zelensky said that he had a very positive and productive phone call with Trump. \"I congratulated @POTUS on his success and the Middle East deal he was able to secure, which is an outstanding achievement. If a war can be stopped in one region, then surely other wars can be stopped as well—including the Russian war.\"\n\nFurther, the Ukrainian President said that he informed Trump about Russia's attack on Kyiv's energy system, adding that he appreciates the Republican leader's \"willingness to support us\".\n\nAccording to Zelensky, the two leaders also discussed opportunities to strengthen Ukraine's air defense, as well as concrete agreements that the two sides are working to ensure this.\n\n\"There are good options and solid ideas on how to truly strengthen us,\" Zelensky added.\n\n\"There needs to be readiness on the Russian side to engage in real diplomacy—this can be achieved through strength. Thank you, Mr. President!\" Zelensky wrote in his X post.\n\nTrump on Thursday announced that Israel and Hamas had signed off on phase one of his Gaza peace plan deal, adding that hostages will return home soon. The ceasefire agreement was seen as a major achievement for the Trump administration, with several world leaders hailing the peace plan.\n\nRelations between the two leaders have warmed since February, when they sparred during a now-infamous televised meeting at the White House.\n\nTrump has since called Zelensky a \"nice guy\" and maintained support for Ukraine, which has been engaged in a crisis with Russia since its full-scale invasion in 2022.\n\nMonths later, in August, Zelensky was back in Washington, where he met the US President following the Trump-Vladimir Putin's meeting in Alaska.\n\nDuring their meeting, Trump said the US would be willing to support European efforts to police any peace deal in Ukraine. The US President also expressed his desire to stop the killing of countless individuals in the war.\n\n“People are being killed, and we want to stop that. I would not say it's not the end of the road. We have a good chance of doing it. It's been almost four years now,\" he said, adding that, “I know the president and myself and I believe Vladimir Putin want to see it ended.”\n\nTrump had even said that he expected Zelensky and Putin to hold a bilateral meeting before he held a trilateral meeting with them.\n\nHowever, last month, Trump said that he was \"very disappointed\" in Russian President Vladimir Putin, adding that this administration was planning to take some actions to bring down deaths in Russia's war in Ukraine.\n\nThe US President has long been trying to bring an end to the Russia-Ukraine conflict, a moment that has been emphasising since his presidential campaign days.",
  "url": "https://www.hindustantimes.com/world-news/ukraines-zelensky-speaks-to-donald-trump-russia-war-can-be-stopped-gaza-peace-plan-101760188986730.html",
  "scraped_timestamp": "2025-10-11T23:46:24.143809",
  "content_length": 2992,
  "word_count": 502,
  "source_domain": "www.hindustantimes.com"
}