{
  "title": "Zubeen death: SIT team conduct raids, tension outside manager's apartment",
  "content": "Guwahati, Assam Police's Special Investigating Team , probing the death of singer Zubeen Garg, conducted separate raids at the residences of Northeast India Festival organiser Shyamkanu Mahanta and his manager Siddhartha Sharma on Thursday, officials said.\n\nProtestors demanded the arrest of both and the situation turned tense outside Sharma's apartment block where the police baton-charged them after the mob threw stones at the police.\n\nAn SIT team visited the Zoo Road residence of Mahanta where none of his family members, except for two helpers, were present in the house. He was the chief organiser of the festival in Singapore where the singer died by drowning on September 19.\n\nAnother team went to the apartment where Sharma lived in the Dhirenpara area of the city and found it locked.\n\nA group of people, which had gathered outside the residence of Garg's manager, hurled stones at police vehicles following which the security personnel baton-charged them, officials said. The police personnel were escorting an SIT team to the manager's house in connection with its probe into the singer’s death. The angry protestors were demanding his immediate arrest for being allegedly responsible for the singer's death. They also tried to break open the main entrance gate to the apartment block premises but a heavy deployment of police force prevented them. When the SIT team members were leaving the compound, the protestors hurled stones at the vehicles and prevented them. The police personnel on duty at the gate were also attacked. The police resorted to a mild lathi-charge to disperse the crowd so that the police vehicles could move out of the area. The police have detained two persons from the mob for allegedly provoking the crowd gathered to create disturbances in the area, an official said.\n\nEarlier, the SIT team broke the lock of Sharma's residence in the presence of a magistrate, and conducted a search.\n\nSharma's mother, brother and sister also lived in the apartment, but they were not seen since the day Zubeen died, according to residents of the building. A crowd had also gathered outside the house of Mahanta and demanded his arrest. The local people of the area said they have decided not to allow Mahanta and his family to live there. The SIT officials refused to speak to the media at both the venues. The investigating team was seen carrying bags of documents and laptops while leaving the two houses. Zubeen's musician, Shekhar Jyoti Goswami, who also accompanied him to the South East Asian nation and was present with him during his last moments, has also been taken into police custody. The Assam government has constituted a 10-member SIT, led by Special DGP M P Gupta, to investigate the singer's death.\n\nAssam Chief Minister Himanta Biswa Sarma on Thursday said the state government will recommend a CBI inquiry if the SIT investigation is found to be ''unsatisfactory''. ''I appeal to people to have faith in the SIT probe and not circulate rumours on social media which may hamper the investigations,\" Sarma said on the sidelines of a programme here. Meanwhile, Mahanta in a video, which some media channels claimed was a social media live, claimed that he was not involved in the incident in any way but some people have deliberately launched a ''campaign to blame and defame us for the sake of TRP''. The live recording was not available on any of his social media handles and PTI could not independently verify the authenticity of the video that surfaced. ''I and my team were very far from where the incident happened and we are not involved in it in any way,'' he is heard saying in the clip.\n\nGarg's team members, including a cousin, and members of the Assamese community in Singapore were present when the fatal incident occurred, he claimed, asserting that \"it is not a sin to invite\" Garg to the festival.\n\nGarg was the 'brand ambassador' of the festival since 2013 and there are many videos where he has said that he was a part of the festival, Mahanta said.\n\n''Zubeen had said on many occasions that we will organise the festival together and he always attends our events,'' he added. Mahanta is heard saying that he had planned to return to Guwahati on Thursday but he ''received thousands of messages threatening to kill me'' and so decided against returning.\n\nHe also said that the death of the singer was an irreparable loss for the entire state and the country while he was pained at not being able to extend his support to Garg's wife, who is like ''my sister'', at this hour of extreme grief and loss.\n\nThis article was generated from an automated news agency feed without modifications to text.",
  "url": "https://www.hindustantimes.com/india-news/zubeen-death-sit-team-conduct-raids-tension-outside-manager-s-apartment-101758818324815.html",
  "scraped_timestamp": "2025-09-26T00:33:49.447155",
  "content_length": 4655,
  "word_count": 787,
  "source_domain": "www.hindustantimes.com"
}